[{"name": "\n\n\n\n\n\n\n\nHP Pavilion 14 11th Gen Intel Core i5 14-inch (35.5 cms) Thin & Light FHD Laptop (8GB/512GB SSD/Windows 10/MS Office/Natural Silver/1.41 kg) ##  14-dv0543TU\n\n\n\n\n\n\n", "mrp": " ₹71 ## 385.00", "save": "\n\n\n\n₹11 ## 395.00 (16%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 11th Gen Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology ##  8 MB L3 cache ##  4 cores) # Memory & Storage: 8 GB DDR4-3200 MHz RAM (2 x 4 GB) ##  upgradable upto 16 GB| Storage: 512 GB PCIe NVMe M.2 SSD # Display: 35.6 cm (14\") diagonal ##  FHD (1920 x 1080) ##  IPS ##  micro-edge ##  anti-glare ##  250 nits ##  45% NTSC # Graphics & Networking: Intel Iris Xᵉ Graphics | Realtek RTL8822CE 802.11a/b/g/ac (2x2) Wi-Fi and Bluetooth 5 combo # Operating System & Preinstalled Software: Pre-loaded Windows 10 Home with lifetime validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Microsoft Office Home & Student 2019##", "no_of_rating": "1 ## 073 ratings", "avg_rating": "4.4", "total_no_answer": "\n357 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery.", "Model": "HP Pavilion Laptop 14-dv0543TU", "Brand": "HP", "SpecificUses": "Multimedia", "ScreenSize": "14 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 46 mins\n", "emi": true, "exchange": true, "five_star": "64%", "four_star": "24%", "three_star": "4%", "two_star": "1%", "one_star": "7%", "reviews": " ####   Good configuration but laptop body should be mat finish because surface is smooth I don't like it and may slip laptop ####   Found best value for money with all the required features I wanted. Liked finger scan to login. Could have provided a hard switch for camera. ####   Keypad not proper. Returned the laptop ####   MS Office Not working within one month ####   Display gone with 2 months.. But anyway their service was.. They had it replaced and delivered to my home.. But am disappointed bcoz of the quality ####   Good laptop with a decent hardware spec ##  was able try out some heavy graphics games and sever configuration. The disappointment was the promised MS word processing software with life long validity. Where the seller did not share the product key. This is a common scenario as many other buyers are also complaining. License software subscription is around INR 1200 per year ##  so please factor in that also in ur owner ship cost. ####   Good one ##  but price bit high ####   Laptop received exactly as per specs. I have opened the package in front of delivery boy based on few -ve reviews. However ##  I did not have any -ve surprises. ####   It's a nice and sleek laptop. The performance is very smooth. ####   THE PROCESSOR MENTIONED ON WEBSITE IS OF 4.2GHZ BUT WHAT I RECIEVED IS OF 2.4GHZ ####   Black Screen! ####   MS office is not working after one month of use. ####   Sound quality not so good ####   Very happy with the purchase. ####   Charger is not working. Its not charging the laptop. I need the replacement ####   Everything is perfect for this lappy ####   So far its been 2 months and no problems! I tried to buy from Amazon but needed urgently due to my Alienware 17 Dell bought before 2 years not working. ####    System turns off automatically in few seconds so poor ####   Everything is good less boot time  wonderful speed sufficient batterylife neet and clear display .only thing I can't able to find accessories . ####   I really dislike this product... Its not much as expected. Build quality is not upto mark. Disappointed with it ####   Great speed ##  love back lit lights for working in dim light. Good for IT jobs ####   Good laptop.....body plastic but looks premium ####   I bought it and i cant leave without it ####   Very fast ####    Please exchange the product immediately. The monitor screen is not switching on. This is the 2nd time I switched it on and its not working. I just purchased it on 2nd September 2021. ####   MS Office is not activated. Amazon installation services is useless ##  the guy didn't have sufficient knowledge. Product is not delivered as promised. ####   I see screen gets some straight lines horizontally from time to time and it happens more during charging. Thread like lines. Is it a serious issue bcoz I have received this device just two hours before. Worried about this display issue ####   Got the HP pavilion 14 three weeks ago. Was really excited as I was using a HP probook 430 G2 ##  which had 4gb DDR3 RAM ##  i5 3rd gen and around 1tb HDD. So I think you guys have a clear image of how excited I was when I got the Pavilion with 16gb DDR4 RAM ##  i5 11th gen and intel iris XE. Let me give you a clear image of my purpose of this laptop. I am buying this laptop solely for the purpose of college ##  so for downloading all the softwares required in the mechanical engineering field ##  softwares required for assignments(power point ##  office ##  word) ##  softwares for communicating(whatsapp ##  telegram ##  mail) and entertainment platforms(netflix ##  prime ##  spotify) and other programs as potplayer ##  qbit and a bit of tweaking. The battery life on this ultrabook is really good( I can't really say the best even though I want to because I haven't really had the opportunity to explore the battery life of this laptop's direct competitors). It easily lasts upto 4.5-5 hours when I set the battery option to best performance). Its built quality dazzled me as it was really sturdy than it appeared. No loose hinges or anything. The screen stays where we set it ##  and no wobble while typing which shows the rubber grips are placed parallel to the surface. The display is bit less brighter than I anticipated ##  I would give it a 9/10. The typing experience is really good on this keyboard ##  however the color for the keyboard was a bit of a bad choice. I am a OCD type of person ##  So I get a bit irritated when I find smudges on the trackpad ##  keyboard ##  or on the inner surface of the laptop ##  but I doubt you guys will even notice it. The sound quality is really good on the laptop. This weighs around 1.4 kg so this laptop is easily portable ##  without compromising on performance ##  battery life and display (atleast for me). ####   Light weight and good design. Performance also sounds good. Only minus is there is no Ethernet  and VGA port ####   I HAD PURCHASED ON 14.06.21 But from 30.08.21 it is creating problem ##  Automatically got shut down and restarted after 5 minutes and again restarted. Why I dont know ##  and I have no warranty card also. ####   Worst Amazon experience ever. This laptop arrived with a defective battery and even after 3 hours of charging ##  the battery level remained at 65% when the power cord was removed from supply. Immediately on removing the power cord the laptop shuts down. There is no matter any charge left on the laptop battery which seems to be defective. Never expected such a faulty product from HP. Very pathetic and really disappointed. Could not return it or replace it without booking an inspection appointment. Waiting for them to arrive and inspect it. Never buy HP products as they dont appear to be QC ed properly. Could not give a negative rating so selecting 1 star. ####   Have a good in size ####   Worst build quality ####   Best in category. Light weight. Battery life is very good. ####   sometime in my meetings the laptop suddenly shuts down without even telling this is rare it has happend to me 3-4 times but overall very nice laptop and very light ####   Best laptop for students ## thank you appario seller ##  product is very good ##  and delivered before 1 day of estimated delivery date. ####   HP would not consider dead pixel in warranty as they need 2 dead pixels. Above that if in case there is a dead pixel ##  then they will try their best to put up many reasons to not entertain it in warranty ##  calling it customer induced damage.. LOL.. ####   Good laptop . ####   I was purchased on 9th July and system was dead on 23rd Aug'2021 during important work. ####   Overall good laptop ##  with good specs ##  ## there aren't somany issues with the laptop ##  ##  good display ##  sound quality is good ##  fast enough for any work ##  light weight ##  low fan noise ##  good viewing angles ##  best booting up and shutting down time ##  charges fastly  ## etc... ####   A bad choice purchase from amazon. After a week of use ##  the laptop screen display goes off every 5 to 10 minutes. When it goes off ##  I need to switch the laptop on ##  the display comes back and after 5 minutes again goes off ##  again switch it on.  Tired of it. Frustrated. Don't buy electronics from Amazon. ####   Battery life is 7 to 8 hrs. Although if you use heavy apps like chrome ##  the battery life drains in 6 to 5 hrs. But if you game it drains in 4 hrs. ####    I had seen the specifications and bought this laptop upon checking details this laptop is not 4.2ghz it is only 2.42 ghz. The battery does not last more than 2 hours ####   Incredible performance and refined design make this a winner. A brilliant screen and classic design meets a high price. Till now working satisfactorily. ####    I wasted my money and compain many time but they did not respond. ####   Overall performance is very good. Battery lasts for 4-5 hours. ####   Performance is great with lightening speed  ##  battery is okok and little heating issues ####   Display is not good. ####   A nice product works efficiently and fast enough.Only problem is that it heats a lot during usage. ####   The sound & camera quality is poor. Overall the laptop is performant. ####   It is a good laptop in this price as compared to other brands. Fast booting. Applications open in a blink of eye. Only thing which HP has in its legacy is heating. It gets heated even with normal working. Screen ##  speakers everything is better when compared with the same price range laptops of other brands. Charging speed is okay ##  cannot say fast. Battery holds up for 5-6 hours for normal office work. All in all a good buy. ####   Loved the size and lightweight of laptop. It surely gives premium feel. 512 SSD and 16 gb ram..boosts multitasking..did not face any issue yet. Only thing is don't buy this laptop for gaming as the keyboard keys looks delicate. ####   Better configuration and great performance ####   Laptop stopped working and does not power on in just 2weeks of purchase. HP support doesn't replace the system instead will send service engineer to fix it. Never expected such poor service ##  made a mistake of purchasing the laptop. I want the laptop to be either replaced or would like to return it for refund please. ####   Broken seals … so I am not sure that original product is inside … so returned.. very bad ..I came to a decision that better to buy offline… ####   Sleek ##  slim and works great ####   decent product lightweight  8/10 ####   Nice product in this price range ####   Very happy with the laptop. It's sleek ##  fast with 16gb RAM. ####   Nice ####    The laptop I received was having RAM issues which could only be diagnosed after 7 days. And so I have to incur the repair cost .Hence I would advise not to buy anything electronic from Amazon. ####   Update after one month usage - MS Office 2019 preinstalled edition became unlicensed version within 30 days and refused to activate. HP support shared their product sheet that stated that this laptop came only with a trial version of MS Office 2019. Now I am chasing seller Appario Retail to honour the commitment. ####   In my opinion it’s worth purchase below 60K ..experience after 15 days is very good.. sound quality and battery support  exceptional ####   Have been using this laptop since 4 month. Performance is great. It boots in second. Fingerprint reader works superfast. ####   Good laptop. ####   Laptop is good but Battery  gives 2 to 3 hours backup. HP has to upgrade their batteries..  At least 4 hour's back required.. ####   This product is very good for home use - for children's education and for home entertainment like watching movies and also for other normal computing purposes like web browsing ##  document management etc. ####   Do not purchase any HP ##  unless you are very sure of. The touch pad makes noise while scrolling or using. ####   Battery life is around 6 hrs ####   these laptop are good for nothing a pathetic sound and absolute poor battery life. ####   All good ##  except volume!! ####   Air vent is towards down side....can't keep the laptop in lap as it easily becomes hot....very good specs for this price but compramised for the build ####   Light weight.Afraid it is not sturdy as plastic body..but runs like a horse. No lag..no snags.. runs smoothly ####   Product is good however  giving 1 star  because of \"Amazon only\" who  is highlighting under partner offer ####   After 4 months of use I found ##  Sometimes MOUSE touch pad does not work properly.  Otherwise everything  is okay. ####   Poor battery life . Maximum 2hrs with the battery saver on . DON'T BUY!! ####   Some keys are not functioning correctly...when you press @ ##  it prints \". Lot of problems in writing email addresses ####   This laptop is way ahead of its time! ####   That is a amazing product from Amazon ####   Amazon delivery was fast ##  but this tym packaging was not good ##  it should be rapped with bubble rapper. ####   Well built laptop.  Very fast working. Good experience til now.  Satisfied with purchase ####   Really a light and thin laptop. ####   Wonderfull product ##  very light weight ##  easy to handle and gives u a steady and metallic feel ####   Have been using for a week. Easy to install. Satisfied. ####   Battery life is very good ##  touch pad is very responsive ##  keyboard has 2 settings for backlit lighting. Ports are a little tough in the beginning. Great buy 👌"},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 3 2021 Intel Core i3 11th Gen 14 inches FHD ##  LED IPS T&L Business ##  Laptop (8GB/256GB SSD/Windows 10/MS Office/Backlit/Fingerprint Reader/Arctic Grey/1.41kg) 82H700J8IN\n\n\n\n\n\n\n", "mrp": " ₹57 ## 290.00", "save": "\n\n\n\n₹15 ## 300.00 (27%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: 11th Gen Intel Core i3-1115G4 | Speed: 3.0 GHz (Base) - 4.1 GHz (Max) | 2 Cores | 6MB Cache # Operating System: Pre-Loaded Windows 10 Home with Lifetime Validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM DDR4 ##  Upgradable up to 12GB | 256 GB SSD # Display: 14\" FHD (1920x1080) | Brightness : 300nits | IPS Technology | 45% NTSC | Anti-Glare # Design: 4 side narrow bezel | 1.99 cm Thin and 1.41 kg Light | Fingerprint Reader | Backlit Keyboard##", "no_of_rating": "200 ratings", "avg_rating": "4.3", "total_no_answer": "\n105 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "IdeaPad 3", "Brand": "Lenovo", "SpecificUses": "Personal, Business", "ScreenSize": "14 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 46 mins\n", "emi": true, "exchange": true, "five_star": "58%", "four_star": "29%", "three_star": "5%", "two_star": "1%", "one_star": "7%", "reviews": " ####   For this price very nice laptop ####   Great user experience. Very fast. ####   Very good product with more features than others ####   Purchased combo as suggested by Amazon ##  by ADP warranty not got applied. ####   It's a power packed product windows 10 home ##  office 2019 ##  8gb ram ##  11th gen i3 ##  256gb ssd ##  aesthetics look ##  finger print recognition ##  steel body ##  camera shutter @43990/- value for money ####   I got a new piece . Mainly for my daughters classes the sound system is very low ####    Lenovo did a great job infittjng everything in 14 inch form factor for this laptop with a great screen. The laptop is very light to carry Around and is perfect for a student who want to do some office tasks and watch movies and listen to music. ####   The laptop sent to me was faulty and malfunctioning. I reported this ti Amazin immidiately. Neither the laptop is replaced or refund is processed. No pickup agent has come till date. Plz dont buy this laptop. Its a faulty model ####   For me total Storage space showing only 475GB but in spec it is mentioned 512GB is it normal or any problem please anyone reply me ####   Wonderful ####   Great laptop.. ####   Its value for money ####   This laptop is good for personal use like emails ##  watching movies ##  browsing. Also its light and has better battery backup. It has nvme ssd which makes storing and retrieving data blazing fast ####    Its a great product. I loved it ####   Its been only 3 days that that I have received this laptop and it started shutting down automatically. Its really heartbreaking to your hard earned money is ruined by this worthless improperly tested products. Just stay away from this laptop and save your money. ####   It is light weight ##  very fast  and starts within 5 seconds. ####   I ordered Lenovo IdeaPad Slim 3 2021 laptop (82H700J8IN) for my kid to attend online ##  received laptop as per Amazon delivery in July 2021. ####   Performance ##  looks ##  camera ##  and specifications are very good. ####   A lil expensive@43k ...but does the job perfectly. ####   Light weight and portable ##  the laptop is very easy to use and quite responsive. I have used it for various applications (excel ##  ppt ##  Google meet ##  Facebook etc) and found no issues. Haven’t tried it for performance intensive activities like gaming etc ####   Overall the machine is really good. ####   Recording / micro phone issue less than a month . Contacted Amazon for replacement  ##  but I was informed to contact Lenevo for service / warranty. Disappointed with this issues ####   Writing this review nearly after 20 days of use.Overall the laptop is good.Delivery was on time.No lag while using as 8gb ram ##  i3 processor and 256gb ssd does it's job quite well.Mainly i use it for Documents(not to forget MS office is included) and Browsing and battery backup is around 7-8 hrs and it does charge fast. Sound quality is average and screen brightness is kind of okay so not to expect more.It would have been better if there was an ethernet port. ####   Basic MS office work (Excel ##  powerpoint)  ##  checking emails ##  browsing ##  SSD makes it boot much faster..overall great value for money ####   Best product in this value range. The screen size may be little small for people used to working in 15 inch laptops but over time one gets adjusted to 14 inch screen. It's super light and easy to carry around. ####   go for it...so many good features ####    Hey Team ##  ####   I liked it as solved the purpose of my uses. ####   The product warranty already started one month before ##  now only showing 23 months ##  I should get full 24 months warranty. ####   Overall a satisfactory product  ##  crisp look  ##  built quality is good  ##  battery is max 3hrs  ## . Choose it after searching a lot of options but satisfied till now though it's been only 5 days.. ####   Awesome product for basic use in this price. ####   Timely delivered by Amazon ##  well packed ##  ####   Excellent product! Worth the money! Guys go for it without any hesitations ####   Definitely worth the money... Sleek and compact. ####   Pros: everything working as expected and listed.. sufficient for WFH  ##  wifi reconnection is fast ##  not generating heat ####   Good ####   Overall a good laptop..Quickly its prons and cons ####    Great laptop for this price range. ####   This is a good laptop if you are not a heavy user. Light weight ##  good configuration ##  decent build and nice looks. Recommended for folks looking for a sleek laptop focused on good performance for light use at home ####    Nice product+very slim & light weight. ####   Enriched with all latest features. ####   This is one amazing product ##  viewers if you are planning on purchasing this one ##  do it and you won't regret it ❤ ####   Firstly it is a very light weight laptop … It has backlit keyboard   ##  it is very fast as it is SSD and the color is dark grey . It looks beautiful . Downloading of apps is easy and very fast . There is finger print reader as well which gives more privacy & security . ####   Its good ####   It was so fast that I had called technician stating that my laptop is not shutting down completely. ####   Neat design ##  fast performance  ##  superfast fingerprint reader and backlit keyboard ##  superfast charging. ####   You are getting more rather than what are you paying. ####   Laptop is good in this price range. Volume level is too low and battery backup is not more than 4-5 hours in normal use. ####   If you want to buy it then carry on. This is the best budget laptop with with best performance . ####   Good Laptop ##  fast ##  reliable ##  Thanks Amazon ####   Very light weight ##  felt display colours bit dull..heating issue were found on long usage.. ####   Screen quality is not good. ####   Order execution ####   Purchased this laptop for personal use. Following are activities performed. ####   Received my laptop along with adaptor today in very good condition ##  it is a 1 day delivery. ####   it is very good laptop for day to day usage. Screen quality is good for this price ## sound quality is very good.. overall performance is very good ##  feel premium in hands. ####   It is a perfect laptop. Works well. No defects found. ####   Light weight and slim with rich look ##  ####   Network keep on disconnecting whereas on other device its 100% stable without any disconnections. ####   An excellent machine for the price for business usecases like MS Office and web browsing. Intel CPU does work well and at cooler temperatures than the Ryzen 3 processors that come at a similar price. Go for it if you're not looking for very CPU and GPU intensive workflows like hardcore gaming and video editing as it has only integrated GPU. The system is extremely lightweight and blazing fast due to the ample 8gb RAM and 512 gb SSD. This is a 1 week usage review. Will post updates if I notice anything else."},{"name": "\n\n\n\n\n\n\n\nMi Notebook Pro QHD+ IPS Anti Glare Display Intel Core i7-11370H 11th Gen 14-inch(35.56 cms) Thin and Light Laptop (16GB/512GB SSD/Iris Xe Graphics/Win 10/Backlit KB/Fingerprint Sensor/1.4 Kg)\n\n\n\n\n\n\n", "mrp": " ₹87 ## 999.00", "save": "\n\n\n\n₹15 ## 009.00 (17%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 11th Gen Intel Tiger Lake Core i7-11370H processor| Speed: 3.3 GHz(base) - 4.8 GHz(max) | 4 cores | 8 Threads | 12 MB Cache # Display: 14 inch IPS QHD+ resolution (2560x1600) |16:10 aspect ratio ##  100% sRGB ## 215 PPI ##  1000:1 contrast ratio | Anti Glare | TUV low Blue light # Memory & Storage: 16GB DDR4 3200 MHz | 512GB PCIe NVMe M.2 SSD # Operating System & Software: Windows 10 Home | Microsoft Office Home and Student 2019 # Graphics: Intel Iris Xe graphics##", "no_of_rating": "139 ratings", "avg_rating": "4.3", "total_no_answer": "\n101 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "Mi Notebook Pro", "Brand": "MI", "SpecificUses": "Personal", "ScreenSize": "14 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            10 hrs and 15 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   This amazing laptop ##  no doubt about it...very good display web cam is also good ##  i purchase Pro 16 gb and ultra 16gb....only one 10 days difference.but the Pro version some problems is there . screen blinking and suddenly shutdown and restart.i talked technical support. He says please return the laptop and we we refund your money. But ultra very good. I think Pro version is also good. But some technical issues.... The return policy time is over.. but Amazon service is simply superb... because my money credited immediately. ####   Copy in the design from MacBook Pro is with genuine intention to give the best experience… ####   Nice and attractive laptop ####   Likes ####   Dis likes: keyboard backlit from f8 key to macro are little bumped weirdly and hinge is good but the Black round matte they used is not straight... It's like a Little wave Matt in between screen and keybord. Battery is giving 5hrs. Speakers are very minimal ####   I purchased it on the first sale. I have kept it on changing now and it is giving me heavy electric shocks. ####   This is good all rounder laptop ##  but sound volume is really a concern. You can't enjoy movies or youtube videos with this sound. ####   Awesome built quality. Top Notch Display. ####   Its Overall killed the market. Seriously build quality ##  display ##   processor ##  battery life ##  iris xe gpu ##  fingerprint ##  free upgrade to windows 11 & the price..😍😍😍 ####   I am writing this review after 1 week of use ####   I just loved this product ####   The laptop is good. Display is fantastic when compared to Lenovo. My only issue was the outer package was fully opened. ####   ... if you are looking for a non-touch screen ##  non-heavy-gaming ##  Intel cpu ##  compact laptop. If fine with AMD cpu ##  there can be alternative ##  but otherwise ##  really no. So far ##  behaved all exactly a Windows Laptop should do ##  no complaints. Build quality is better than my third office laptops of twice the price. Only missing thing (other than no touch screen) is IR camera ##  so face unlock does not work. Rest all ##  including properly smoothen metal edges ##  proper rubber grip at the bottm ##  proper quality USB C charger and cable ##  bright vibrant screen with proper high resolution ##  all 4 sides thin bazels ##  one time office 2019 license (not that 365 which will make you pay every year) all good and as expected. ####   Nice build quality ####   I like the design ####   The hit  : ####   Awesome Built quality and Faster ####   I'm using i7 16GB variant. I love the display ##  keyboard. I can turn on and login into windows within 10s. I bought this only for coding so I haven't played any games. Not yet. ####   When ever I see any video screen is becoming black for a second or 2 seconds.. its happening frequently ####   Very nice laptop easy for programming ####   I bought this laptop on 31st AUG. Received before promised time from Amazon. I used the machine for few days  ##  everything looks good. Suddenly last week i found that one of key ( bracket character next to P) is not working. I called Amazon ##  they said you should contact MI since 10 days period is over (WOW...). I called MI Support they asked me to raise Token. I raised ticket and after that I am just following up from 5-6 days. They keeps saying ##  part is not available. I requested them to replace since it is just 15 days  ##  but not response. Still I am waiting for their response. MI should think to upgrade their service they made good machine but it is useless if you cann't support even for manufacturing defects. AMAZON ##  I have been using your platform from last 5-6 years. I use buy almost everything that i need from Amazon but this time I am upset ##  Why do you tieup with such companies who doesn't have proper Support System for such high value items. You should re-think for 10 days replacement policy for High Value Items on your platform otherwise you will loose trust of your customers. ####   Product build is sturdy and mesmerizing ####   it's backlight keyboard ##  high resolution display and larger TouchPad makes my productivity easier. ####   Super slim and very compartable ####   Touchpad not working ##  just after return period is over. I am using Mouse ####   I'm not going to give you the specs or list down pros and cons. It's obvious now. ####    It's just too attractive ##  the build quality ##  display ##  battery ##  keyboard ##  touchpad all are soo good ##  the feel of full metal body and sturdyness is just too good. If your budget is around 60k then don't think just go for it... Too much value for the money you are going to spend.. 🔥🔥🔥 ####   This will bring rapid change in the laptop market as this is value buy ####   It is a beautiful laptop. Very lightweight. Though the charger has a brick ##  it is very small and doesn't add much weight. The battery backup is of about 7-8 hours ##  not 11 hours as it is mentioned. However ##  it is decent. ####    DONT BUY!!! DONT BUY!!! No extended warranty offered by the manufacturer if you purchase from Amazon. MI AND AMAZON both fight and mi doesn't want you to purchase from Amazon so they won't help you with any support like warranty ####   Battery life is ok  and sound quality is very poor they have a look on sound quality for better cinematic experience.. ####   Every thing is good except it's weight distribution ####   Just got this laptop today ##  so based on just a few hours of usage. ####   The laptop is good but beware that MI will not support Brand Extended Warranty. ####   This is a good laptop in terms of performance and build quality. Xiaomi has cut corners in the following areas- ####   Tough and beautiful. A well balanced laptop by Xiaomi. Bought 8gb version as it was sufficient for browsing and studying. Go for 16gb only if you are a coder or creator. Screen ##  battery life ##  keyboard are all great. ####   Amazon not returning the product inwant a refund for tha same ####   1. Hi friends it's genuine review I am using the laptop past 2 day except battery life all are good especially display and performance extraordinary ##  as per the mi guide lines battery life given as 11 hr but I noticed it's 6 hr only. ####    All update will modify as i keep using.. but display is best as I was bit skeptical about earlier... But it won't disappoint you ... ####   I am not going to write those specs again. ####   😊😊everything is great.. ####   Notebook pro 16gb ram is just lit ##  can be called as a Windows macbook. ####   5/5 Build quality ####   Only one cons sounds is too low ####   Build quality of the laptop is excellent although instead of buying a 16gb ram varient  ##  after installing few 3d designing softwares programs sometimes got stuck a little or do not respond. ####    Writing this review after a week of usage . I'll add here pros and cons . So you can decide the verdict. ####   This is My 4 Days Review About This Product ####   Am not going to write about pros and cons. It's my experience with this order. ####   I got this laptop on 7th sep  ## This is my first ever laptop ####   Pros ####   An excellent laptop for 60k. The only complaint I have is about the charger ##  would've been really better if they had given a compact charger like realme did. This mi charger is bulky.i have a 65w adapter and it is not supported for charging on this laptop. Apart from this everything is good. One star less for the bulky charger. ####   from every aspect (build quality ##  compact  ## boot speed ##  looking wise ##  backlit KB) laptop is good except sound quality. ####   Overall laptop is good but there is heat up problem ####   Great laptop under this price range display is top notch thermals are great battery is good so slim and build quality is another level macbook at lower price.totally glad for purchasing it. ####   Overall it's a good laptop. The charging adapter could have been improved ##  the deisgn is still old and bulky to today's standard. ####   All the pros just one cons 'the speaker'. ####   Very nice machine ##  at good price ##  built is top notch ##  performance is perfect for price and compact form. ####   CONS: ####   Great laptop ##  great battery ##  display and processor all are performing awesome. 16 gb ram is more than enough ##  just go for it. Value for money. ####   I won't tell all good things which YouTube channels are promoting. Good part is overall laptop is good. I will rate 3.5 star out of 5. ####   Today I got my product delivered and I m very happy to use it it has very good battery backup ##  premium look only thing missing was a good quality speaker ####   With this price nice 14 inch laptop with 16 GM Ram 🙏 ####   The piece is defective. I have been waiting for my laptop for so long and this is what I got. ####   Hi Guys ##  From the user experience ##  It has excellent build quality ##  Light weight ##  Finger print sensor is very quick ##  Backlit keyboard is awesome ##  Extremely superb. I brought i5 16gb variant for programming. Its a perfect windows macbook edition. ####   Nice 👍👍👍👍👍 ####   Pros - lovely display ##  fast fingerprint reader ##  Ms ####   Happy with the product!! ####   Mi notebook pro i5 8GB got for Rs 54000 with HDFC offer. ####   I am fully satisfied with the purchase. Feeling like really a pro while using the lap. Best choice in this price go with the 16gb ram. ####    This is the best laptop one can buy in this price range ####   Ratings - ***** ####   No Cons ##  A good device for productivity"},{"name": "\n\n\n\n\n\n\n\n(Renewed) HP Elitebook Laptop 640G2 Intel Core i5 - 6200u Processor ##  8 GB Ram & 256 GB ssd ##  Win10 ##  14.1 inches ##  Optical Drive Notebook Computer\n\n\n\n\n\n\n", "mrp": " ₹89 ## 990.00", "save": "\n\n\n\n₹58 ## 000.00 (64%)\n\n\n\n\n\n\n\n", "price": "₹31 ## 990.00", "about": "#Operating System: Windows 10 Pro # Processor type: Core i5 - 6200u # Size: 14.1 inches##", "no_of_rating": null, "avg_rating": "3.9", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "HP", "Brand": "14 Inches", "SpecificUses": "Windows 10 Pro", "ScreenSize": "Intel", "OS": "Grey", "more_detail": "", "order_within": null, "emi": true, "exchange": false, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nAcer Aspire 5 AMD Ryzen 5 5500U Processor 15.6 inches Business Laptop - (8 GB/512 GB SSD/Windows 10 Home/Radeon Graphics /Microsoft Office 2019/1.76 kg/Silver) A515-45\n\n\n\n\n\n\n", "mrp": " ₹64 ## 990.00", "save": "\n\n\n\n₹6 ## 550.00 (10%)\n\n\n\n\n\n\n\n", "price": "₹58 ## 440.00", "about": "#This laptop packs a punch in terms of performance as it comes with an AMD Ryzen 5500U processor . It not only gives you enough power to seamlessly tackle your work-related tasks but also keeps you entertained as you can play games ##  watch movies ##  and do more. # 15.6\" Full HD (1920 x 1080) IPS Widescreen LED-backlit Display | AMD Radeon Graphics # 8 GB of onboard DDR4 system memory ##  upgradable up to 24 GB of DDR4 system memory # 512GB NVMe SSD  ##  also supports up to 2 TB 2.5-inch 5400 RPM # Includes Microsoft Office 2019##", "no_of_rating": "79 ratings", "avg_rating": "4.5", "total_no_answer": "\n104 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 20\n", "Model": "A515-45", "Brand": "Acer", "SpecificUses": "Creative, Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   The numbers mentioned in the website doesn't work. Chat facility is a waste of time. It's terrible support. 8GB RAM is a joke and I was expecting that I will be able to upgrade it. Looks like it will be difficult to do it via acer services. So ##  bought a RAM with exact specifications online and installed it myself. Warranty will be difficult for sure. ####    Product is awesome ##  light weight and looks very good specially in reallife ####   Very slim lapy and the processor is awesome....... Just go for it ####   Not Good Product of Acer Aspire 5 AMD Ryzen 5 5500U Processor ####   Excellent battery life ##  can easily last upto 10hrs. ####   Great product ## fully satisfied ####   Merits ####   Recently i bought perfomance good 🌹🌹🌹 ####   Great laptop with very high quality screen ## the battery life is around 7 hrs and the trackpad is just excellent ####   Can't return now. Bad product ####   I am sharing this review after purchasing laptop from local shop where I get best deal.. here are some genuine reason why you with pros and cons.. ##  ####   Good Battery life ##  snappy performance (any time I had minimum 15 chrome tabs open along with 3-4 other apps. No lag. ####   Everything is awesome good for students and little gaming and it has and issue i face when i was updated the update  ## The battery percentage from 100% it went to 25% in half an hour and the speakers are shit better get a pair of earphone ####   I love all over design of laptop thin and lightweight and performance of this laptop is unbelievable its full fill my all requirements but price range higher because when we see on acer official website price are low and always show out of stock over all acer doing very well in term of body we got aluminum top and backlit keyboard ####   We had purchased for our son and he just loved using the laptop for everyday use ##  Coding ##  watching videos ##  attending webinars and attending his classes online. The battery backup is amazing and the Laptop overall is just awesome. No issues as of now connecting to Wifi 2.5 ghz/ 5 ghz band. Since we have Airtel broadband the Wifi autoconnects to highest 5 ghz band and is super fast. Laptop opens up super fast and depends on if we have configured any login password or personalised photos/background during Laptop login page ##  based on which little difference may be seen but overall great processor for faster access to anything to be done with this laptop. Not has an opportunity to contact ACER for any issue as Laptop is working great. Thank You. ####   Very sleek...light weight...very fast... ####   Used it for a week and.... ####   Product as mentioned ####   I was eyeing for this laptop since its announcement. ####   Speaker and camera ####   I found this Laptop on ACER and Croma site at night for 53K and 52K. Being sleepy ##  I left it and next morning it was out of stock on both. Then I bought it on Amazon for 56K less 1K discount for HDFC card. ####   Everything's great in this machine. ####   Amazing display ##  good battery backup ####   The 5500U is ##  to slightly put it ##  ABSOLUTELY BONKERS ##  Gives even the Current Generation i7s ##  (dare I say i9s) a run for their money. Compiles the entire Linux kernel in under a minute (If you don't know what that means ##  let me tell you its Performance is Beyond Comprehension) ####   Excellent battery life ##  decent screen with IPS so good viewing angles ##  Lightweight aluminium top body ##  boots up and shuts down in seconds because of 8GB RAM and 512 GB SSD. AMD Radeon Graphics does the job well ##  can play light games. Soft and brisk touchpad. Overall a good package in the price. ####   Good ####   It's a complete waste of money product. Sound Volume and Quality is worst. Build quality is very basic. ####   Good laptop ##  6 core 12 thread's cpu with 8gb soldered ram ##  can be expanded upto 24gb  ##  slot for 2.5 inch hard disk / sata 2.5 inch ssd is given which can be installed upto 2tb ##  mounts are provided for that ##  1080p ips screen and backlit full side keyboard provided though backlit keyboard brightness can't be controlled ##  available for a lesser price ##  check acer online store or offline store. ####   just you look this laptop every things has been provide most important is that acer service centre. Today I have visited with my laptop to install external HDD. what a service just took 5 minutes. Manager Jogesh has tolled me due pandemic I am ready to send my technical staff in my resident. What more you want. Another best quality service of Amazon they have give me this ACER ASPIRE AMD RYZEN 5-5500U laptop within 04 days. Amazon hats off You. Its looks too Good and best keyboard minor sound supposed to be high. Otherwise every parts & function are too excellent. ACER Wishing you all the best . I was purchased first  laptop on  2007 it was Acer next two are HP now again I purchased ACER. ####   Good value for money. There’s only one s drawback - the speakers are not loud enough. ####    Value for money. ####   Good product 👍 but remember graphic card is only of 512 mb here so choose wisely with others ####   Best laptop ####   Ryzen 5 5500U is the best chipset you can find in the mid-range laptops which even gives a run for the money to Core i7 processors that being said major cons I found were - ####   Good laptop overall"},{"name": "\n\n\n\n\n\n\n\nASUS TUF Dash F15 (2021) ##  15.6-inch (39.62 cms) FHD 144Hz ##  Intel Core i5-11300H 11th Gen ##  RTX 3050 4GB Graphics Gaming Laptop (8GB RAM/512GB SSD/Windows 10/Gray/2 kg) ##  FX516PC-HN058T\n\n\n\n\n\n\n", "mrp": " ₹1 ## 05 ## 990.00", "save": "\n\n\n\n₹36 ## 000.00 (34%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: 11th Gen Intel Core i5-11300H ##  4 cores ##  8 Threads ##  8MB Cache ##  3.1 GHz Base Speed ##  Up to 4.4GHz Turbo Boost Speed # Access to over 100 high-quality PC games on Windows 10 # One-month subscription to Xbox Game Pass that’s included with the purchase of your device # Memory & Storage: 8GB onboard DDR4-3200MHz RAM ##  Upgradeable Up to 24GB Using 1x SO-DIMM | Storage: 512GB SSD M.2 NVMe PCIe 3.0 with Additional M.2 Slot for Storage Expansion # Graphics: Dedicated NVIDIA GeForce RTX 3050 GDDR6 4GB VRAM ##  With ROG Boost up to 1600MHz at 60W + 15W with Dynamic Boost # Display: 15.6-inch ##  FHD (1920 x 1080) 16:9 ##  IPS-level ##  Refresh Rate: 144Hz ##  IPS-Level Anti-Glare display ##  sRGB: 62.5% ##  Adobe: 47.34% ##  with Adaptive-Sync##", "no_of_rating": "20 ratings", "avg_rating": "4.0", "total_no_answer": "\n17 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "TUF Dash F15 (2021)", "Brand": "ASUS", "SpecificUses": "Multimedia, Gaming, Business", "ScreenSize": "39.62 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 45 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   Please note that the TGP given is just 60W ##  which will not give the RTX power you want. Do a bit more research ####   Atleast should have given MS office package or Laptop bag or any accessories. ####    As it’s name says it is tough laptop which has solid body structure. I am new to gaming laptop so it is too early to comment on gaming performance. Laptop turns on within 4 seconds. Screen quality is decent ####   Battery life is normal  ## it doesn't have camera ####   It's been only 3 days ##  so it is hard to say much. The battery seems to be fine ##  and the speaker sound is okay.  Inside has a matt finish ##  and like the feel of it and the outside is metallic finish. Keys are at an optimal distance and has a good key travel distance. The rear end has air cooling vents ##  which does the purpose ##  but it looks cheap. The IPS screen is okay and has a normal hinge. This laptop comes with a 180W adapter ##  unlike what has been mentioned on the website. Also ##  my laptop's \"Windows Key\" is not working; maybe it's an issue with the driver or software. ####   Great buy. Latest and the best."},{"name": "\n\n\n\n\n\n\n\nHP Pavilion 11th Gen Intel Core i5 Processor 14 inches FHD Laptop with Alexa Built-in (16GB/512GB SSD/Windows 10/MS Office/2GB NVIDIA MX450 Graphics/Natural Silver/1.41 Kg) ##  14-dv0084TX\n\n\n\n\n\n\n", "mrp": " ₹78 ## 293.00", "save": "\n\n\n\n₹6 ## 803.00 (9%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Timing varies by device. Certain features require specific hardware. # Processor: 11th Gen Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology ##  8 MB L3 cache ##  4 cores) # Memory: 16 GB DDR4-3200 SDRAM (1 x 16 GB) | Storage: 512 GB PCIe NVMe M.2 SSD # Display: 14-Inch FHD IPS anti-glare micro-edge WLED-backlit ##  250 nits ##  45% NTSC (1920 x 1080) # Graphics: NVIDIA GeForce MX450 (2 GB GDDR5 dedicated) # Operating System & Preinstalled Software:Pre-loaded Windows 10 Home with lifetime validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Microsoft Office Home & Student 2019##", "no_of_rating": "488 ratings", "avg_rating": "4.3", "total_no_answer": "\n274 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "Pavilion Laptop 14-dv0084TX", "Brand": "HP", "SpecificUses": "Multimedia", "ScreenSize": "14", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 45 mins\n", "emi": true, "exchange": true, "five_star": "66%", "four_star": "18%", "three_star": "6%", "two_star": "1%", "one_star": "9%", "reviews": " ####   Bought it on 14 Aug'21 ##  the display stopped working on 15th September'21. Logged a case with HP support and followed up more than twenty times at each point of contact and till date haven't received the quotation as they say it's physical damage and not covered under warranty. Whereas when I raised the issue there were no signs of physical damage. ####   Its ultra fast and its light weight. As a developer ##  I think I got what I need. ####   1 tb ssd + i7 + 16gb ram + backlit keyboard + fingerprint sensor ####   HD screen is super cool. Haven't seen any cons as of now ####    Laptop is good ##  quality product ##  just stopped working after 4 days when I needed this laptop the most. ####   Probably the worst ever laptop from hp. It's my humble request to kindly do not purchase this laptop. It started malfunctioning within a month of purchase plus Amazon isn't really helpful in dealing with such issues. ####   I replaced my 7 years old HP 15 A series laptop with i5 and 12 GB (extended RAM) + AMD Graphics card + Dual OS with this one. ####   The brand new laptop was not of the quality . The usb port is defective ####   Very good performance… ####   Liked the configurations ##   not the laptop  ##  looks good but still has a long way to go to even beat macbook air. ####   My friend baught it in 84K ##  i7 . There is 20k difference. Plus you will get a premium quality mouse and a bag. ####   Laptop USB slot damaged. I could not insert flash drive into it. ####   Nice product & and everything is perfect 🥰 ####   It's a good laptop within the price range. ####   Nice laptop for productivity ####   Processer speed given 2.8ghz but as per product it should come up with 4.5ghz. while doing multitask some times getting stuck . ####   It's gud ####   If you are student have a lot of excel modelling to do ##  multi-task to do GO FOR IT. ####   All the great features and performance of this laptop become useless with very frequent abrupt shutting down problem. I have invested quite a few hours researching online solutinand chatting with executives on HP ##  the problem remains rendering it a useless machine since I can’t face shutdown4-5 times a day during important Zoom meetings ####   The product has good specifications. Although the price appeared a bit high (85k) ##  the features are worth going for. Superfast usage because of processor and RAM. Camera quality is not great. In addition ##  the screen cannot be tilted/folded much. ####   ******* Don't buy this product ******** ####   No heating issues ##  good battery life ##  and smooth performance. Have been using it for almost a month now. ####   Value for money ####   its nice look and super . ####   Processor range is not matching as mentioned in Amazon ####   Laptop with great config and looks. Only think I felt HP should have given with this is Laptop Bag along with the laptop. ####   Awesome ####   An amazing product except that it has an overheating problem and shuts down automatically. Other than that it is great! ####   RED LINE across the screen. Never buy HP - what was more disappointing was that Amazon didn't help in this regard ####    Opened the package late as I was busy and didn’t think a brand like hp would have defects…BOY WAS I WRONG!! straight out of the box the keyboard has an issue. How do I return this now? ####   It's not even a month I bought this new laptop & am facing laptop shutdown issues frequently & on restart it don't save session before shutdown & I loose all work....on Googling I find reason to be related to internal power supply issue(I don't have power outage @ home but it's has to do with internal power supply) very disappointed to see such pathetic product after paying so high amount. ####   Very thin ##  very light ##  starts quickly ##  smooth keypad ##  laptop works fast. Since now its new  ##  so not facing any heating issue for now. Only limitation is the non-availability of number keypad (since its a 13.5 inch laptop). Those who are habituated of using number keypad may find it uncomfortable a bit for sometime. But to ease that ##  one may buy external keyboard. Rest everything is awesome. ####   This happened on the third day after I bought it back ##  and the machine crashed. ####   One of the best laptops available . ####   Must buy ####   Easy to handle. Wonderful display. Boots up in 10 secs. Best for daily routine ##  OTT viewing and multitasking/working. Gamers can skip this. ####   Good quality product ####   I bought this laptop during the sale just before Indepedence day sale. I have basic perspectives. My old Asus I3 was over 4 years old and was becoming slow. Coming from IT background ##  I wanted to purchase a laptop with good RAM ##  that will help me in my academics and I wanted the laptop to be moderately lighweight having provision for basic gaming. After extensive research through Amazon ##  finally I narrowed down to this laptop becuase it also had dedicated MX450 graphics on top of Intel Iris Xe dedicated graphics. ####   Overall the laptop is reliable and comfortable and light weight. ####   Everything's upto the mark especially the battery backup (Quick charging and easily runs for 6-7 hours for heavy development works and watching movies on single charge). ####   The product arrived on time with a neat packing. Laptop look and feel are too great. I felt it is too smaller ##  may be because I was using a bigger one earlier. It is too early to tell about performance ##  but it is found to be faster. high responsiveness. Battery is draining too fast which makes me worried. I have to use and wait for more detailed review. ####   Quite light. ####   Superb at this prize.. ####   Bought this laptop after some research and comparisons. Performance is good ##  no issues at all. It is Light weight ##  easy to carry. ####   It's compact and packed. ####   From day 1 I m updating it  ##  and it's not working ####   Superfast speed ##  great looks and very light weight. Really like it. ####   I've been using the product for 3 days now. It's fast and good. ####   The laptop takes time to start. Unfortunately the exchange window closed within a week ####   Bought this laptop yesterday ##  i noticed that my display is blurry ##  anyone else noticed this? And if you managed to overcome this ##  can you please tell me how? ####   Laptop started hanging within 1 week of usage. Had to call for a techincian to help on the same ####   This project hp loptop is good then I Mac worthless but hp is good  then imac booooooooooo. Wak you imc booooo ####   I am software engineer mainly working on Citrix. Using this laptop for work. No problem with screen resolution ##  after working for 8 hours on average mode battery drops to 20% . No heating issues so far ##  amazing speakers ##  it's super fast laptop. Only camera is of low quality ##  but zoom meeting seems to give bearable experience. ####   very poor battery ##  discharges very quickly ####   Horrible Service. Makes huge Fan noise. Gets heat up at an alarming rate. Gets slow as well. ####   This laptops heats a lot from day 1 ##  settings & BIOS updates etc ##  wont work ##  fan makes noise and throws air continuously ... i replaced the laptop but in the replaced laptop also same issues even in bigger form...lot of ####   Just wished if C drive was bifurcated into 2 drives  - C and D ####   EXCELLENT ####   Fast Reboot ##  Lightweight ## Speed also very good. ####   Awesome laptop with stunning features and the assembly! 16gb with 1TB SSD rocks! ####   Excellent quality and very light weight product.alsosupporting heavy weight games .thanks to the nvidia graphics card ####   Only I got one of deffect in this laptop power button beside of delete button ##  it should be the seperate of this delete button  ## over all good ####   Laptop is really good but it is not a 4 Ghz processor it is just 2.0 GHz processor ####   The display of colours ##  clarity of images and videos was far below expected for this premium laptop if it was a manufacturing problem for the specific laptop delivered to me. USB port for Bluetooth connectivity was faulty and could not connect to the mouse bluetooth adaptor ####   1.Very fast ####   Very best product 16 gb/1 tb HP PAVILLION latest generation grey colour no fake product 101% real product.... (!!!BUT NO TOUCH SCREEN!!!) ####    Very light ##  fast and handy ##  superlook. Thanks for delivering very fast. Amazon thumbsup to you. Buy it without any second thought. ####   Windows 10 sucks like hell. Its not able to install rise of nations ##  although we through whatever amount of money at it. ####   Do go by the looks of the laptop.  Only 2 USB port and another 1 type 3 port and it seems not compatible with my current docking station. ####   It has serious overheating issues ##  when delivered first I thought may be issue with piece but when Amazon replaced with other same issue observed.. Requested for return and refund ##  will buy better laptop. ####   Battery life too less ##  ####   Intel Core i7 + 1TB SSD ####   It's able to handle extreme load of applications. ####   The laptop is not starting after a month and the service quality is very bad. I lost 85k for nothing. Amazon has very bad after sales service and I will suggest everyone to purchase from retail stores where at least they will cooperate with you ####   Cool ####   1. Its light in weight easy to carry & due to core i7 processing is fast. ####   The power adapter with hp pevilion is not working. I just used for three day and laptop is not getting charged. Don't buy this laptop. Worst product from hp. I want to replace this item. ####   Overheating problem ##  returned the product. ####   The product is working very good ####    Laptop working fine but heating a bit while using softwares like AutoCAD ##  Camtasia etc. Didn't expect this heating in i7 16GB RAM Laptop. ####   great product. only needs a couple of extra usb ports. ####   This laptop is best suitable for people with Colour blindness. All red coloured objects are displayed as orange colour. You will get no support from HP customer care other than their trial and error method & hear this as new problem ####   Speed is vey fast love this laptop alexa with this laptop is vey cool 16 gb ddr4 ram amazing and a big screen ####   Nice produced ####   Laptop generates lot of heat. ####   Did not like anything about this laptop....price ##  keyboard layout ##  hp support ##  customer is a joker.... customers are just there to generate revenue for these manufacturers... ####   I have been using this laptop for about 2 weeks now and can only say good things about it. I don't have to speak about configuration ##  that you all know is quite good. What additionally I can use is though it is not light or slim ##  but it is sleek and does not heat up while using ##  unlike other light and thin models. ####   This is an awesome product from HP. ####   Without a doubt ##  this one is a performance beast. A very well balanced laptop. Perfect for work ##  coding ##  studying and can handle some casual FPS gaming quite well. Can also handle old heavy duty AAA games but not the new ones. Very light in weight ##  very sleek ##  compact. Natural Silver is a beautiful colour so for those of of you who are at first glance not liking this because its not in black (I was in the same predicament) ##  do not worry ##  this colour is beautiful. Very good battery life as well. Voice recog and Alexa I haven't tried yet but soon I will. The inbuilt speakers for this are amazing. Bang & Olufsen have lived up to their brand. It has a boot time of about 10 seconds because of this absolute beast of a RAM and Processor. ####   I think this is the most advance notebook one can get  ## "},{"name": "\n\n\n\n\n\n\n\nLenovo Legion 5 Pro AMD Ryzen 7 5800H 16\"(40.64cm) QHD IPS 500Nits Gaming Laptop(16GB/1TB SSD/Win10/Office/RTX 3060 6GB ## max TGP 130W/165Hz/3 Yr Warranty/Grey/2.45Kg) ##  82JQ0062IN +Xbox Game Pass for PC\n\n\n\n\n\n\n", "mrp": null, "save": null, "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: 5th Gen AMD Ryzen 7 - 5800H | Speed: 3.2 GHz (Base) - 4.4 GHz (Max) | 8 Cores | 16 Threads | 16MB Cache # Display: 16\" QHD (2560x1600) Dolby Vision | Wide Quad with 16:10 Aspect Ratio| IPS Technology | 165 Hz Refresh Rate | 500Nits Brightness | 100% sRGB | VESA DisplayHDR 400 Certified | X-Rite Pantone factory colour calibration # Graphics: NVIDIA GeForce RTX 3060 6GB GDDR6 Dedicated Graphics with max TGP 130W | Boost Clock 1425/1702MHz | Free-Sync and G-Sync # Memory and Storage: 16GB RAM DDR4-3200 ##  Upgradable up to 32GB | 1TB SSD ##  Upgradable upto 2TB SSD # AI Engine : Upto 15% more FPS and Best performance with Auto Detect Mode (Top 16 AAA Titles) and Auto Optimisation Mode | Q Control 4.0 to select between Quiet (Blue) ##  Intelligent (White) and Performance (Red) Modes # Cooling: Legion Coldfront 3.0 with Quad Channel Exhaust System with Copper Fins##", "no_of_rating": "72 ratings", "avg_rating": "4.3", "total_no_answer": "\n47 answered questions\n", "delivery_type": null, "delivery_date": "Sign in/Create a free business account ", "Model": "Legion 5 Pro", "Brand": "Lenovo", "SpecificUses": "Multimedia, Personal, Gaming", "ScreenSize": "16 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": false, "exchange": false, "five_star": "65%", "four_star": "17%", "three_star": "6%", "two_star": "3%", "one_star": "9%", "reviews": " ####   Excellent thermals ####   The laptop looks amazin 1.The 16:10 display is an overkill and the battery life on normal mode is poor but good on hybrid mood. Anyways just loved it.. ####   Best ####   I have bought this system around a month back. ####   My review of Legion 5 Pro AMD 5800 ##  RTX 3060 ##  16 GB RAM. Mediatek Wifi (Very important spec :p) ####   Ok so this is a great gaming laptop no doubt... ####   the laptop whole package is awesome. although its a bit pricey you get 3 year warranty and you get qhd 500 nits screen and 6gb graphics nvidia rtx model and msoffice 2019 included with the price and also get highly customizable feature rich and visually attractive bios and lenovo vantage app and x-rite colour assistant app which are used for controlling software and hardware settings and features. ####   You can get the exact same specifications in asus for 1 ## 20 ## 000 /- inr . ####   Beast in gaming ####   Awesome. Works quite well. Loved the features. Has the latest generation tech as of today ####   I bought this laptop for all round work(study ##  gaming and content creation) ####   Even after reading several negative views from customers ##  decided to trust ##  the brand ##  the seller and Am7azon. Received faulty laptop today morning. Display didn't start. Talked for an hour with Lenovo Customer Service. Who has promised an inspection and possible replacement... ####   Overall laptop is very good. But the realtek wifi card is the worst thing about this. It should have been intel ####   Its just awesome  ##  i didn't faced any keyboard backlight issues but i didn't found the lighting control first but after the update its available  ##  and every thing is good but my only concern is the touchpad wabbling a little bit and thats it  ##  its not a problem though  ##  built like a tank and just loved it ####   This is a superb Laptop but there is only one problem this laptop ship's with slower memory this is the only problem i thought ####   They could have also offered a lower specced variant with 512GB of SSD and MS DOS instead of Windows 10 ##  since many of us are upgrading our older laptops which have an SSD with Windows installed on it. ####   The Legion 5 Pro is an absolute beast of a computing machine! The thermals are excellent even in the scorching Indian summers ##  the 2560*1600 16:10 display with VESA certified HDR400 is a marvel to look at ##  and the build quality is as solid as it gets for a gaming laptop. The entire laptop has a metallic finish and feels solid to the touch. The rubber stands underneath the laptop are deep enough to allow for considerable airflow but I would recommend raising the back atleast a few inches during intense gaming sessions. The keyboard has a soft-touch finish to it and it is a pleasure to type on. ####   Every feature of this laptop is amazing. But the RGB keyboard has some serious issues.  It's not getting customized in the Lenevo Vantage app as well via the keybaord shortcut. This is a global issue with a lot of units. You can find the same issue on Lenevo website forums in detail. Few other buyers here on amazon mention the same issue as well. ####   Excellent performance for both gaming and productivity tasks. ####   Lenovo Legion5 -PRO is highly recommended ##  its the only laptop worth buying for its price point ##  got mine delivered by amazon in 4 days ##  been using it for 2 weeks ##  comes with a surprise 3 year warranty by default. ####   Buy this laptop only if its in sale  ##  because the performance your are getting from that price is very high ####   Best for Gaming ####   Be aware before buying!!! Laptop’s igpu not working ##  screen flickers a lot and amd drivers not detecting igpu so i had to refund my product and this is a serious issue some time keyboard rgb not working ..otherwise laptops performance is vey good lenovo should fix this igpu problem..thank u ####   The laptop's built quality of top-notch and full metal alloy construction. Keyboards has good travel distance and no!!! There is no RGB lighting problem. Check attached pics. ####   its good ####   I disliked nothing and i liked everything ####   The legion 5 pro is. a beast ####   The pros of this laptop have been covered in detail. It is a fantastic laptop. However 2 cons of this laptop : ####   (1 month usage update below) ####   Received the laptop today and it is as just as in the description i.e. just wonderful and amazing. The only thing is that delivery guy brought the package to me without the box from Amazon but it was sealed so accept it and Amazon must be careful from next as laptops are fragile so maximum protection is needed. Also ##  while buying the laptop from Amazon they didn't seems to send the bag as well which is a disadvantage means you need to purchase bag seperately overall there is no issues with the laptop or anything and if you need a gaming laptop just go for this one and won't regret it. ####   Gaming - You can't find better than it in the whole world within this price range! ####   What a beauty. In love with the screen and this beast is insanely fast. Ssd inside is too good. ####   Can't change RGB. Stuck in rainbow loop. On the verge of returning. ####   I purchased this from a Lenovo certified offline store at Nehru Place. ####   Initially thought that the 16\" laptop was a bit bulky ##  but it turned around to be much like any other 15.6\" laptop as the bezzels are so thin. ####   Excited for this one! ####   This is the best gaming performance I've had from a system ever. Moving from Nitro 5 to this has been a heavenly experience. Tried a few games ##  some GPU heavy and some CPU heavy and wasn't disappointed. ####   Display and built quality are the best of all which stands out with its competitors. I spent some time playing valorant at medium settings. The cpu temp goes to 75 degrees and GPU temp goes to 60 degrees. You will definitely notice a difference in the display. It's the best display a gaming laptop has.i didn't any fps drops. ####   I'd pre-ordered the laptop when it lauched and was super excited to check it out when it arrived before the specified date. ####   There is no option to change lighting pattern or customize the behaviour in lenovo vantage software. Key shortcut is also not working. ####   Pre ordered and got it on 7th August. ####   Products brought from Amazon comes with only one year warranty only. Trying to resolve the issue . ####   I like everything in this lappy. BTW price 😔 dissatisfied ## but it has a lot of excellent specifications and its mainly designed for gaming"},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 5 11th Gen Intel Core i5 15.6\" FHD IPS Thin & Light Laptop (16GB/512GB SSD/Win 10/Office/NVIDIA GeForce MX450 2GB/Fingerprint Reader/Graphite Grey/1.66Kg) ##  82FG0148IN\n\n\n\n\n\n\n", "mrp": " ₹1 ## 04 ## 890.00", "save": "\n\n\n\n₹35 ## 900.00 (34%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: 11th Gen Intel Tiger Lake Core i5-1135G7 | Speed: 2.4 GHz (Base) - 4.2 GHz (Max) | 4 Cores | 8MB Cache # Operating System: Pre-Loaded Windows 10 Home with Lifetime Validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 16GB RAM DDR4-3200 | 512GB SSD # Graphics: NVIDIA GeForce MX450 2GB GDDR6 # Display: 15.6\" Full HD (1920x1080) | Brightness: 300 nits | Anti-Glare | IPS Technology | 45% NTSC##", "no_of_rating": "37 ratings", "avg_rating": "4.2", "total_no_answer": "\n50 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "IdeaPad 5", "Brand": "Lenovo", "SpecificUses": "Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            7 hrs and 59 mins\n", "emi": true, "exchange": true, "five_star": "58%", "four_star": "21%", "three_star": "9%", "two_star": "4%", "one_star": "8%", "reviews": " ####   battery life is not much good as they are showing site ####   Not recommend at all ####   The laptop is extremely fast and the battery life is very good. Have been using this for around a month and everything has been very smooth. ####   The laptop is a great buy doesn’t heat up except when gaming basic games like genshin impact ##  counter strike go and call of duty on win store can be played easily!!! Could do intermediate python and ML programming with ease !!! Lenovo support is also good keeps laptop in great shape!! ####   Good performance ####   I thought I am buying best configuration. But hanging issue during update and unusual heating issue is there. I have been using laptops of different brands but such an experience is for the first time with laptop. Probably ##  the above issues are only with this piece and may not be genuinely with the brands/model as such. ####   Battery is good ##  display ##  camera is ok ##  no heating issues. ####   Product quality and delivery is great 👍 ####   The laptop stopped working in one month of normal office work (delivered 28th July and stopped working on 30th August). It is not powering on at all. Will update the review once this is resolved by Lenovo. ####   Overall laptop  is really  good. But as mentioned  in product details  is available  with 512GB SSD and 1 TB hard disk. When I ordered  this laptop  i found there is no storage  of 1 TB hard disk only 512GB SSD is available. So 73k is not worth it for this Specifications. ####   This laptop is very versatile go for it ####   Great laptop  ##  worth it  ##  great 👍 battery life ##  good performance ##  slim n light weight. Best for office work and light gaming . Only drawback is that it does has Ethernet port ##  but it has wifi 6 support 👍 ##  overall value for money 💰 ####   I am totally happy with this Lenovo IdeaPad. It runs on Intel processor and is really fast.  I also got the update for the new windows 11. It is running smooth without any hangover or any kind of lags. ####   Perfect Laptop for daily bussiness use  ##  personal use or gaming experience. ####   The complete laptop for my choice in my budget compair to other brands and thanks to Amazon for prime day sale I bought this laptop just 64000/- actual price 71990/- ## 1750 hdfc instant discount ## 4200 emi interest waiver and 2000 cash back offer. ####   Battery usage hours are less I think anti glare is wonderful no issue. ####   I purchased this laptop from lenovo official website and got the defected one. I also saw the reviews there after two weeks that other person is also facing the same issue like me. ####   Keyboard is not suitable for office work as it doesn't have dedicated keys for home ##  end ##  page up/down. Didn't notice earlier now stuck with it! ####   After 7 days of usage: ####   After a lot of research across various brands ##  I finally landed up with lenovo slim 5."},{"name": "\n\n\n\n\n\n\n\nHP 15 Thin & Light 11th Gen Intel Core i5-1135G7 15.6 inches FHD Laptop ##  8GB DDR4 ##  1TB HDD ##  Windows 10 Home ##  MS Office ##  Integrated Graphics ##  FPR 15 (Natural Silver ##  1.76 Kg) ##  15s-du3032TU\n\n\n\n\n\n\n", "mrp": " ₹63 ## 179.50", "save": "\n\n\n\n₹5 ## 189.50 (8%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Timing varies by device. Certain features require specific hardware. # Processor: 11th Gen Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology ##  8 MB L3 cache ##  4 cores) # Operating System & Preinstalled Software: Pre-loaded Windows 10 Home with lifetime validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Microsoft Office Home & Student 2019 | In the box: Laptop with included battery ##  charger # Display: 15.6-Inch FHD IPS anti-glare micro-edge WLED-backlit ##  250 nits ##  45% NTSC (1920 x 1080) # Memory & Storage: 8 GB DDR4-2666 SDRAM (2 x 4 GB) ##  expandable upto 16 GB | 1TB HDD 5400 RPM ##  M.2 Slot free # Graphics: Intel Iris Xe Graphics##", "no_of_rating": "516 ratings", "avg_rating": "3.9", "total_no_answer": "\n229 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery.", "Model": "HP Laptop 15s-du3032TU", "Brand": "HP", "SpecificUses": "Multimedia", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": "48%", "four_star": "22%", "three_star": "11%", "two_star": "5%", "one_star": "14%", "reviews": " ####   This laptop is very sloooow ##  boot time over 5 minutes. MS word can cause this to hang. Battery is average. ####   Excellent product. Booting is slow. But otherwise very good piece. Vivo notebook laptop doesn't have loud speakers it's charger quality is bad. For vivo notebook I had replaced two chargers In  two years. Hence went for this. Excellent product from hp. Value for money. For kids online classes and Normal entertainment channel viewing ##  it's good. ####   Laptop is getting overheated within 15mins while using even the charger is also heating and lagging issue while using Chrome or any other applications ####   Very light weight… comfortable and convenient to use… Fast processing speed.. ####   Battery life is low ##  n the process literally takes 5 minutes to open the home screen ####   Nice pick ####   Excellent laptop working smoothly just go for it...cost is bit high but no worry. ####   Takes lot of time to restart ####   Very very slow. Battery life is very bad. Its just like my ancient desktop. It takes minutes to open chrome browser only. HP has become a cheater brand. And it's price is around 57K ####   Don't buy it from here ####   Very very slow ####   I liked its battery and Graphics but very poor in supporting  ##  never expected to go down in 1st place.. ####   MS Office not provided with laptop as per description on the product in the website ##  to should we contact ####   Laptop is not starting. Please replace. ####   Too cost ##  ####   Battery capacity less ####   Don't use your money for this prodact ####   Best processing. Nice battery life ####   I bought this product from amazon last week.  And right from day 1 ##  despite being I5 and 11th gen laptop ##  it is very slow. It takes a long time even to start and close to 8-10 minutes to stablise the features. I raised a replace request from amazon and they automatically redirected me to mandatory inspection ##  for which i had to take the leave from my work. And then despite the technician report of faulty laptop ##  amazon had updated issue resolved in their portal and without informing they closed the issue. When i enquire the status on 17.08 21 ##  which was showing the last day for replacement ##  they were saying that technician filed issue resolved report with them. and when i requested return the product and refund they refused to do saying the policies are not allowing them to do so. Fortunately i had taken a copy of inspection report from the technician ##  and amazon asked me for the copy to initiate the replace product. ####   It takes more time to start ####   Value for money ####   A laptop slower than 3 year old i3 laptop. ####   Good laptop but delivered late ####   Hate the booting time & uncomfortable keypad ##   to sum up it's waste of money ####   Initially I was happy with the product because it is a new one. But after using it for a couple of days i am totally disappointed with the product. It doesn't seem to be like a i5 processor with 8 gb ram. It's extremely slow ##  even during it's first start which made me worry a lot ##  My old laptop acer which I bought seven years back is even faster than the new one . The battery backup is also not too good. Backup is only for 3 hours in normal use (word or excel using). Quite happy with the delivery it was too fast. But not so happy with the product😢 ####   The system is very slow and there is also a battery problem. The battery is not working in good condition ####   I bought this product.. But it’s very slow and some time not able to start that.. I request for return but I got answer that item can be replace.. I need to use it urgently. The service and product is very bad.. ####   There is no backlit keyboard I was disappointed ####   Nice handy and a functional laptop with the right features. ####   Bad product ####   In three weeks of usage ##  observed: ####   Hanging within 1 week of use wate of money for me ####   It's a literal piece of trash ## there's always a new problem arising in it. And above all HP's customer service won't help you with anything always resorting back to service centre ####   Battery 🔋 gets drained too fast and the laptop is too slow. Cannot believe that it has i5 processor. Mobile phones are better than this laptop. ####   Nice working laptop..amazing deal ..got it at 44k very satisfied. ####   Processor is very slow it is not i5 this is all fraud ####   11th generation works like tortoise ####   Good one ####   Using more than 3 months now.Was searching for a good laptop for home use/kids online school  and wanted something powerful but most importantly my son's eye shud not get hurt due to 2 hours online class everyday. So loved the anti glare screen protector on the monitor. Looks awesome ## Value for money and no battery or any issuesegative to be mentioned. Go for it! ####   This laptop is not up to the mark. I would seriously not recommend the users to buy this laptop. After 5 days of usage my observation goes like the below: ####   Value for money ####   Very nice laptop for my work and longer battery life so very this laptop very useful me very nice wonderful ####    In one word ##  Best. ####   Meets our need to WFH ####   This laptop is very very slow. Takes around 4 minutes to get started. Then it takes its own time to open even 'My computer'. Also the internet browser is damn slow and takes life to open new tabs. Even my old DELL laptop that I had been using for last 10 yrs works faster than this HP Laptop. Battery backup is also very less of only 1.5 hrs. ####   Laptop is not working after 7 days of installation i.e from 18th June 2021 ##  called amazon customer care centre ##  told to call HP ##  called HP customer care centre  ##  told to call microsoft ##  called microsoft no help provided yet ##  laptop is still not working. Not happy with anybodys service ##  expecting amazon should replace this laptop immediately. Till date 06 th july laptop is not working ####   It is very good product and battery power is less  but no problems it is the nick and perfect for online class for 10 to B.tec. students ####   Bought for my daughter studying for B. Tech CS. She is happy with it. ####   I can suggest that if you invest too much money. please go for a better product. the whole HP series is pathetic. My warranty activated before I bought my HP laptop. The product came is scratched from the panel. I ignored that little thing but after that ##  I noticed that the screen panel is broken. I tried to reach out to HP but no help provided from their end and now within one year. The laptop keys were not responding properly. Buying an HP laptop is the biggest mistake of my life. poor performance ##  poor product quality. ####   Battery life last upto 4h in battery saving mode. I think 38000 Rs is best for this laptop not 59000. ####   Opened the box today and this is what we have got . This is so not we were expecting from a brand like hp . I have ordered alot of gadgets online but never faced a problem like this before . Fix it as soon as possible ####   Great ####   The Battery life is amazing comes for almost 6 hrs of usage ##  very light in weight to carry. Its value for money deal as it is elegant easy to use. ####   Heating issues while charging. Apart from this the product is worth spending money. Sleek and classy design with compact handy look. Sound quality is too good. ####   Cons ####   It is nice working super ####   Product delivered without any bill. Product delivered on 05th May but warranty pre activated from Jan. ####   Do not buy hp products. They break on slightest touch and then good look claiming warranty from the extremely unhelpful team of hp ####   Battery life is not good they say it will work for 7-8 hours but it will only work for maximum 4 hours don't buy the laptop go for best battery life ####   No backlit keyboard at this range it should be there ####   Worst product i have ever seen . ####   Got the laptop delivered in te but found too slow in processing as it took approx 15-20 minutes to open Google Chrome ##  word etc. Not advisable for others. ####   58k laptop became dead in a month. ####   Poor Battery  backup ####   Battery life is little bit painful. Light weight. Good laptop in budget. I like the product. Will suggest to purcahase ####   Worst product ####   Nice laptop with high-end configuration. ####   I was unhappy that the product was delivered without charger and power cable. I did not get a reply to my complaint ####   System information should show exact model number as ordered. It's showing  15s-du**** ####   you can go for it . it is definitely a good choice under hp laptops . the battery is not very long lasting but if you charge it fully you can use it for like 4-5 hours . and overall display is good  ## lookwise it is amazing it looks sharp and is totally worth it . ####   Better battery life ####   A good laptop. It is HP original. HP store also offers a free laptop bag along with the product but it was out of stock there. ####   The brand new Laptop did not recognize the external hard disc drive used to transfer data  ##  which drive  which works perfectly well in existing older HP laptops. I have spent extensive amount of time with HP onlince support going component tests ##  checking various aspects in device manager etc- updating BIOS version  ##  but problem remains unresolved ##  so seeking replacement ####   Like ####   Not a good product do not buy it .Facing problem in os. Though weight is alright but ####   Worst product...please make my replacement as laptop is hitting to much.. ####   Battery life okay. It is lightweight and thin. Met my expectations. ####   Waste item ####   Good 😊 ####   Nice ####   Very slow booting ####   Value for money ####   Extremely slow and sluggish laptop. Very strange that its performance is such ##  with a high Technical Configuration. Not recommended at all. ####   Though on the costlier side ##  the benefits of i5 negates it all. Amazon needs to ensure the package is sturdy. The tape on the side was tampered with and there were marks of sharp objects used on the backside resulting in holes in the cardboard box. Thankfully nothing happened to the laptop inside. ####   Slim ##  sleek design ##  light weight and good features. Overall 4/5. Little costly but in this budget ##  it's fine. ####   Light and thin laptop. Easy and convenient for those who are travellers ####   Attractive ##  Good  performance  ## add SDD for excellent permormance ##  excellent battery. ####   I like it's Light weight and smart thickness ####   Worest product from HP. It's very slow and now it's stopped working. I purchased this 2 weeks back and now it's not working. Please dont buy this product and don't waste your money."},{"name": "\n\n\n\n\n\n\n\nAcer Aspire 3 AMD Athlon Silver 3050U Dual-core Processor 15.6\" (39.6 cms) Laptop - (4 GB/1TB HDD/Windows 10 Home/AMD Radeon Graphics /1.9Kg/Silver) A315-23\n\n\n\n\n\n\n", "mrp": " ₹39 ## 999.00", "save": "\n\n\n\n₹12 ## 509.00 (31%)\n\n\n\n\n\n\n\n", "price": "₹27 ## 490.00", "about": "#Laptops # Processor : AMD Athlon Silver 3050U dual-core processor |RAM : 4 GB of DDR4 onboard memory ##  upgradable up to 8GB of DDR4 system memory using single soDIMM module # Display : 15.6\" HD 1366 x 768 resolution ##  high-brightness Acer ComfyView LED-backlit TFT LCD | Graphics : AMD Radeon Graphics # Storage : HDD : 1 TB 2.5-inch 5400 RPM | SSD : Supports up to 1 TB ##  PCIe Gen3 ##  8 Gb/s ##  NVMe # OS : Windows 10 Home | Battery : Up to 9 hours | Weight : 1.9 Kg | Color : Silver##", "no_of_rating": "9 ratings", "avg_rating": "3.7", "total_no_answer": null, "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "Aspire 3", "Brand": "Acer", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   The laptop is overall good. However ##  I am experiencing problem associated with hanging. I am not sure whether is it something related with laptop or windows. The laptop freezes sometime while working. ####   Super fast delivery! Nice packing !! No transport damage ####   Best product for the price offered. Best basic student laptop. ####   I don't know but I ask the same model prize in my local pc shop he told me its price was 18k and here this lapy price was 30k f very disappoint ##  men"},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 3 AMD Ryzen 3 3250U 15.6\" (39.62cm) HD AG Thin & Light Laptop (8GB/256GB SSD/Windows 10/Radeon Graphics/MS Office/Platinum Grey/1.85Kg) ##  81W101QYIN\n\n\n\n\n\n\n", "mrp": " ₹43 ## 990.00", "save": "\n\n\n\n₹7 ## 000.00 (16%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: AMD Ryzen 3 3250U | Speed: 2.6 GHz (Base) - 3.5 GHz (Max) | 2 Cores | 4 Threads | 4MB Cache # OS: Pre-Loaded Windows 10 Home with Lifetime Validity # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM DDR4-2400 ##  Upgradable up to 12GB | 256GB SSD # Graphics : Integrated AMD Radeon Graphics # Display: 15.6\" HD (1366x768) | Anti-Glare | 220Nits Brightness##", "no_of_rating": "273 ratings", "avg_rating": "4.2", "total_no_answer": "\n46 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "IdeaPad 3 15ADA05", "Brand": "Lenovo", "SpecificUses": "Personal, Student, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 29 mins\n", "emi": true, "exchange": true, "five_star": "53%", "four_star": "29%", "three_star": "9%", "two_star": "3%", "one_star": "7%", "reviews": " ####   I bought the laptop looking at the configuration and pruchase...after using the laptop I realized ##  configuration on paper is not everything! ####   i bought this laptop when there was no review . i am the first person who purchased this laptop from amazon . i was very scared about this laptop but this is the best best laptop . and it's best for gaming also it has 2 gb video ram . i am using form 2 weeks and it's very fast and very very awsome laptop . battery is also awsome . it's gives 5 hour back in normal use and while gaming i gives 3 hour back. it's come with mcafee antivirus i month free trial and i purchase 1 year mcafee subscription in just 269 rupee and it's best antivirus. ####   I bought this laptop with 8GB of ram and 256GB SSD ##  and AMD ryzen 3 3250U with integrated graphics. ####    Excellent performance with 8gb ram and ssd. Loads under 10 seconds and eligible for windows 11. But slightly higher weight. ####   Color is not good ####   Not good ##  not satisfied by its built quality. ####   Never buy lenovo laptop. Only in 11 months without much usage laptop not working properly. And lenovo customer service for repair is pathetic. 14 days have been gone since i have made a service request on lenovo customer support website but till date no solution at all. They don't care what you have gone through. Don't buy lenovo laptop otherwise you will surely regret on your decision. ####   But very less battery life ####   The product is good ##  light weight having around 4 hrs battery life.speed is also fine but this product has very less sound. ####   Overall a nice compact yet powerful laptop with good finish and optimum performance for regular use in office. Budget friendly. Good option for 2-3 years purchase. ####   Performance is mediocre. Boot times are blazing fast. Install linux and enjoy it's full potential. I personally tried Pop_OS and it runs like a charm. You can play old titles and some light weight games. Don't expect high framerates in AAA titles. But old games like GTA 5 are playable with around 40 fps in low 720p. All in all a good buy and Lenovo's thermal management with AMD chips is very nice. I could hardly hear the fan ever get loud enough to be audible even under heavy workloads like gaming. ####   Supereb ####   This is a perfect laptop in this prise but battery backup is  a bit low. Otherwise everything is great. I am using sinse 3 month and still working perfect. ####   Happy with this laptop' ####   Na ####   Very bad ##  literally got hanged over and over again during my GRE exam. Used hardly for a month.  Waste of money! ####   Slightly on the bulky side for those who prefer lightweight laptops. But good value for money as combination of Ryzen processer and SSD disc is value for money for everyday task and normal office work. We use it for mostly editing in Word and it performs effortlessly on that front. ####   Full HD screen ##  Ram ##  Speed ##  ssd+hdd are features are good in class & value for money 👍 ####   I use it for study but didn't get pre installed ms office ####   Value for money! ####   Reviewing after a month of use ####   Not working ####   I really like this laptop ####   8GB RAM and SSD with this price range is wonderful. ####   Product is upto its mark. The only thing is the SSD Storage is a bit less for hardcore users. But you can extend if you can. Rest the product is good and does the job. ####   Bought it during Great Indian sale in October 2020. Among all the laptops within 30k price range this is undoubtedly the best one. Don't go for 1TB HDD version instead choose 256GB SSD even if the storage is low. You will thank me in the long run. You can upgrade your storage later if you want. ####   Value for money ####   Everything is good but one thing that I didn't like is that it gets fingerprint on its body very easily and you need to clean it again and again ####   value for money ####   I have been using this for 3 weeks now for official purpose. And my experience is excellent compared to price of the laptop ##  it is fast and light weight. ####   A very good product with a great exchange deal ####   only 190 GB Usable from 256gb SSD ####   MODEL IS GOOD GOOD SPEED ONLY WITH MOUSE TOUCH PAD I THINK MANUFACTURE DEFECT IN MOUSE TOUCH PAD THAT'S WHY USING EXTERNAL MOUSE I HAVE ALWAYS CARRY WITH ME HP IS MUCH BETTER ####   Value for Money ####   Its One of the Best Budget Laptop you could get it ##  I got it at 28.7k during Happiness Upgrade Days ##  ####   Really amazing product at this price range ##  I loved the design and it's battery life.its good light multitasking as well! I have been using from 5 days ##  and I didn't found a single problem with respect to performance! ####   This is an awesome product and well packaged.The laptop is working well. There is no sound produced by the fan. The booting speed is quite well. The performance of the laptop is awesome.The quality of the product is good. The battery life is very good and it stands up to four to five hours. The screen is not bad but that doesn't matter. This laptop is good at this price. 30k. ####   The product is very good. I have give 4 stars because the camera quality is not good. If this can be fixed I'll be happy as my job requires a better cam. ####   Super ####   Perfect ####   Good midrange product for daily purpose ####   Yesterday I received this laptop.. packaging was good ##  I am very much satisfied ##  but the screen and sound quality are not up to the mark ##  ppl who are looking for performance ##  speed and can compromise for screen and sound go for it...I got it for 28400rs. ####   Ms Office was not pre-installed. Although while purchasing the product it was clearly mentioned it would be pre-installed. It was confirmed by Lenovo technical support. ####   It is good product and value of money ####   After doing research on internet ##  I selected this product and it is amazing with high speed of processing and response. Under budget ##  it is best laptop with 8gb ram and ssd making it a lot fast speed machine. If you are thinking for i3 then you can also consider ryzen 3. I got this laptop at price of 31k. ####   Nice Laptop. Best product in this price range. ####   Light weight ##  fast boot up ####   °>Very good product.... Its quality is very good and it looks like metal body but it is plastic... ####   The brightness is pretty low. U cant do anyting about it. And one simple driver update crashes the system ####   Sound is very low. Sound is inferior to mobile phone even. ####   Really a value for money Laptop ##  Very slim and light weight. If you plan to buy a laptop go for any laptop but with below specification ####   I HAVE DELL ALL IN ONE AT MY HOUSE BUT ITS TOO SLOW.ITS BOOT TIME IS ALSO MORE THAN 1.5 MIN.BUT I AM VERY SATISFIED WITH THIS LENOVO RYZEN 3 SSD LAPTOP. IT TAKES MEREKY 5 SEC. TO BOOT.REPOND TIME IS VERY GOOD. IAM TRULY SATISFIED WITH IT. ####   Wireless adaptor missing after updation of windows 10 ####   It is a great laptop in this range with great specifiations. When I saw it I felt that it is a great deal and believee it is. Its specs are good but its build quality is very poor. If there is no younger children at your home you can buy it ####   Build quality not upto mark ####   Best laptop in this price range ##  good and premium look ##  enough RAMof 8GB. Little short with storage. Battery backup is average. ####   Good laptop and good performance ####   All rounder laptop with 8 GB ram and 256 GB SSD ####   First of All A Good Product From Lenovo with such Amazing Specs ! ####   Very good product in this price ## Fast and responsive ####   Overall Very good Laptop at under 30K. Item as per descriptions. Working smoothly. Thank you. ####   Better speed but less storage. The choice is urs u might be comfortable with less speed and more storage.  The best deal in this price range although to reduce the cost they made the product fully non metallic. So it should be handled with care ####   thanks lenovo ####   Some of the keys of the keyboard are not working. And amazon arranges technical support after a weeks time. Decision will be taken after that. Sorry for inconvenience is what they say. ####   Good product ####   GOOD PERFORMANCE COMPARED TO DELL AND OTHER LAPTOPS BUT THIS LAPTOP BELIEVE ME THIS IS BEAST IS IN ITS SEGMENT!! ####   Don't buy  ## it's my sincere request to all not to buy laptop online  ## spend little extra cash and buy from the store  ##  just 3 days after buying the laptop my laptop has hanged . MS office is on trial basis for a month after that I will have to buy the software and same thing is with the antivirus . This was my first time buying a laptop online and this would be my last  ##  if a thing that cost 35-40k and it's hanging just 3 days after purchasing  ##  Amazon is making a Fool out of us . ####   I am doing research from one month for buying a laptop and after all the hustle my luck bring me to this laptop. My genuine suggestion to all who want to buy anything just wait for right time and keep patience you will definitely get a good deal . By keeping patience and waiting for right time I got this laptop for the least possible price . ####   When i bought this it was having a 1 star rating and that too by 1 rater. Not convincing right? But then i found the same laptop listed on flipkart at a higher price and much higher rating. Though the configuration always attracted me but it was lack of interest on amazon which was keeping me at a distance. Seeing the flipkart ##  i quickly grabed it and found the laptop as expected. I am not an expert but it is an overall nice deal. Got it exchaged for my 11 year old pentium and final price around 23.5k. issues like weight a bit higher despite no cd drive ##  keys positioning ##  user memory available showing around 3gb ##  low audio and mcafee trial ver. ####   Overall good product...... But not fully satisfied ####   All other things ok as such. but screen brightness is too low. ####   Got the laptop yesterday for around 31k ##  Overall good laptop look wise good it boots really fast for me it take 5-6 seconds .But the camera and sound quality is not as good so these two are the cons which can be improved in the actual price of 42k . ####   delivery is excellent within 2 days of booking in excellent condition. product is excellent in such low price band ##  its speed of working remarkable . Product appearance is ultimate . Its worth to purchase. ####   Good laptop as per specification. ####   This product deserves 5 star but I am giving 4 stars because of laptop build quality only. ####   Good laptop got it for 29k. At this price range the best laptop you can buy is this. Go for it. Boot time only 3 seconds ####   *Best Laptop under this Budget . ####   Worth what we pay.. It can get you done your normal work from home tasks at Ease. Wifi is clocking 85MbPS easily.. Note that my internet connection has100 Mbps as the max speed.. Display looks good and boots up in under 10seconds... ####   Happy with this product.. ####   Very good product in this price range. 256Gb ssd harddrive gives very good performance. ####   Pros: ####   Very good product in this price range ####   Specifications are good at this price. ####   Best laptop under this budget performance of the laptop is very good suitable for daily usages but  not for heavy gaming  over all it is a good laptop ####   Got it today... Performance is fast thanks to SSD and 8GB...first day review five star.... ####   Good packing & i got genuine product ##  Thanks Amazon... ####   Machine is little flimsy. Performance is good as it is loaded with ryzen 3200u ##  8gb ##  NVMe.SSD. It took me by surprise on my first boot the key strokes didn't work. Audio is merely audible. Overall OK for simple everyday use. ####   I have both Dell Vostro 3490 & Lenovo IdeaPad S145. AMD Ryzen performance ##  8GB & SSD Harddisk gives a better response & performance. I would say value for money. Go for it. Both come with similar price tags but Dell got 4GB ##  SATA HDD which impacts the performance in a big way. ####   This looks very cheap quality laptop and don't take risk to buy this it is totally weste of money. Thanks you"},{"name": "\n\n\n\n\n\n\n\nDell Inspiron 3501 15.6\" FHD Display Laptop (i3-1005G1/ 4GB/ 1 TB/ Integrated Graphics/ Win 10 + MSO/ Accent Black) D560285WIN9B\n\n\n\n\n\n\n", "mrp": null, "save": null, "price": "₹41 ## 990.00", "about": "#Processor:10th Generation Intel Core i3-1005G1 Processor (4MB Cache ##  up to 3.4 GHz) # Memory & Storage:4GB ##  4Gx1 ##  DDR4 ##  2666MHz | 1TB 5400 rpm 2.5\" SATA Hard Drive # Display:15.6-inch FHD (1920 x 1080) Anti-glare LED Narrow Border WVA Display # Graphics: Intel UHD Graphics with shared graphics memory # Operating System & Software:Windows 10 Home Single Language | Microsoft Office Home and Student 2019 # I/O ports:USB 3.2 Gen 1 (x2) ##  USB2.0 (x1) ##  HDMI 1.4(x1) ## One SD-card slot  ## RJ45 - 10/100Mbps##", "no_of_rating": "1 rating", "avg_rating": "4.0", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "Inspiron 3501", "Brand": "Dell", "SpecificUses": "Personal", "ScreenSize": "15.6 Inches", "OS": "Windows 10", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\n(Renewed) HP Elitebook Laptop 640G2 Intel Core i5 - 6200u Processor ##  8 GB Ram & 256 GB ssd ##  Win10 ##  14.1 inches ##  Optical Drive Notebook Computer\n\n\n\n\n\n\n", "mrp": " ₹89 ## 990.00", "save": "\n\n\n\n₹58 ## 000.00 (64%)\n\n\n\n\n\n\n\n", "price": "₹31 ## 990.00", "about": "#Operating System: Windows 10 Pro # Processor type: Core i5 - 6200u # Size: 14.1 inches##", "no_of_rating": null, "avg_rating": "3.9", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "HP", "Brand": "14 Inches", "SpecificUses": "Windows 10 Pro", "ScreenSize": "Intel", "OS": "Grey", "more_detail": "", "order_within": null, "emi": true, "exchange": false, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nHP 15 (2021) AMD Ryzen 5 5500U 5th Gen 15.6 inches FHD Screen Laptop with Alexa Built-in ##  8GB RAM ##  512GB SSD ##  Windows 10 ##  MS Office ##  1.69 kg\n\n\n\n\n\n\n", "mrp": " ₹57 ## 505.00", "save": "\n\n\n\n₹1 ## 015.00 (2%)\n\n\n\n\n\n\n\n", "price": "₹56 ## 490.00", "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Timing varies by device. Certain features require specific hardware. # Processor: 5th Gen AMD Ryzen 5 5500U (2.1 GHz base clock speed ##  up to 4.0 GHz max boost clock ##  8 MB L3 cache ##  6 cores) # Memory: 8 GB DDR4-3200 SDRAM (1 x 8 GB) ##  upgradable up to 16 GB (2 x 8 GB) | Storage: 512 GB PCIe NVMe M.2 SSD # Display: 15.6-Inch (39.6 cm) FHD SVA anti-glare micro-edge ##  250 nits ##  45% NTSC (1920 x 1080) # Operating System & Preinstalled Software:Pre-loaded Windows 10 Home with lifetime validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Microsoft Office Home & Student 2019 # Graphics: AMD Radeon Graphics##", "no_of_rating": "201 ratings", "avg_rating": "4.2", "total_no_answer": "\n277 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "HP Laptop 15s- EQ2040AU", "Brand": "HP", "SpecificUses": "Personal", "ScreenSize": "39.6 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": "56%", "four_star": "28%", "three_star": "7%", "two_star": "3%", "one_star": "6%", "reviews": " ####   Honest review after using 5 months. Battery life is good. But hardware quality is not so good also sometimes it gets hangs and lagging also. As per product description it has Ryzen 5 but it’s not work as it has to. Slow processing. You should have to take another option. ####   Its worth buying this laptop ##  battery backup is so good it runs 7 hours in one charge ##  it takes a maximum of 5 sec to open ##  it never lags. If you are planning to buy just buy it ##  camera quality is little low but works fine . ####   Display is not good 😜 ####   Getting keyboard marks in screen when I am closing the lid. Is this screen issue or just keyboard marks ####   I upgraded from an HP probook 440 g4 so this feels like a Macbook in my hands! Totally value for money ####   Display screen in description is sva but ####   Great product ##  if has variants like 1 TB ssd or ssd + 1 TB and ram option like available with 16 GB it would be greatest of all time.. 😀 ####   While on hibernate laptop still remains warm. So battery will drain overnight. Tried all possible solutions under power settings ##  nothing helps. Wifi disconnection is frequent ##  1-2 daily. Once disconnected ##  for sometime wifi will not detect any network. ####   This laptop is good but not best at the price . U can go for hp14sfq1030au model which has better screen and backlit keyboard too. But if 15.6 inch is imp for u then u can definitely go for it ## it will not let u down. U can do occasional gaming editing and every type of coding stuff. Also on battery life which is 6hrs max i got. Wifi connectivity is fast. But tge camera is very poor. Build quality good but what can u expect from plastic build ####   Laptop boots fast. Good anti glare screen. Wish amazon could have added some more accessories like wireless mouse etc. Laptop bag should be given. HP website provides a bag with this laptop ####   Its just awesome lappy  ##  It can be compared with i7 . Its works best than intel . But it doesnt have backlit . But its smaller size has (14inch). Good in this price range . Works quite smooth. ####   One of the button in keyboard is uneven ####   Quality lap ##  but the price of this lap in hp site is much less not sure why it's costly in here. Gamers don't go for this ####   Keyboard is faulty!! The @ and \" signs are interchanged !! This is really not expected from HP and Amazon!! Need this rectified immediately ####   Disappointed with this purchase. Within one and a half month laptop's display went dark right in the middle of work. I have reported the issue (Case Number 5069042865). It's a hardware problem and requesting for a new laptop in exchange as it falls well within warranty. ####   Pros ####   Decent product but i have facing heating issue and battery backup is 2-2.5hr only for normal usage ####   Nice one!But display is not good as expected. ####   I like.. everything is good except the keyboard back light.. there is no keyboard backlight. I feel thats the only drawback in this model. Other than that perfoemace and portability is wonderful ####   Really nice product from HP. No heating. Nothing. ####   Boot up in max. 10 seconds ##  shut down is in 2-3 seconds. The configuration is worth and it does processing very fast. Compared to my earlier Dell PC (4G ram with i3 10th gen processor) ##  it is at-least 4-5 times faster. Superbly better than the dell and I am totally satisfied with this HP laptop. It's worth and I recommend buying it -- though NOT as a gaming PC. It does most of my normal stuff without lagging/slowness in response. ####   After 1 month research ##  i bought this Ryzen 5500 powered HP laptop @50k. Its 7nm technology and SSD made it very fast. Battery life is above expection 10-14hrs if you do office works. Only demerit is that it has 2 usb ports ####   Value for money ####   Like: ####   The Laptop is worth its money due to the latest AMD 5000 series processor with 6 (2.1Ghz each) core & 12 threads that helps in numbers crunching processing power. ####    Display quality low. Touchpad one side small .Stay away from this seller. Keys not well mounted. ####   Poor screen quality want to return this product ####   Loved everything about the laptop. We are getting absolutely beast machine at a affordable price. ####   Microsoft Office Home & Student not installed as assured activation key not provided. ####   All things are good but trust me guys you should not trust the display...I have been facing display flickering issues while I am playing any kind of videos. My desires to watch movies and series just went airways... ####   Laptop is good. No lag so far. ####   Just got the laptop y'day. Useful tip: wait for Appario retail to stock it because they give a lower price. ####   I am reviewing this product after 7 days of use and Everything is going good till now. I think this laptop is best laptop under 50k and even under 55K. ####   Better than expectation. Great battery life and very easy on eyes. Should offer this laptop in 16 GB Ram variant as well. Value for money. ####   I've ordered it on last week ##  sold by appario retail private ltd ##  everything is fine ##  but the laptop has issue with keyboard ##  one key was not working ##  issue was intermittent ##  so I contacted Amazon then they arrange for return.  So my advice is please do check the laptop thoroughly ##  don't blindly believe in QC sticker. ####   Best laptop ####   1. Very fast ####    I M CA STUDENT I PURCHASED ITV AT 48000 BELIEVE ME THIS IS THE BEST PURCHASED  OF MY LIFE.  But i see some thing very bad in this as we prefer amazon for shopping there is a damp in laptop please take it back ####   The power button was not working properly. When i click on the power button it is not turned on. The. I thought the laptop has no charging and incorrect it to charging cable ##  then it turned on and battery was 89%. Why did it not turn on ? It happend 2 times in 4 days. i have decided to return it back and i have not got replaced the device isntead they refunded me. Well i have to search again for someother laptops and all my effort to find the hp laptop was useless. ####   Best thin and light laptop you can get in this price range. ####    The display is good however it is va but with anti glare its awesome ##  if you use to sit on table and work ##  then its for you.You can chill out also(netflix). I bought it for programming and it is very good in terms of performance. You can do a bit of gaming also. ####   I have ordered this laptop on 18th may ##  it had some dents even though Amazon package was good. But Hp package had small holes (approximately 0.5 cm2) with these holes laptop body got two small dents of 2mm2 and 1 mm2. For which I have contacted customer service they readily agreed to replace the  laptop and replacement order received today i.e 30/05/2021. Now I have fully configured the laptop and battery is good. Overall good experience at 45k. ####   Good ####   Please gamer's don't buy the my personal gamming expression is very bad.. ####    The fastest laptop /pc I have ever owned. Never used an i5 ##  but this is soooooooo fast ##  it's amazing. ####   Great product in the long run ####   You cant see letters... Grey paint on silver background... Worst idea... How can a big company do this stupid thing... And also it don't have backlit keyboard. Its too hard to type .. can't see a key properly... And beware of display.... It doesn't look good. ####   Good laptop for students to do all activities easily because of such a powerful prossesor ryzen 5 5500u. ####   First of all ##  the latest Hexa core Ryzen processor works like a charm. No heating or hanging even after running full day. Good for day-to-day work/programming. Don't expect gaming as no dedicated graphic card. ####   better in class ####   After using this product for one week ##  here's my review of this: ####   Only missing backlit keyboard😔😔 ####   Nice Laptop ####   Good product when new! Have not tested for heavy use yet. ####   Beautiful display and beautiful design.. Build quality is good... Laptop is fast..... But one con.... Viewing angel which watching video is not good.... You not able to watch video even you silently change your angle ####    It does its work absolutly fine. I will not complain about any game or high end editing as this is office laptop. I saw someone mentioned that they received bag but its not correct. Please be noted that you will receive laptop ##  charger and a manual inside the box. This comes with a good packaging so there were no damage on this. Overall this was good experience. Now I will use my laptop for daily office use and see if this is as mentioned  on papers or somewhere behine those specifications. ####   No backlid keyboard ##  build quality is not good ##  speakers are of low quality ##  rest all is okay. ####   Amazing product by Hp after so long waiting for Amd ryzen5 5500u processor & with amazing fully loaded laptop. ####   Following are specs features ####   The laptop is great. ####   That color rendering on the display could have been better ##  but this is what we can expect in a midrange laptop I guess. Overall performance barring that brillant with and additonal 8 gb added on ####   The looks touch nd feel is premium for sure...light weight  ##  but u will find the performance of system and battery life to be pretty average nd somewhat disappointing considering price point of almost 50k..... ####   Super impressed with the performance thos laptop delivers ## the new ryzen 5 5500U processor delivers that with ease. I ran Valorant on this lap and it delivered constant 60fps without fail.Also got 10 hrs of battery backup with light work. ####   To satisfying laptop in this price 👍. Backlit keyboard is not there in Ryzen 5th generation processing is not fair but overall it's a better choice now at this price 😊 ####   Worst display.. Don't buy it ####   Perfect for office work. I have no issues with this product. Totally satisfied. Build is premium. Keyboard and trackpad are of great quality. Screen is okay at this price. Sound is crisp ##  clear n perfectly loud. Webcam is like all other laptop (dont expect crystal clear video from it). Performance is the no. 1 highlight of this laptop. At this price a 5th gen ryzen 5500u (even though built on Zen2 Architecture) is more than any1 can ask for. Extremely snappy and fast program opening speeds. U can bet on it. Go ahead and experience it urself. ####   I'm using this device for web & mobile app development. Overall great experience ##  great performance. I installed Manjaro onto it ##  which took 1.5 minutes to complete ##  which is amazing. Only thing is ##  I installed Network Driver (Realtek on Linux) on my own. It worked fantastic. With full charge ##  I get 15 hours of battery life (keep in mind that I'm using Linux). ####   This a a classy laptop slim look loved it ... you can go for it ♥️🤗good for new users. Look is very nice ....battery  is also lasting  for more than 7 hrs till now its working  ... ####   good product inth8s price ranges. very very nice product.according to me this the best laptop for it b.teach student.go for it. ####   Very nice laptop . GO for it!! ####   Ordered this laptop y'day and got it delivered today (too quick). The initial impression is very good as even with plastic build ##  the laptop looks slim & feels premium. I would have preferred a darker colour but didn't had a choice so can't complain on it. Now on the product: ####   A decent one for working professionals and students but it is not good for professional gaming ####   Cons: ####   One of best available in the 8GB ##  512 SSD ##  50k price range. Good to go if you like a larger screen than a typically preferred 14\" screen."},{"name": "\n\n\n\n\n\n\n\nASUS VivoBook Ultra K15 (2021) ##  15.6-inch (39.62 cms) FHD AMD Ryzen 5 5500U ##  Thin and Light Laptop (8GB/1TB HDD + 256GB SSD/Office 2019/Windows 10/Integrated Graphics/Silver/1.8 kg) ##  KM513UA-BQ513TS\n\n\n\n\n\n\n", "mrp": " ₹74 ## 990.00", "save": "\n\n\n\n₹20 ## 000.00 (27%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: AMD Ryzen 5 5500U Processor ##  2.1GHz Base Speed ##  Up to 4.0GHz Max Boost Speed ##  6 cores ##  12 Threads ##  8MB L3 Cache # Memory: 8GB (4GB onboard + 4GB SO-DIMM) DDR4 3200MHz ##  Support up to 12GB with | Storage: 1TB SATA 5400RPM 2.5\" HDD + 256GB M.2 NVMe PCIe 3.0 SSD # Graphics: Integrated AMD Radeon Graphics # Display: 15.6-inch (39.62 cms) FHD (1920 x 1080) 16:9 ##  250nits LED Backlit LCD ##  Anti-glare IPS-level Panel ##  NTSC: 45% # Operating System: Pre-loaded Windows 10 Home with lifetime validity | Software Included: Pre-installed Office Home and Student 2019 with lifetime validity # Design & battery: Up to 18.6cm Thin | NanoEdge Bezels | Thin and Light Laptop | Laptop weight: 1.8 kg | 42WHrs ##  3-cell Li-ion battery | Up to 8 hours battery life ;Note: Battery life depends on conditions of usage##", "no_of_rating": "27 ratings", "avg_rating": "4.4", "total_no_answer": "\n21 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 6\n", "Model": "VivoBook Ultra K15 (2021)", "Brand": "ASUS", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "39.62 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 43 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   Pros: ####   It is a best product by asus . everything is working smoothly. There is no hitting  issue. ####   Go for it ####   It's been 5 days since I took this Laptop and I'm Use it so much that i'm still working smooth battery backup 8 hrs don't care about it. Trust this Laptop and take will be me benefits ####   After using the ASUS VivoBook Ultra K15 (2021) - Hearty Gold variant for more than two weeks now ##  I am writing this product review. I bought the same on 25th August 2021 for Rs. 60 ## 999. ####   The lap colour is so good I Luv it. Battery good ##  not the best ##  Screen nice but I have supr amoled moblie so im preferring use moblie over all supr. if u can get under 58k dis is the best 😎 ####    My laptop hangs all the time. Even there is problem regarding keyboard and microphone ####   Only brightness must be more. Performance of laptop is good. ####   There's already a review with pros and cons of this product. ####   You won't regret just buy it. ####   Purchased for my regular home use and for my kid's SFH (School from Home); So far good going ##  face no problem. - Sold by Appario Retail Private Ltd with 1yr additional extended warranty from TPS - Installed the latest updates for OS & Office - office registration with lifetime validity - no issues or slowness after upgrade - fingerprint scanner works well - The keyboard has good key travel ##  though backlit is not required during daylight or night light; it is useful in a completely dark room only - the laptop is not heavy at all - ultra-thin and light - has provision to upgrade RAM & SSD - will do HW upgrade definitely after 3 months and let you know. ####   After so many research finally planned to purchase this.As it's a new launched laptop can't get enough reviews but beleiving on the spec planned to purchase.My beleif not went wrong.Its works amazing.Though I put review on one day as per that it's awesome.Bootup is very faster as it has SSD.Also had confusion over intel and AMD.But trust me AMD Ryzen 5500 performs very good much faster than Intel i5.Sound quality is also decent. ####   Good laptop performance...lag free ####   It's a bad choice to purchase anything  from asus. No product  last for more then a year.  I am saying with my personal  experience"},{"name": "\n\n\n\n\n\n\n\nMSI Modern 15 ##  Ryzen 7 5700U ##  15.6\" FHD IPS-Level 60Hz Panel Laptop (8GB/512GB NVMe SSD/Windows 10 Home/Carbon Grey/1.6Kg) ##  A5M-066IN (Modern 15 A5M-066IN)\n\n\n\n\n\n\n", "mrp": " ₹78 ## 990.00", "save": "\n\n\n\n₹19 ## 000.00 (24%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: AMD Ryzen 7 5700U Up To 4.3 GHz # \"Operating System: Pre-loaded Windows 10 Home with lifetime validity |Preinstalled Software: MSI BurnRecovery ##  MSI Battery Calibration ##  MSI Help Desk ##  Norton Internet Security (trail 60days) Norton Studio (Metro) (permanent free) ##  Nvidia GeForce Experience ##  Nahimic 3 ##  Dragon Center | In the box: Laptop ##  adapter\" # Display: 15.6\" FHD (1920*1080) ##  IPS-Level 60Hz Thin Bezel ##  45% NTSC # Memory & Storage: 8 GB DDR4 3200MHz RAM ##  expandable to 64 GB | Storage: 512GB NVMe SSD. # AMD Radeon Integrated Graphics # \"Thin and light design | Laptop weight: 1.6 kg \" # Keyboard: Steelseries White Backlit Keyboard | Camera: HD type (30fps@720p) | Microphone: Built-in microphone##", "no_of_rating": null, "avg_rating": "4.6", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "Modern 15 A5M-066IN", "Brand": "MSI", "SpecificUses": "Multimedia, Student, Business", "ScreenSize": "39 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nAcer Aspire 5 AMD Ryzen 5 5500U Processor 15.6 inches Business Laptop - (8 GB/512 GB SSD/Windows 10 Home/Radeon Graphics /Microsoft Office 2019/1.76 kg/Silver) A515-45\n\n\n\n\n\n\n", "mrp": " ₹64 ## 990.00", "save": "\n\n\n\n₹6 ## 550.00 (10%)\n\n\n\n\n\n\n\n", "price": "₹58 ## 440.00", "about": "#This laptop packs a punch in terms of performance as it comes with an AMD Ryzen 5500U processor . It not only gives you enough power to seamlessly tackle your work-related tasks but also keeps you entertained as you can play games ##  watch movies ##  and do more. # 15.6\" Full HD (1920 x 1080) IPS Widescreen LED-backlit Display | AMD Radeon Graphics # 8 GB of onboard DDR4 system memory ##  upgradable up to 24 GB of DDR4 system memory # 512GB NVMe SSD  ##  also supports up to 2 TB 2.5-inch 5400 RPM # Includes Microsoft Office 2019##", "no_of_rating": "79 ratings", "avg_rating": "4.5", "total_no_answer": "\n104 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 20\n", "Model": "A515-45", "Brand": "Acer", "SpecificUses": "Creative, Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   The numbers mentioned in the website doesn't work. Chat facility is a waste of time. It's terrible support. 8GB RAM is a joke and I was expecting that I will be able to upgrade it. Looks like it will be difficult to do it via acer services. So ##  bought a RAM with exact specifications online and installed it myself. Warranty will be difficult for sure. ####    Product is awesome ##  light weight and looks very good specially in reallife ####   Very slim lapy and the processor is awesome....... Just go for it ####   Not Good Product of Acer Aspire 5 AMD Ryzen 5 5500U Processor ####   Excellent battery life ##  can easily last upto 10hrs. ####   Great product ## fully satisfied ####   Merits ####   Recently i bought perfomance good 🌹🌹🌹 ####   Great laptop with very high quality screen ## the battery life is around 7 hrs and the trackpad is just excellent ####   Can't return now. Bad product ####   I am sharing this review after purchasing laptop from local shop where I get best deal.. here are some genuine reason why you with pros and cons.. ##  ####   Good Battery life ##  snappy performance (any time I had minimum 15 chrome tabs open along with 3-4 other apps. No lag. ####   Everything is awesome good for students and little gaming and it has and issue i face when i was updated the update  ## The battery percentage from 100% it went to 25% in half an hour and the speakers are shit better get a pair of earphone ####   I love all over design of laptop thin and lightweight and performance of this laptop is unbelievable its full fill my all requirements but price range higher because when we see on acer official website price are low and always show out of stock over all acer doing very well in term of body we got aluminum top and backlit keyboard ####   We had purchased for our son and he just loved using the laptop for everyday use ##  Coding ##  watching videos ##  attending webinars and attending his classes online. The battery backup is amazing and the Laptop overall is just awesome. No issues as of now connecting to Wifi 2.5 ghz/ 5 ghz band. Since we have Airtel broadband the Wifi autoconnects to highest 5 ghz band and is super fast. Laptop opens up super fast and depends on if we have configured any login password or personalised photos/background during Laptop login page ##  based on which little difference may be seen but overall great processor for faster access to anything to be done with this laptop. Not has an opportunity to contact ACER for any issue as Laptop is working great. Thank You. ####   Very sleek...light weight...very fast... ####   Used it for a week and.... ####   Product as mentioned ####   I was eyeing for this laptop since its announcement. ####   Speaker and camera ####   I found this Laptop on ACER and Croma site at night for 53K and 52K. Being sleepy ##  I left it and next morning it was out of stock on both. Then I bought it on Amazon for 56K less 1K discount for HDFC card. ####   Everything's great in this machine. ####   Amazing display ##  good battery backup ####   The 5500U is ##  to slightly put it ##  ABSOLUTELY BONKERS ##  Gives even the Current Generation i7s ##  (dare I say i9s) a run for their money. Compiles the entire Linux kernel in under a minute (If you don't know what that means ##  let me tell you its Performance is Beyond Comprehension) ####   Excellent battery life ##  decent screen with IPS so good viewing angles ##  Lightweight aluminium top body ##  boots up and shuts down in seconds because of 8GB RAM and 512 GB SSD. AMD Radeon Graphics does the job well ##  can play light games. Soft and brisk touchpad. Overall a good package in the price. ####   Good ####   It's a complete waste of money product. Sound Volume and Quality is worst. Build quality is very basic. ####   Good laptop ##  6 core 12 thread's cpu with 8gb soldered ram ##  can be expanded upto 24gb  ##  slot for 2.5 inch hard disk / sata 2.5 inch ssd is given which can be installed upto 2tb ##  mounts are provided for that ##  1080p ips screen and backlit full side keyboard provided though backlit keyboard brightness can't be controlled ##  available for a lesser price ##  check acer online store or offline store. ####   just you look this laptop every things has been provide most important is that acer service centre. Today I have visited with my laptop to install external HDD. what a service just took 5 minutes. Manager Jogesh has tolled me due pandemic I am ready to send my technical staff in my resident. What more you want. Another best quality service of Amazon they have give me this ACER ASPIRE AMD RYZEN 5-5500U laptop within 04 days. Amazon hats off You. Its looks too Good and best keyboard minor sound supposed to be high. Otherwise every parts & function are too excellent. ACER Wishing you all the best . I was purchased first  laptop on  2007 it was Acer next two are HP now again I purchased ACER. ####   Good value for money. There’s only one s drawback - the speakers are not loud enough. ####    Value for money. ####   Good product 👍 but remember graphic card is only of 512 mb here so choose wisely with others ####   Best laptop ####   Ryzen 5 5500U is the best chipset you can find in the mid-range laptops which even gives a run for the money to Core i7 processors that being said major cons I found were - ####   Good laptop overall"},{"name": "\n\n\n\n\n\n\n\nASUS VivoBook 14 (2020) ##  Intel Core i3-1005G1 10th Gen ##  14-inch (35.56 cm) FHD ##  Thin and Light Laptop (4GB/256GB SSD/Office 2019/Windows 10/Integrated Graphics/Silver/1.6 Kg) ##  X415JA-EB312TS\n\n\n\n\n\n\n", "mrp": " ₹45 ## 990.00", "save": "\n\n\n\n₹9 ## 000.00 (20%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: 10th Gen Intel Core i3-1005G1 Processor ##  1.2 GHz Base Speed ##  Up to 3.4 GHz Turbo Boost Speed ##  2 Cores ##  4 Threads ##  4MB Cache # Memory & Storage: 4GB DDR4 3200MHz RAM ##  Upgradeable up to 12GB using 1x SO-DIMM Slot with ##  | Storage: 256GB M.2 NVMe PCIe SSD + empty 1x 2.5-inch SATA Slot for HDD/SSD Storage Expansion. # Graphics: Integrated Intel UHD Graphics # Display: 14-Inch (35.56 cms) LED-Backlit ##  FHD (1920 x 1080) 16:9 ##  220nits ##  NanoEdge bezel ##  Anti-Glare Plane with 45% NTSC ##  82% Screen-To-Body Ratio # Operating System: Pre-loaded Windows 10 Home with lifetime validity | Software Included: Pre-installed MS Office Home and Student 2019 # Design & battery: Up to 19.9mm Thin | NanoEdge Bezels | Thin and Light Laptop | Laptop weight: 1.6 kg | 37WHrs ##  2-cell Li-ion battery | Up to 6 hours battery life ;Note: Battery life depends on conditions of usage##", "no_of_rating": "49 ratings", "avg_rating": "4.1", "total_no_answer": "\n20 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "VivoBook 14 (2020)", "Brand": "ASUS", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "35.56 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 42 mins\n", "emi": true, "exchange": true, "five_star": "50%", "four_star": "32%", "three_star": "5%", "two_star": "5%", "one_star": "8%", "reviews": " ####    Very fast ##  slim ##  light weight ##  In this amount best laptop. Thanks Amazon. ####   We can't share the screen on monitor. ####   This is a decent machine with all the features required for an working professional just the sound is average... ####   NYC product ####   I like this product so much ####   Good item .... ####    Pros- ####   This is a wonder piece and perfect quality product. I recommend it fully. ####   It's a very good product at the price. Core i3 20th gen with 256gb SSD. ####   Good Laptop ##  Fast finger print sensor boots fast thanks to SSD ##  at this price range Good for basic day to day work. ####   Display ##  battery ##  design and quality is good as of now after 1 month of usage. ####   Light weight with great screen. Worth the price ####   Just go for this laptop.....as it is solid slim and thin laptop in this price range....just ignore everything nd go for it .....totally satisfied ####   no ethernet ##  no backlit keyboard ##  flickering screen ##  waste of money.... ####   Asus is not a customer oriented brand. They want to sell and then shut the doors. Make sure before submitting laptop to service center ##  pls ask them to open infrastructure of you. They will do some physical damage and they will tell not to give waranty. My laptop motherboard gone because of poor quality. They took laptop and after one day they said hdmi Port has physical damage  we can not give warranty . ####   Hiii its such really goob laptop pls chose this laptop for coding ####   good one.. booting time also fast.. inbuild ms office ####   Speed Performance is awesome.. sound average. Looks is good .. camera is bad ##  bad means bad. Plustic build..."},{"name": "\n\n\n\n\n\n\n\nDell 15 (2021) i5-1135G7 Laptop ##  8GB ##  1TB HDD + 256GB SSD ##  Win 10 + MS Office ##  NVIDIA MX350 2GB Graphics ##  15.6\" (39.61 cms) FHD Display ##  Carbon Color (Inspiron 3511 ##  D560585WIN9BE)\n\n\n\n\n\n\n", "mrp": " ₹86 ## 198.00", "save": "\n\n\n\n₹25 ## 208.00 (29%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor:11th Generation Intel Core i5-1135G7 Processor (8MB Cache ##  up to 4.2 GHz) ##  Memory & Storage: 8GB ##  8GBx1 ##  DDR4 ##  2666MHz | 256GB M.2 PCIe NVMe Solid State Drive (Boot) + 1TB 5400 rpm 2.5\" SATA Hard Drive (Storage) # Display:15.6-inch FHD (1920 x 1080) Anti-glare LED Backlight Non-Touch Narrow Border WVA Display # Graphics: NVIDIA GEFORCE MX350 2GB GDDR5 # Operating System & Software:Windows 10 Home Single Language | Microsoft Office Home and Student 2019 # 1x USB3.2 Gen1 ##  1x typceC ##  HDMI 1.4b ##  SD Card reader ##  Audio jack##", "no_of_rating": "28 ratings", "avg_rating": "3.7", "total_no_answer": "\n24 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 6\n", "Model": "INSPIRON 3511", "Brand": "Dell", "SpecificUses": "Student", "ScreenSize": "15.6 Inches", "OS": "Windows 10", "more_detail": "", "order_within": "\n            1 hr and 42 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   So it took nearly 3-4 hours to charge it completely and charge remains for a Max of 2 hrs.... WiFi was not working and was getting disconnected after every couple of mins... KeyPad heating issue... I guess if they can fix battery issue ##  it would be a killer... Returned this and bought HP pavillion.... Loving it.... ####   The laptop works properly first few days. The camera brightness flickers. The speaker is not working properly. The laptop suddenly stopped and I had to reformat it. All this and it's been less than a month ####   Good One. ####   The laptop is great because it crossed my expectations 🙂. The delivery was very delayed and took about 10 days to get delivered though I was assured 4 days from the date of order. It is booting up in seconds. Camera quality is just acceptable. It has good battery life and gets fully charged within an hour. Using it for attending online classes. Expecting a good warranty service  by DELL. ####   Don’t have Rj-45 port ##  1 USB port missing ##   heating issue ##  poor battery backup ####   For now ##  3 stars. Lightweight laptop. Fast enough. Clear display. Good buy though considering I got discounted price & HDFC Imperia card points during recent sale. ####   All ok but heating problem is there and it's not 4.2 GHz it's only 2.4 GHz amazon doing  people fools ####   As expected ####   best laptop withh low price and speed is nice and this battery backup is nice and the laptop backup is nice also. ####   The laptop configuration was good. It's been 2 days of usage primarily for browsing ##  light gaming and media streaming. I know this might not be the best in the range when it comes to value for money ##  but DELL is DELL. Anyway if you want something more powerful give this dell laptop a try amzn.to/3B8q56o"},{"name": "\n\n\n\n\n\n\n\nLenovo ThinkPad E15 (2021) Intel Core i5 11th Gen 15.6-inch (39.62 cm)FHD Thin and Light Laptop (8GB RAM/512GB SSD/Windows 10/MS Office/Fingerprint Reader/Black/Aluminium Surface/ 1.7 kg) ##  20TDS0GA00\n\n\n\n\n\n\n", "mrp": " ₹76 ## 915.00", "save": "\n\n\n\n₹3 ## 925.00 (5%)\n\n\n\n\n\n\n\n", "price": null, "about": "#ThinkPad Reliability tested on 12 MIL-STD-810H Methods and 22 Procedures | Body Material: Aluminium (Top) | Built to withstand rugged usage and can handle accidental knocks ##  drops ##  and even spills # Processor: 11th Gen Intel Core i5-1135G7 processor ##  2.4 Ghz base speed ##  4.2 Ghz max speed ##  4 Cores ##  8 Mb Smart Cache | Memory: 8GB DDR4 3200 MHz ##  Upgradable upto 32GB | Storage: 512GB SSD M.2 # Operating System: Pre-loaded Windows 10 Home with lifetime Validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Pre-installed software: Microsoft Office Home & Student 2019 # Display: 15.6-inch (39.62 cm) screen with (1920X1080) Full HD Antiglare Display | Graphics: Intel UHD Graphics | Monitor Supports: Supports up to 3 independent displays | TÜV Rheinland Low Blue Light certified # Ports: 1x USB 2.0 ##  1x USB 3.2 Gen1 (Always On) ##  1x Thunderbolt 4/USB4 40Gbps (support data transfer ##  PD 3.0 & DP 1.4) ##  1x HDMI 1.4b ##  Ethernet RJ-45 (LAN Port) | Headphone/microphone combo jack | Audio: Realtek ALC3287 codec ##  Stereo speakers ##  2W x2 ##  Dolby ##  HARMAN-branded # Camera: 720p ##  with privacy shutter | Microphone: Dual array microphone | Keyboard: 6-row ##  spill-resistant ##  Backlit ##  multimedia Fn keys with Unified Communications ##  ltraNav: TrackPoint pointing device and Mylar surface multi-touch touchpad controls # Connectivity: Wireless-AC 9560 ##  802.11ac Dual Band 2x2 Wi-Fi + Bluetooth 5.1 | Security: Discrete TPM 2.0 | Physical Lock: Kensington Security Slot | Touch style fingerprint reader on power button | Design: Thin & Light ##  180 Hinge##", "no_of_rating": "124 ratings", "avg_rating": "4.2", "total_no_answer": "\n31 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "Thinkpad E15", "Brand": "Lenovo", "SpecificUses": "Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            7 hrs and 57 mins\n", "emi": true, "exchange": true, "five_star": "52%", "four_star": "29%", "three_star": "8%", "two_star": "3%", "one_star": "7%", "reviews": " ####   Nice laptop  ##  working is fine ####   Good laptop ##  delivered with good packing ##  performance good so for after two weeks of usage. Value for money. ####   Master of all Laptops .... ! ( Non-Apple ;) ) ####   My display was spoiled within a month of usage ##  but got a free replacement in 5 days. (But this depends on regional service centers) ####   I have purchased Laptop with out interest EMI while I am getting interest on my card. It is cheating with customer. Please look into this matter. Battery life is also not good. ####   Nice product! value for money. Got whatever said in description. But as it always was: Lenovo needs to work on laptop's hinges design. I can say from my previous experience with g5070 ##  these hinges won't last longer than 4-5 years. Some people are bragging about the warranty start date here: you need to send the invoice to lenovo pop to update your purchase and then your warranty gets updated. ####   Stopped working within a span of four months. We shocked to find this fact. Power light is 'ON' with absolutely no display on the screen. Amazon & Lenovo..... please ####   Attracts Finger prints ####   Laptop is good for day to day use ##  however ##  viewing angle of display is very poor as its not IPS. Battery life is also normal ##  not long hours as mentioned in description. ####   Been using a Lenovo for the last 14 yrs and then upgraded it....been loving it for the last 2 months but today suddenly the mic stopped working when I play music during a zoom meeting using external speakers and it stopped playing now....and when I call the call centre or any other number I am getting little help and they are asking to call the place you bought it from which does not makes sense....in other words....service is a problem ####   I purchased this laptop two months back and till now haven't face any issues but only thing which I come to know later on regarding RAM upgrade. It's doesn't have option for upgrading your ram from 8GB to 16GB plus brightness is not that great compared to other Thinkpad laptop ####   It is a good product but I am disappointed with battery life as it is 4-5 hours only..not 14 hours. ####   Best configuration available at this price. Works perfectly fine. ####   Never buy this laptop ####   Pros: look ##  battery life ##  weight ##  user experience ##  sound quality ####   Pathetic experience with Lenovo.. after using only one month lots of hardware and software problems are found. Their customer service is also very bad and inactive. I have contacted with their premium support many times..till my problems have not solved yet. They will only tell you to send mails about your problems..but you will get not a single response from their side.. don't go for Lenovo in this price you will get far better company's laptop than Lenovo.Just waste of money ####   I bought this product for personal use and it's great and I love it . The weight of the laptop is not too heavy and it's just perfect  ##  it boots up very fast as soon as you open the lid when it's locked. Even when you open it for the first time it boots up fast and the setting up is very easy. There is a red button in the middle of the keypad and it can be used as a mouse and it's very fun to use. Totally recommend this laptop . ####   ThinkPad is always one of my favourite laptop. Even though I don't own one (I wish I could) I can guarantee you guys this will not make you feel bad for buying because it's worth the money. It's light weight for of course and with an industry leading performance. This may not be that good for gaming but for business as well as student purpose it blows your mind. I'm really impressed of every ThinkPad because it's one of a kind. It's processor itself is mind blowing and give you a lag free environment. I wish I could get one. Even though I don't own one I used it for a week and I was super excited. You guys should really try it because it makes you happy day by day. It's also easy to carry and handy too with fingerprint sensor and fhd screen. Don't ever miss this laptop. ####   Best product ####   Laptop’s mother board crashed in 15 days. ####   Value  for money.... ####   I was looking for a slim ##  light weight laptop with legit ms office. I also wanted to keep it for some 5-6 years. Finally ##  after lots of research ##  I choose Thinkpad 14\" with i5 ##  8GB RAM with SSD SATA disk. This laptop ticks all the boxes in my list. ####   The laptop has a remarkable build quality ##  a very good keyboard and a handy ##  lightweight design. Performance is too ##  very good. I have been using it for 4 days now and have completely utilised the laptop to it's fullest by now. Have installed all software I use and also typed a lot of pages of a document. Feels tireless to type on the Chiclet Keyboard. ####   Laptop’s performance exceeds expectations. ####   Nice laptop ####   I am using Alienware and it was tooo heavy for me to carry alienware 17 everywhere. so i was waiting for Thinkpad (sale/offer) i ordered thinkpad e15 (15.6) and it was my best decision rather than going to any other product. now i am using it in my roaming work with all the capabilities which alienware was giving. ####   Less price & Best configuration ####   Value for money ####   Absolutely brilliant and professional way of delivery. The packing is amazing. The laptop is brilliant on display. I was able to set it up in 15-30 min all by myself or you can use speech assistance which is helpful. Make sure to plug in first to and switch on the power supply and the wifi connection is active to perform all the needed steps. Day 1 with this product is delightful . Sound quality and bluetooth connection also checked and both are brilliant"},{"name": "\n\n\n\n\n\n\n\nAcer Aspire 5 AMD Ryzen 5 5500U Processor 15.6 inches Business Laptop - (8 GB/512 GB SSD/Windows 10 Home/Radeon Graphics /Microsoft Office 2019/1.76 kg/Silver) A515-45\n\n\n\n\n\n\n", "mrp": " ₹64 ## 990.00", "save": "\n\n\n\n₹6 ## 550.00 (10%)\n\n\n\n\n\n\n\n", "price": "₹58 ## 440.00", "about": "#This laptop packs a punch in terms of performance as it comes with an AMD Ryzen 5500U processor . It not only gives you enough power to seamlessly tackle your work-related tasks but also keeps you entertained as you can play games ##  watch movies ##  and do more. # 15.6\" Full HD (1920 x 1080) IPS Widescreen LED-backlit Display | AMD Radeon Graphics # 8 GB of onboard DDR4 system memory ##  upgradable up to 24 GB of DDR4 system memory # 512GB NVMe SSD  ##  also supports up to 2 TB 2.5-inch 5400 RPM # Includes Microsoft Office 2019##", "no_of_rating": "79 ratings", "avg_rating": "4.5", "total_no_answer": "\n104 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 20\n", "Model": "A515-45", "Brand": "Acer", "SpecificUses": "Creative, Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   The numbers mentioned in the website doesn't work. Chat facility is a waste of time. It's terrible support. 8GB RAM is a joke and I was expecting that I will be able to upgrade it. Looks like it will be difficult to do it via acer services. So ##  bought a RAM with exact specifications online and installed it myself. Warranty will be difficult for sure. ####    Product is awesome ##  light weight and looks very good specially in reallife ####   Very slim lapy and the processor is awesome....... Just go for it ####   Not Good Product of Acer Aspire 5 AMD Ryzen 5 5500U Processor ####   Excellent battery life ##  can easily last upto 10hrs. ####   Great product ## fully satisfied ####   Merits ####   Recently i bought perfomance good 🌹🌹🌹 ####   Great laptop with very high quality screen ## the battery life is around 7 hrs and the trackpad is just excellent ####   Can't return now. Bad product ####   I am sharing this review after purchasing laptop from local shop where I get best deal.. here are some genuine reason why you with pros and cons.. ##  ####   Good Battery life ##  snappy performance (any time I had minimum 15 chrome tabs open along with 3-4 other apps. No lag. ####   Everything is awesome good for students and little gaming and it has and issue i face when i was updated the update  ## The battery percentage from 100% it went to 25% in half an hour and the speakers are shit better get a pair of earphone ####   I love all over design of laptop thin and lightweight and performance of this laptop is unbelievable its full fill my all requirements but price range higher because when we see on acer official website price are low and always show out of stock over all acer doing very well in term of body we got aluminum top and backlit keyboard ####   We had purchased for our son and he just loved using the laptop for everyday use ##  Coding ##  watching videos ##  attending webinars and attending his classes online. The battery backup is amazing and the Laptop overall is just awesome. No issues as of now connecting to Wifi 2.5 ghz/ 5 ghz band. Since we have Airtel broadband the Wifi autoconnects to highest 5 ghz band and is super fast. Laptop opens up super fast and depends on if we have configured any login password or personalised photos/background during Laptop login page ##  based on which little difference may be seen but overall great processor for faster access to anything to be done with this laptop. Not has an opportunity to contact ACER for any issue as Laptop is working great. Thank You. ####   Very sleek...light weight...very fast... ####   Used it for a week and.... ####   Product as mentioned ####   I was eyeing for this laptop since its announcement. ####   Speaker and camera ####   I found this Laptop on ACER and Croma site at night for 53K and 52K. Being sleepy ##  I left it and next morning it was out of stock on both. Then I bought it on Amazon for 56K less 1K discount for HDFC card. ####   Everything's great in this machine. ####   Amazing display ##  good battery backup ####   The 5500U is ##  to slightly put it ##  ABSOLUTELY BONKERS ##  Gives even the Current Generation i7s ##  (dare I say i9s) a run for their money. Compiles the entire Linux kernel in under a minute (If you don't know what that means ##  let me tell you its Performance is Beyond Comprehension) ####   Excellent battery life ##  decent screen with IPS so good viewing angles ##  Lightweight aluminium top body ##  boots up and shuts down in seconds because of 8GB RAM and 512 GB SSD. AMD Radeon Graphics does the job well ##  can play light games. Soft and brisk touchpad. Overall a good package in the price. ####   Good ####   It's a complete waste of money product. Sound Volume and Quality is worst. Build quality is very basic. ####   Good laptop ##  6 core 12 thread's cpu with 8gb soldered ram ##  can be expanded upto 24gb  ##  slot for 2.5 inch hard disk / sata 2.5 inch ssd is given which can be installed upto 2tb ##  mounts are provided for that ##  1080p ips screen and backlit full side keyboard provided though backlit keyboard brightness can't be controlled ##  available for a lesser price ##  check acer online store or offline store. ####   just you look this laptop every things has been provide most important is that acer service centre. Today I have visited with my laptop to install external HDD. what a service just took 5 minutes. Manager Jogesh has tolled me due pandemic I am ready to send my technical staff in my resident. What more you want. Another best quality service of Amazon they have give me this ACER ASPIRE AMD RYZEN 5-5500U laptop within 04 days. Amazon hats off You. Its looks too Good and best keyboard minor sound supposed to be high. Otherwise every parts & function are too excellent. ACER Wishing you all the best . I was purchased first  laptop on  2007 it was Acer next two are HP now again I purchased ACER. ####   Good value for money. There’s only one s drawback - the speakers are not loud enough. ####    Value for money. ####   Good product 👍 but remember graphic card is only of 512 mb here so choose wisely with others ####   Best laptop ####   Ryzen 5 5500U is the best chipset you can find in the mid-range laptops which even gives a run for the money to Core i7 processors that being said major cons I found were - ####   Good laptop overall"},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 5 AMD Ryzen 5 5500U 15.6\" (39.62cm) FHD IPS Thin & Light Laptop (8GB/512GB SSD/Windows 10/MS Office/Backlit Keyboard/Fingerprint Reader/Graphite Grey/1.66Kg) ##  82LN00B4IN\n\n\n\n\n\n\n", "mrp": " ₹78 ## 290.00", "save": "\n\n\n\n₹22 ## 300.00 (28%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: 5th Gen AMD Ryzen 5-5500U | Speed: 2.1 GHz (Base) - 4.0 GHz (Max) | 6 Cores | 8MB Cache # OS: Pre-Loaded Windows 10 Home with Lifetime Validity # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM DDR4-3200 | 512GB SSD # Graphics: Integrated AMD Radeon Graphics # Display: 15.6\" Full HD (1920x1080) | Brightness: 300 nits | Anti-Glare | IPS Technology##", "no_of_rating": "4 ratings", "avg_rating": "3.6", "total_no_answer": "\n3 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery", "Model": "IdeaPad 5 15ALC05", "Brand": "Lenovo", "SpecificUses": "Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows® 10 Home 64, English", "more_detail": "", "order_within": "\n            1 hr and 41 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   This one is really a powerhouse with great capabilities. The ryzen processor inside does good job working with multiple tasks ####   Superb design with great AI features ....no other brands come with this kind of technology....great gesture by Lenovo..even they are providing 1year ADP as well .....will give full marks to Lenovo for design features build and awesome battery life"},{"name": "\n\n\n\n\n\n\n\nMSI GF75 Thin ##  Intel i7-10750H ##  17.3\" FHD IPS-Level 144Hz Panel Laptop (8GB/512GB NVMe SSD/Windows 10 Home/Nvidia GTX1650 4GB GDDR6/Black/2.2Kg) ##  10SC-087IN (9S7-17F612-087)\n\n\n\n\n\n\n", "mrp": " ₹95 ## 990.00", "save": "\n\n\n\n₹24 ## 000.00 (25%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 10th Generation Intel Core i7-10750H Up To 5 GHz # Operating System: Pre-loaded Windows 10 Home with lifetime validity |Preinstalled Software: MSI BurnRecovery ##  MSI Battery Calibration ##  MSI Help Desk ##  Norton Internet Security (trail 60days) Norton Studio (Metro) (permanent free) ##  Nvidia GeForce Experience ##  Nahimic 3 ##  Dragon Center | In the box: Laptop ##  adapter # Display: 17.3\" FHD (1920*1080) ##  IPS-Level 144Hz Thin Bezel ##  45% NTSC # Memory & Storage: 8 GB DDR4 3200MHz RAM ##  expandable to 64 GB | Storage: 512GB NVMe SSD. # NVIDIA GeForce GTX1650 GDDR6 4GB Dedicated Graphics # Ultra Thin and light design | Laptop weight: 2.2 kg # Keyboard: Steelseries RED Backlit Keyboard | Camera: HD type (30fps@720p) | Microphone: Built-in microphone##", "no_of_rating": null, "avg_rating": null, "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "GF75 Thin 10SC-087IN", "Brand": "MSI", "SpecificUses": "Multimedia, Student, Gaming", "ScreenSize": "44 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 26 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nDell Vostro 3400 14\" (35.56 cms) FHD Anti Glare Display Laptop (11th Gen i5-1135G7 / 8GB / 1TB / Integrated Graphics / Win 10 + MS Office / Black/ 1.58Kg) D552154WIN9BE\n\n\n\n\n\n\n", "mrp": " ₹56 ## 126.00", "save": "\n\n\n\n₹3 ## 136.00 (6%)\n\n\n\n\n\n\n\n", "price": "₹52 ## 990.00", "about": "#Processor: 11Th Generation Intel Core I5-1135G7 Processor (8Mb Cache ##  Up To 4.2 Ghz) # Memory & Storage:8Gb Ram | 1Tb 5400 Rpm 2.5\" Sata Hard Drive # Display:14.0-Inch Fhd (1920 X 1080) Anti-Glare Led Backlight Narrow Border Wva Display # Graphics: Intel Iris Xe Graphics With Shared Graphics Memory # Operating System & Software: Windows 10 Home Single Language | Microsoft Office Home And Student 2019 # I/O Ports: Two Usb 3.2 Gen-1 ## One Usb 2.0 ## One Rj45 ## One Sd Card Slot  ## One Hdmi 1.4 Port # Hard Disk Size: 1.0 Tb##", "no_of_rating": "143 ratings", "avg_rating": "3.4", "total_no_answer": "\n67 answered questions\n", "delivery_type": "Details", "delivery_date": "\n\nWednesday, Oct 6\n", "Model": "Vostro 3401", "Brand": "Dell", "SpecificUses": "Personal", "ScreenSize": "14 Inches", "OS": "Windows 10", "more_detail": "", "order_within": "\n            7 hrs and 56 mins\n", "emi": true, "exchange": true, "five_star": "40%", "four_star": "21%", "three_star": "4%", "two_star": "9%", "one_star": "26%", "reviews": " ####   The sleek & compact body renders efficient handling; the downside is that it's a power guzzler - needs frequent charging. ####   Don't buy this product. It's performance is not great. ####   Very very slow ####   I am writing this as my one-year warranty expires today. I spent most of the year talking to tech support because this laptop is garbage. I am writing today because ##  once again all the programs are hanging ##  a sudden black screen comes out of nowhere. This is not even fit for regular surfing. Even VS code doesn't work properly. It takes almost 8 to 14 minutes for this laptop to boot up and another 15 minutes just to hover the mouse upon boot-up. Those tech support guys tell you that you are lying and wasting their time. Guess what ##  I am wasting my time ##  indeed! Poorest tech support. Poorest problem-solving. Poorest everything. After almost seven months of listening to dell ##  they redirected me to Microsoft ##  after which my laptop was compromised of some basic-unessential start-up tasks and all that to get it to work without hanging. Is that what this i5 processor is all about? Even after that it's still not working properly. Waste 50K bucks I have ever spent. NOT JUST THIS ONE LAPTOP ##  DO NOT BUY FROM DELL EVER! BECAUSE THEY GOT THE WORST PEOPLE ##  WHO TREATS YOU VERY VERY BADLY. I WILL UPLOAD THE RELEVANT VIDEOS WHEN I CAN. DO NOT BUY FROM DELL. No Dell. ####   Laptop speed is slow ... It's getting stuck ..taking more times for open and speed is not good ... Pls 🙏 don't purchase this laptop ..bad experience this lappi ####   Good.. So far. ####   Very slow processing please don't buy it. ####   Poor quality and never advised for this product. With the same cost lots of peer companies give good quality product. ####   Its very slow ####   Not worth money. The laptop didn’t boot up after 4 long hrs of installation. The product will only be replaced & no returns accepted and every time after replacement the customer should pay installation charges which costs around 800 bucks. Ideal to buy expensive items at authorised stores. ####   I totally dislike the product ....It is worked properly about one week.....And then it is totally started misbehaving like very slow and Not responding any Apps....So don't buy this laptop ####   Excellent ####   Lapton runnig very slow down ##   itsnot a original product ##   please retun this product and replace other product... its my request. ####   Performance is too slow ####   This product makes too much noise if the fan which is strange as well as there is no easy replacement policy of this product. ####   My daughter has been using it from last few week for her online classes. ####   Dnt buy this laptop ##  waste of money ####   Guys ##  please don't buy this..i3 processor is far better than this.  @Dell please recall this product back ASAP ####   Very slow to boot up and also slow while loading applications ##  frequent firmware updates(every two days) and have done at least 3 times since I bought it in a space of one week. The laptop shows a blank dark screen after reboot and then i need to shut down and restart again multiple times. Frustrated after a week's use and returning the product. ####   The system is good and méets the requirements. ####   Nice laptop very good speed ## battery backup is also very good. Good buy this laptop. ####   Good ####   It is good laptop ##  but a little costly than earlier purchased of same configuration. ####    Laptop performance is very bad. Restart takes more than 25mins. Was excited when received it but unhappy with the product. Wasted my one weeks time  waiting for it. Returning it. ####   Dont buy it ##  waste Rs50000 . ####   Laptop is very slow. ####   It’s creating problem every now and then. I will  not buy laptops from Amazon in future. ####   I like it's build quality ##  display ## camera  ##  but because of 1tb HDD speed is little bit slow but acceptable. Good for gaming intact higher gaming but the hot winds coming out position can be improved. ####   Worse Laptop I have ever seen ##  not worthy product even system was not fast even it's don't have any data. Don't put investment on this laptop. ####   Waste of money. ####   Laptop is compact.  Right  size. Worth the money ####   This doesn't seems to be i5 . Very very slow ...without any application it's slow like this what will happen when I will install other applications and software ####   The system speed is extremely slow. I made a complaint on 25th Feb. I was told that system will be replaced within 48 hours. It is already more than one week but my system has not been replaced. ####   Horrible ##  Nightmare ##  after receiving the screen went off ##  OS problematic ##  Mother Board defective. The  company policy says no replacement of laptop. Stay away or buy if you really want to drain some hard earned money. ####   Ordered this product from amazon as dell categories this model under business and delivery time is 1 month. So went with high end config of I5 ##  11th Gen ##  8GB mem and 1TB HDD but it was very shocking package received was damaged and box was already opened or used. The performance of the product is very poor and it take long time to show-up the login screen and any application performance is very bad. Also extending the dell warranty is nightmare as there is no response from Dell for this product finally the quote was quite higher than the original purchase E.g if you order thru dell extending additional 2 year of warranty is around 1999 but if you do it separate it cost around 5000 . So purchased additional 500GB of WD NVME and made the system boost ending up spending 55k for this product without extended warranty which is quite expensive for this model ####   Getting err on windows and disk show 100% and memory also showing 100 %.. Not upto mark. Not recommended. Choose better one ####   The laptop provides a good specification but they are really cheap and inefficient. To consider an example the Core i5 11th generation performs poorly than a Core i5 8th generation. The HDD also performs really bad especially while booting. The booting time varies between 2 mins to 5 mins. That's too long considering the pace of technology and the price of the product ##  almost 50k. It's sad that Dell is producing cheaper thousands of cheaper ##  worthless variants in the market rather than used to have a couple of awesome variants in past. So ##  be careful while buying ##  and DO NOT BUY THIS ONE. ####   Very slow . ####   Piece is defective. Send query for replacement. ####   Purchased this Laptop last week and not happy with performance. ####   Good features quite fast battery backup is also sufficient and enough. Can be a better option for anyone below 50k ####   I received a faulty laptop first ##  then I spoke with Amazon executive and they helped me to get an another one as replacement \"Thanks Amazon\". It's been less than a week since i have been using this laptop ##  so far i don't see any issues and works fine as described & expected. The battery backup is very good and look wise also it's good. ####   Good"},{"name": "\n\n\n\n\n\n\n\nLG Gram Ultra-Light 11th Gen Core i7 ## 16 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  16-inches (40.64 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.19 kg ##  3 Yr Warranty (16Z90P-G.AH75A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 45 ## 000.00", "save": "\n\n\n\n₹52 ## 710.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Core i7-1165G7 (2.8 GHz ##  Turbo up to 4.7 GHz ##  L3 Cache 12MB ##  28W)- Window 10 # Display: 16\" (40.6 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 16 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.19 Kg Magnesium Alloy - 80 Wh Battery with 16.5 hr back-up (* MobileMark 2018)##", "no_of_rating": "29 ratings", "avg_rating": "4.4", "total_no_answer": "\n20 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "16Z90P-G.AH75A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "16 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 41 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   I bought LG gram 14\" 1035G7 two days before. Battery backup is of 7:30 Hr only and the company is claiming for 18:30 Hr. Now no feedback policy available and the product also removed and I can not see my own purchase in my app. Totally dissatisfied. It like company wanted to liquidate this product and once it was liquidated run away kind of thing is here. Need assistance ####   My spouse got one of these three years ago ##  and this year I got one for me and another for my dad. It's the best work laptop simply because of how light it is. Less than a kilo ##  and looks like it too. And it is a rugged beast as well - the better half's laptop has survived many a fall without complaints ##  safe a few minor dents. ####   Just one line ##  I'm lovin' it. Got it for 93k.. value for money.. best battery backup ever.. excellent display.. for the work I do ##  due to 16:10 aspect ratio ##  I don't even have to scroll up n down.. makes  work very simple and fast.. I'm hoping this will last for atleast 4-5 yrs ##  considering the build quality.. ####   I'm really blown away when read about LG gram laptop. ####   There are options to upgrade the ssd and RAM ##  i upgraded the ssd ##  overall laptop is fulfilling all my requirements and the battery life is marvelous. ####   My brother Karan Arora recommended this laptop... It was unaffordable but he still managed to make me buy it 😁 ####   if you are in the market for laptop and your requirement is good battery backup with excellent screen then no one come close to LG Gram series. I was confused between Fujitsu UH-X and LG GRAM 16 but both laptops have pros and cons and ultimately I chose LG GRAM over UH-X. Advantages over UH-X are as per below : ####   I bought it on June 13 2021 at the price of 57K on during Amazon Great Deals. Light weight beast as Machine from LG with atleast 12-13 hours battery backup . Hats off to R&D team. ####   Its superb ####   The laptop came in excellent package - the package itself spells the quality and care shown by the makers LG towards their product - unlike all those makers like ASUS or DELL ##  this one was premium. Everything was neat and clean. The pc is incredibly light - if you look at the photos you'll understand. It looks like a 13\" laptop ##  though it's 15 inches! ####   Ordered it a few days ago in the Amazon sale and got a great deal. Purchased it at 61k in Exchange for my lenovo."},{"name": "\n\n\n\n\n\n\n\nDell Vostro 3400 14\" FHD Display Laptop (i3-1115G4 / 8GB / 256GB SSD / Integrated Graphics / Win10 + MSO / Black) D552190WIN9BE\n\n\n\n\n\n\n", "mrp": " ₹43 ## 239.00", "save": "\n\n\n\n₹2 ## 249.00 (5%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: 11th Generation Intel Core i3-1115G4 Processor (6MB Cache ##  up to 4.1 GHz) ##  Memory & Storage:8GB ##  4Gx1 ##  DDR4 ##  2666MHz |256GB M.2 PCIe NVMe Solid State Drive (Boot) # Display:14.0-inch FHD (1920 x 1080) Anti-glare LED Backlight Narrow Border WVA Display # Graphics:Intel UHD Graphics with shared graphics memory # Operating System & Software:Windows 10 Home Single Language | Microsoft Office Home and Student 2019 # I/O ports: 2x USB 3.2 Gen-1 ##  1xUSB 2.0 ##  1xHDMI port ##  1xEthernet port ## 1x Headset jack ##  1xSD Media Card Reader##", "no_of_rating": "14 ratings", "avg_rating": "4.3", "total_no_answer": "\n13 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "Vostro 3400", "Brand": "Dell", "SpecificUses": "Personal", "ScreenSize": "14", "OS": "Windows 10", "more_detail": "", "order_within": "\n            1 hr and 41 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   Everything is Super Fast. ####   Every other thing is good... Its just the battery life... Which is on the low side. But it is workable. ####   On Amazon sheet specification is Processor Speed ‎4.1 GHz and Actual Received  3GHz ####   It's average quality product. Build Design is poor ##  processor is i3 11th gen need more optimization. ####   A bit expensive ##  but best in this range. Running very smoothly ##  no lags or shuuter whatsoever. 11th gen i3 with 8 gb RAM and ssd drive. Battery life approx 4 hours ##  camera quality is relatively poor. ####   Power backup only 3 hours while watching videos"},{"name": "\n\n\n\n\n\n\n\nASUS VivoBook 14 (2020) Intel Core i3-1005G1 10th Gen 14 inches FHD Thin and Light Business Laptop (4GB RAM/1TB HDD/Windows 10/Integrated/Slate Grey/1.6 kg) ##  X415JA-EK104T\n\n\n\n\n\n\n", "mrp": " ₹42 ## 990.00", "save": "\n\n\n\n₹12 ## 000.00 (28%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: 10th Gen Intel Core i3-1005G1 ##  1.2 GHz Base Speed ##  Up to 3.4 GHz Turboboost Speed ##  2 cores ##  4 Threads ##  4MB Cache # Memory & Storage: 4GB onboard DDR4 3200MHz RAM ##  Upgradeable up to 12GB using 1x SO-DIMM Slot with | Storage: 1TB HDD 2.5-inch SATA 5400RPM with empty M.2 2280 Slot # Graphics: Integrated Intel UHD Graphics # Display: 14-Inch (35.56 cms) LED-Backlit ##  FHD (1920 x 1080) 16:9 ##  220nits ##  NanoEdge bezel ##  Anti-Glare Plane with 45% NTSC ##  82% Screen-To-Body Ratio # Operating System: Pre-loaded Windows 10 Home with lifetime validity # Design & battery: Up to 19.9mm Thin | NanoEdge Bezels | Thin and Light Laptop | Laptop weight: 1.6 kg | 37WHrs ##  2-cell Li-ion battery | Up to 6 hours battery life ;Note: Battery life depends on conditions of usage##", "no_of_rating": "540 ratings", "avg_rating": "3.6", "total_no_answer": "\n110 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "\n\n\nTomorrow", "Model": "VivoBook 14", "Brand": "ASUS", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "14 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 41 mins\n", "emi": true, "exchange": true, "five_star": "42%", "four_star": "22%", "three_star": "11%", "two_star": "5%", "one_star": "20%", "reviews": " ####   The laptop is very slow and doesn't work well from very first month ####   Worst experience ##  bad speed quality ##  too slow in using in less then one month ##  least support from asus company even the Amazon denied to help any positive help due to their electronic return policy. Suggest not to purchase with this configuration. ####   The system is very slow. It takes an eternity to boot up. Very poor performance. Not at all satisfied. ####   Always hang ####   Dislike ####   Loved the product... It's been one month since I am using it and I am greatly satisfied. ####   Value for money with great specifications it offers. I wish battery life could have been better. ####   not working (@ ) points ####   Its good for normal works ##  easy to handle ##  browsing ##  office works etc.. depends on your usage...go for it..this is the  second time i purchased the same. You will not regret it ####   I didn't like the performance and the screen quality is very bad ...in 2021 we still getting monitor screen in this price range it should al least have ips display. ####   Super laptop this price range ####   Fast ##  good looking ## small ## slim ## easy to handle ## light weight ## good battery life ##  average sound  ##  average camera. It takes nearly 4 seconds to boot up. Always go for SSD. It has a additional SATA slot for SSD or HDD . you can insert HDD or SSD later for more storage. And the packing was awesome.Any way I loved it and recommend for you. ####   Overall bad experience ####   first laptop look is good figure security i like this but when you purchase laptop is too slow browsing also so slow and hanck after 1 week use laptop all problems solve i dnt know how know everything its good ####   Good machine with windows and office home 2019 included. ####   good product in this price range . Primary motive is for children's online studies and it fits well . ####   Screen quality is good. ####   I would like to review in these topics:- ####   add ssd to it i wilk work properly there are few cons too there must me ethernet port in it n camera must be of good quality ####   Liked the color ####   Poor battery life. Slow processor. Stupid product. When I called up customer service for return they directly refused and said it can only be replaced. This is forcefully selling products. I hate this ####   Product came with several marks on the body as though it's a used product ####   Not for multitasking...even single window operations are so slow ####   Good quality ####   इतनी घटिया स्पीड आज तक नहीं देखी ##  अटक अटक के चलता ब्राउज़र तो जान ही निकाल लेते है । कुछ भी खोलो बहुत देर से खुलता है । ####   At 35000 u r getting almost the latest gen processor (i3 10th gen) pared with m.2 nvme ssd ( an empty 2.5-inch SATA slot for hhd/ssd) and 4GB ddr4 3200 MHz ram (which is upgradeable up to 12GB using 2nd slot)with Asus badge which is not available in this price bracket. Basis tasks are very smooth with this processor ##  obviously ##  u cannot play GTA 5 with this integrated GPU. Fast charging can fuel it up under 2 hrs and it can give u 5hrs + battery life. Also ##  this laptop comes with a fingerprint sensor and is very lightweight to carry. Also ##  it will get windows 11. Plus the display quality and speaker outputs are good considering the price. The thermals are great. So without any hesitation go for the laptop ####   Pls don't go with this product. Purchased for minimal office work like ms office. But it's very very slow. Hang every often. Immediately tried to return and planned to go with some other model. But the wrost thing is ##  this product doesn't have return option. Only replacement. So tried that also but the other one also having the same problem. Now the laptop is lying idle in my office. ####   Very slow ##  don't buy ####   Worst product ####   Nice product. ####   Cans some one lease suggest if I can exchange this laptop with tablet  online..any option ####   Don't Switch on ####   Too Much Heating and Not working in 15 Days Wrost Laptop ####   Very bad .gets hanged. Very slow. Never purchase online ####   Please do not buy this ####   Too slow.....takes 10mins to boot ####   It is very very slow laptop. It is 3 to 4 times slower that the one purchased 5 years ago at 25000/- cost. ####   The laptop is extremely slow even for very basic tasks like browsing the internet. It take 5 minutes for Google Chrome to open and each time you open a new tab ##  the whole screen freezes for a few minutes. When we bought the product we could find return or replacement option but when we contacted customer care for return ##  he says its against policy. Why do you create such impression before for customer and trap customers to buy the product which is useless. Please be clear on the details page and do not put wrong information to sell the product. Different customer care representative say different things. One said I have placed return ##  and we waited till last day of elegy timeline of return request and called again to recheck ##  this time customer care says we cannot return even though it's still showing me return option. Please stop this. Please be careful and alert. ####   Very nice product specifically for students.. Performance/sound quality /picture quality very good ## Premium looking also. However touch pad not working but easyly replace product with new one. Thank u amazon service for save my time and quickly replace ####   Loading time is up to 2:00 very slow and I tried to play Minecraft but I am lagging and getting 15-10 fps my money is gone please don't buy this Dump. ####   Laptop was very slow ##  it had some hard disk issue which was difficult to prove. Tried to schedule technician visit twice but nobody showed up could be beacuse or pandemic lockdowns but alot of confusion in the process. ####   Very slow laptop. No option to return as well. Dont buy. ####   Product is good performance till now but average battery life ##  this product  camera quality is  means 4/10 ####   Laptop comes with WD SN530 256GB NVMe ##  with additional 2.5inch hdd/ssd slot with kit included in box. Comes with fingerprint sensor. Screen quality is anitglare matt FHD 1920x1080 delivering decent quality. The RAM here is 4gb DDR4 3200MHz soldered in the board. Additional socket is there to expand ram. ####   Clearite ####   Slow as hell ####   Worst product doesn’t work waste for money ####   One of the worst laptop. I had a 10yrs  old dell laptop which was a basic one but much better. Very very slow. ####   Very bad product ####   Good laptop in this price range ##  little slow but I upgraded RAM to 8gb and upgraded 256gb SSD ##  now it is surprisingly fast ##  it takes only a few seconds to boot. ####   Working very slow ##  already raised complaints but still not received any positive outcome ####   Horrible product and horrible service! Do not buy this product. They don’t even give the warranty. The service expert was supposed to come to check the laptop and I kept following up - he just didn’t turn up. He said get the RAM extended at the Asus service centre which is in some remote part of the city. I got the RAM extended - laptop is still slow. Even chrome doesn’t work properly! I might have to throw it because nobody will even buy a slow second hand laptop! ####   Bahut hi achha laptop 💻banaya hai asus ne mai ese pa kar khush hu ####   The laptop is extremely slow even for very basic tasks like browsing the internet. It take 5 minutes ####   It don’t have Microsoft office configured. We need to buy license or use office 360 app if limited usage.. ####   We have purchased the 5 laptops for our employees ##  received a negative feedback about the performance and its take long time to start - its about 20 minutes ##  they returned the laps. Disappointed with the performance. ####   I have added an additional SSD. After installing SSD it is working fine. Little issue with the charger. Remaining working fine. ####   Within 2 months the speaker is not working ####   Worst laptop.hard disk is damaged..and so laptop is very slow ####   Fit for nothing ####   Laptop is very slow... Pls don't go for it... Even for basic apps.. ####   AVOID! ####   This product is very slow and can't even run normal apps... regretting after buying it...I need a replacement for it ####   Facing too much UI problem ####   Worst ever product. Not in working condition. ####   It's a good product ####   The laptop ran into an error after the primary Windows update on the first run. Following that ##  it could not find the OS and never booted. The laptop didn't have a replacement ##  hence had to be returned. ####   Use it for daily home browsing. Not for heavy duty usage like gaming etc. Yet ##  the laptop is super slow. ####   Ok now you've come for a budget laptop with attractive specs. I made the same mistake too. ####   Not good... ####   Screen lagging issue ##  ####   Not sure whether its i3. I have another computer with almost similar config. Works/responds well with the same internet connection but this is damn slow. Just installed Eclipse and its like too damn slow. Ill use it for 3 more days if its the same then ill choose to return. ####   Value for money ####   Good quality products ####   Awesome performance. ####   It's the cool laptop ####    FROM THE FIRST DAY I HAD BROUGHT IT WAS LAGGING BUT I TAKE IT VERY COMMON LAGGING BECAUSE IT WAS NEW PRODUCT AFTER 2 DAYS IT WAS TAKING ARROUND 2 MIN TO RESTART WHICH IS NOT APPLICABLE THEN AFTER THAT CURSOR WAS NOT VISIBLE ON THE SCREEN BATTERY BACK IS ALSO LESS THEN 1.30 MIN AND COMPANY SAYS ABOUT AROUND 5 TO 6 HOUR AFTER ALL THIS I HAD ORDERED REPLACEMENT ####   Good to buy ##  ensure little money back deal. ####   The battery backup is not good & as well interfaces are also not up to mark means not feels so reliable or strong. ####   I purchased in MAY now mose is not working ####   Don't go for this one. I'm warning you because I have ordered this laptop on 9th of may 2021 and it came after 18 days on 27 th may.After 4 days I have replaced this order with a new one because it got hanged and the cursor just vanished.Such a terrible experience with this one.On 31st may I have ordered a new one and it took 15 days to tell me the product is unavailable.Fortunately I got my refund after cancellation.Of you guys want to avoid harassment don't go for this one ever.My personal experience says it all ####   Laptop is good for the price (specifications) and has good features. preloaded software OS of windows and MS office was the main draw. Basic specs... i am not a techie or software etc. good for browsing ##  mail ##  small projects PPT/Word? etc ####   Bought this laptop 1 month back. I am disheartened to say that this ASUS product is not at all upto the mark. It is too slow. Bought for my son's online classes. He is not been able to attend his classes as it takes 15 mins to load and keeps on hanging in between. ####   Very slow ####   It is the best laptop at this price point. It takes just 3seconds to boot and is perfect as an everyday light use laptop. Very compact ##  very stylish.  GO FOR IT. ####   It's worst to have such this  Asus  brands  ##  feel better to spend few more money and buy other brands ##  it has very poor serviceing after sales too ####   Good"},{"name": "\n\n\n\n\n\n\n\nLG Gram Ultra-Light 11th Gen Core i7 ## 16 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  16-inches (40.64 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.19 kg ##  3 Yr Warranty (16Z90P-G.AH75A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 45 ## 000.00", "save": "\n\n\n\n₹52 ## 710.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Core i7-1165G7 (2.8 GHz ##  Turbo up to 4.7 GHz ##  L3 Cache 12MB ##  28W)- Window 10 # Display: 16\" (40.6 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 16 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.19 Kg Magnesium Alloy - 80 Wh Battery with 16.5 hr back-up (* MobileMark 2018)##", "no_of_rating": "29 ratings", "avg_rating": "4.4", "total_no_answer": "\n20 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "16Z90P-G.AH75A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "16 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 40 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   I bought LG gram 14\" 1035G7 two days before. Battery backup is of 7:30 Hr only and the company is claiming for 18:30 Hr. Now no feedback policy available and the product also removed and I can not see my own purchase in my app. Totally dissatisfied. It like company wanted to liquidate this product and once it was liquidated run away kind of thing is here. Need assistance ####   My spouse got one of these three years ago ##  and this year I got one for me and another for my dad. It's the best work laptop simply because of how light it is. Less than a kilo ##  and looks like it too. And it is a rugged beast as well - the better half's laptop has survived many a fall without complaints ##  safe a few minor dents. ####   Just one line ##  I'm lovin' it. Got it for 93k.. value for money.. best battery backup ever.. excellent display.. for the work I do ##  due to 16:10 aspect ratio ##  I don't even have to scroll up n down.. makes  work very simple and fast.. I'm hoping this will last for atleast 4-5 yrs ##  considering the build quality.. ####   I'm really blown away when read about LG gram laptop. ####   There are options to upgrade the ssd and RAM ##  i upgraded the ssd ##  overall laptop is fulfilling all my requirements and the battery life is marvelous. ####   My brother Karan Arora recommended this laptop... It was unaffordable but he still managed to make me buy it 😁 ####   if you are in the market for laptop and your requirement is good battery backup with excellent screen then no one come close to LG Gram series. I was confused between Fujitsu UH-X and LG GRAM 16 but both laptops have pros and cons and ultimately I chose LG GRAM over UH-X. Advantages over UH-X are as per below : ####   I bought it on June 13 2021 at the price of 57K on during Amazon Great Deals. Light weight beast as Machine from LG with atleast 12-13 hours battery backup . Hats off to R&D team. ####   Its superb ####   The laptop came in excellent package - the package itself spells the quality and care shown by the makers LG towards their product - unlike all those makers like ASUS or DELL ##  this one was premium. Everything was neat and clean. The pc is incredibly light - if you look at the photos you'll understand. It looks like a 13\" laptop ##  though it's 15 inches! ####   Ordered it a few days ago in the Amazon sale and got a great deal. Purchased it at 61k in Exchange for my lenovo."},{"name": "\n\n\n\n\n\n\n\nLG Gram 17 Ultra-Light 11th Gen Core i5 ## 8 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  17-inches (43.18 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.35 kg ##  3 Yr Warranty (17Z90P-G.AJ55A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 30 ## 000.00", "save": "\n\n\n\n₹47 ## 010.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Corei5-1135G7 (2.4 GHz ##  Turbo up to 4.2 GHz ##  L3 Cache 8MB ##  28 W)- Window 10 # Display: 17\" (43.2 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 8 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.35 Kg Magnesium Alloy - 80 Wh Battery with 15 hr back-up (* MobileMark 2018)##", "no_of_rating": "53 ratings", "avg_rating": "4.5", "total_no_answer": "\n41 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "17Z90P-G.AJ55A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "17 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 25 mins\n", "emi": true, "exchange": true, "five_star": "74%", "four_star": "16%", "three_star": "3%", "two_star": "3%", "one_star": "4%", "reviews": " ####   Purchased just 4 days back. The laptop is very light and well built. ####   Best laptop ..best budget. Best screen . Moreover best warranty than all of competitors . Go for it and leave Dell or HP or others ####   Single hand open is the best!! ####   I got it at 82990  ##  mainly for media consumption purpose  ##  for that is perfect. ####   Laptop with ####   It heats a lot for basic tasks  ##  i5 i a piece of garbage combined with the non existent fan of LG gram makes it worse (evo certification is just for putting basic things right  ##  it doesn’t guarantee everything ####   Got it 4 days ago. Light weight. Be cautious while working on it by the side of a window…it may fall due to the air coming in.  Audio is a little less due to positioning of the speakers beneath the base. Performance is ok. ####   its very nice product and very light weight. easy to handle.. ####   Its a very well built ultra light 17 inch laptop. ####   best laptop ##  battery backup more than 10 hrs  ##  fast  ##  doesn't lag  ##  u have to be careful with the screen it is very delicate ####   Cant ask for more. A handfull of laptop. Simply the best laptop computer I have used so far. Battery does not last as advertised. But I get a decent 10 plus hours backup. In the last one week ##  I charged it only twice. Screen is a very big plus. Very clear and nice display. I reduce the resolution to use my engineering drawings and bring it back to recommended setting after my work is done. We need to wait for all apps to catchup with this resolution. Keyboard and touchpad are fluid. Fingerprint is a breeze. Some bloatware found. I uninstalled some and kept some that that I felt is of use. Speakers are quite good. I read reviews and saw videos and was waiting for a disastrous sound. But the sound is quite good. Most importantly ##  we can hear a full surround sound from these two speakers. The spacing is such that it feels like listening through headphones due to the size of the laptop. ####   Bought the laptop after lot of research.. my main criterias while searching for a laptop were large high resolution display (to view medical images) ##  portability and fast processing.. This one has won in all three.. Very satisfied with this purchase.. Thanks LG and Amazon.. ####   Superb ##  light weight with17\" screen ##  almost full day battery back up ##  very good kwality product from LG ##  love this it ####   top rated screen ####   Simply Value For Money Laptop ####   its been a week ##  the laptop works fine ##  as mentioned is super light ##  even compared to 14/13\" laptop ##  but thats why it is flimsy ##  you will have to be careful plugging charging cable or usb into its ports. ####   Can be better if it has 16 GB RAM. It is very fast and good to work. ####   Very good battery ##  Big screen ##  light weight ##  screen is high resolution but very straining to eyes ##  UV filtration is very bad compared to other laptops ####   Buy Apple MacBook instead. Don't go for LG. It is pathetic in quality and service. Go for MACBOOK AIR M1 ####   Superfast ##  Very slim and lightweighted for this screensize. ####   Earlier I was thinking of getting the 11th gen version but its coming with LPDDR5 so the RAM won't be upgradable. ####   Very competent package. ####   1 lakh me without dedicated GPU... My opinion don't buy... Buy any apply macbook on this price range thank you... ####   I have been looking for this laptop for a few months but have not bought it previously as I already have an HP high configuration Laptop but finally decided to buy it. ####   Really light ##  superb display. ####   The product is good for it's price in India. Obviously it is almost 30k higher than what it is in the US but that's what most fo the laptop companies do in India. The tax diffrences are not that big to create such a price difference but unfortunately most of the companies use this tactics in India. ####   I didnt know that LG also makes laptop. When I saw they are making 17\" laptops for a decent price I decided to give it a try."},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 3 2021 11th Gen Intel Core i3 15.6 FHD Thin & Light Laptop (8GB/256GB SSD/Windows 10/MS Office/2 Year Warranty/Arctic Grey/1.65Kg) ##  82H801CUIN\n\n\n\n\n\n\n", "mrp": " ₹56 ## 690.00", "save": "\n\n\n\n₹16 ## 700.00 (29%)\n\n\n\n\n\n\n\n", "price": "₹39 ## 990.00", "about": "#Free upgrade to Windows 11 when available* Disclaimer-*The Windows 11 upgrade will be delivered late 2021 into 2022. Specific timing varies by device. Certain features require specific hardware. # Processor: 11th Gen Intel Core i3-1115G4 | Speed: 3.0 GHz (Base) - 4.1 GHz (Max) | 2 Cores | 6MB Cache # Operating System: Pre-Loaded Windows 10 Home with Lifetime Validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM DDR4 ##  Upgradable up to 12GB | 256 GB SSD # Display: 15.6\" FHD (1920x1080) | Brightness : 250nits | Anti-Glare # Design: 4 side narrow bezel | 1.99 cm Thin and 1.65 kg Light | Narrow Bezel##", "no_of_rating": "152 ratings", "avg_rating": "4.0", "total_no_answer": "\n57 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery.", "Model": "Ideapad Slim 3", "Brand": "Lenovo", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home 64, English", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": "50%", "four_star": "27%", "three_star": "7%", "two_star": "6%", "one_star": "11%", "reviews": " ####   पैसा बर्बाद करना है इसको खरीद कर ####   Good ####   WIFI  connectivity issues i am facing. whenever i connect it is automatically getting disconnected. if i want it to connect again i need to reset network ####   Light weight and slim good for carrying ####   nice product in this price value ####   its not working within 4 months ####   Good value for money. used for teaching ####   The build quality leaves one disappointed. The specs are on point and the battery life is good. Overall functioning is speedy as one would expect. But the build is plasticky with some sharp edges and underwhelming overall. We have the next model in line as well and there's a world of difference in the feel of the product. ####   Received no display Laptop. Return process is also not up to mark. Delivery agent deny to to pick up so many time because screen is not working even if I have mention screen issue clearly. ####   Good Laptop. Intel i3 11th gen. Lenovo is a dependable brand so went for it. ####   My first laptop very nice . ####   Good one light weight and speed is also good. Value for money ####   It's fine overall ####   Good Laptop ##  Long battery ####   Laptop looks good but the battery works only for 2 hrs even with the basic activity ####   Its just wow battery performance display i rate 4.8 out of 5 to this product ####   The battery backup is not good...speaker quality is also very poor ## if you are on video call its not at audible unless you use earphone...on top of that lennovo service center response is also not good...service center handling is also worst. ####   Guys ##  don’t buy laptops and such gadgets from Amazon ##  you will be let down by their partners. I waited for 3 days for the delivery ##  I had purchased the new laptop on an exchange. The delivery person started pointing out all insignificant issues with the old laptop ##  which was in a perfect working condition ##  and cancelled the order in abruptly ##  they mentioned the reason that the old laptop doesn’t meet the exchange criteria ##  whereas no such thing was mentioned on Amazon. This left a very bad taste of customer experience. ####   Good item eady easy to handle. Light weight and its worthwhile. ####   Using this for my kid online classes. Being mostly Mac users I always feel windows machine as slow ##  but this is comparatively faster thanks to SSD and good processor. Even though machine is plastic body feels durable and light weight. ####   Very sleek ##  light laptop ##  fantastic for the price. Value for money ####   This laptop is excellent value for money it is very good looking and gives a premium feel ####   Hi ####   Fine ####   This is best laptop for home and office use. Speed ##  performance and price is quite good. Also battery life is decent. Value for money and just perfect. ####   Amazing laptop super fast processor. ####   This laptop was purchased for my daughter. This is nice laptop ##  it's light weight and worth to invest the money..!!! ####   Battery life good ####   We received the product today and check the laptop warranty details ##  only 10 months is left (309 days remining) warranty start date: 8th April 2021 and End: 7th April 2022. ####   Purchased product on 16th May  deliverd on 20th May and stopped working on 31st June.... what fun. !!!! Now got lennoveo warranty and get them to fix. Everyone is taking taking advantage in Covid situation fleecing customers looting. @#helplessandcheatedincovid ####   Except camera quality all things good ####   Display and camera is worse ####   Overall not bad. But laptop camera is just very ##  very bad. Keyboard has no backlit. Need 2 hands to open it. Speakers also not that great ##  soft ##  not loud enough. ####   Battery life is not good ####   Great laptop. Windows n ms office is ore installed. Speed is quite good. Well ##  camera quality is not good but in my case I don’t need best camera as I have dslr 😂Rest is ok n fine ! Recommended for students n office use ! ####   37 K INR and you buy a toy. Absolutely a toy and on top of that Lenovo refused to accept return or upgrade request. ####   Don't get into false review ####   Bought this as a backup to my 6 years old laptop. Performance wise there are not many complaints ##  but it is too early.  But the battery is way too bad. The power backup I am getting is 2.5 hours with most of the rime spent either on Google sheets or excel ####   Just check megapixels of camera before buying. ####   Laptop 8gb ram with ssd makes it good purchase. ####   Deliver: Very sharp ####   Very slow configuration ##  automatic system restarts  ##  no inbuilt msoffice  ##  display quality poor  ## not so worthy. Overall bad product ####   Within 10min of Receipt Lap top become OFF ####   The product is awesome and pocket friendly. The build quality assures that you have got something worthy. ####   Really love this product. I have actually bought fell vostro at first but it was very very slow then opted budget laptop for 8gb and this was one among the best which mentioned in YouTube and google..seems those reviews are correct this is best laptop for this price. ####   Overall good configuration for the given price. ####   Nice"},{"name": "\n\n\n\n\n\n\n\nLenovo IdeaPad Slim 3 (2021) | AMD Ryzen 5 |14\" FHD IPS |Thin and Light Laptop | 4-Side Narrow Bezel (8GB/512GB SSD/Win10/MS Office 2019/Backlit KB/Fingerprint Reader/Arctic Grey/1.41Kg) ##  82KT00BXIN\n\n\n\n\n\n\n", "mrp": " ₹71 ## 290.00", "save": "\n\n\n\n₹15 ## 300.00 (21%)\n\n\n\n\n\n\n\n", "price": "₹55 ## 990.00", "about": "#Processor: 5th Gen AMD Ryzen 5 5500U | Speed: 2.1 GHz (Base) - 4.0 GHz (Max) | 6 Cores | 8MB Cache # OS: Pre-Loaded Windows 10 Home with Lifetime Validity # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM DDR4 ##  Upgradable up to 12GB | 512 GB SSD # Display: 14\" FHD (1920x1080) | Brightness : 300nits | IPS Technology | 45% NTSC | Anti-Glare##", "no_of_rating": "144 ratings", "avg_rating": "4.5", "total_no_answer": "\n62 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "\n\nTuesday, Oct 5\n", "Model": "IdeaPad 3", "Brand": "Lenovo", "SpecificUses": "Personal, Business", "ScreenSize": "14 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 25 mins\n", "emi": true, "exchange": true, "five_star": "67%", "four_star": "26%", "three_star": "3%", "two_star": "1%", "one_star": "3%", "reviews": " ####   Good specifications ##  good performance. I am totally happy with the buy. Bought for coding and lifht gaming ####   Best laptop ####   This product has the features and specifications that we generally see on a 60k laptop. ####   Only available ram is 5.76 of 8 Gb. 2 gb of ram is taken by the processor for graphics support. This is how rayzen5 5500U processor works ##  majority of ryzen U series works this way. All other is good with this laptop under budget. Battery backup is pretty good ##  camera quality is average. ####   Speaker is not good  ##  battery is also bad but all over laptop is op . I think better than hp 14 ryzen 5500u . In my first order u button is not working so I replaced laptop . ####   first of all I will tell all of you that this is the best laptop under 53k with latest chipset ryzen5 ## 5500u .I was very scared before buying this one . now I can suggest with confidence  ## everyone should go with this brand. ####   Writing this after using the laptop for two days. Everything in this is laptop is beyond wht i expected. Performance is great ##  display is very good and anti glare as well. Keyboard response is also very good. The only con is it's a bit on the heavier side. Overall I'll say for 52k it's an amazing deal. ####   Over all look and performance is good. Could have improved audio with 2.0 and bottom build quality ####   I bought this laptop today from shop i got it in 52k and this is the best laptop in this price segment ####   everything is good ##  just the camera quality is worst ####   battery life could be better. ####   Overall a good pick if one doesn’t care about camera and speakers quality. ####   I like the overall performance. Except for the sound issue sometimes speaker stops working and after restart starts working again. Not sure it's hardware issue or software. Will contact lenovo customer service and update the experience. ####   Best Laptop in 50K range ##  using it for past 15 days playing youtube in 4k and doing coding stuff and it is taking everything easily. ####   Processor is very good as compared to i3 ##  11 generation. ####   At that price it offers a great value ##  ####   Product is good but sound is slow and camera quality is also not good apart from this light weight boot speed is less than five seconds overall ##  it is worth buying in the price range of 52000 ####   All things excellent except camera quality and sound volume. Overall ##  a value for money laptop at this price point. ####   Overall excellent product..... ####   Used the laptop for a month. Good performance ##  Light weight and premium look. ####   favorite games ##  edit video ##  and more without burning out your processor. ####   It ticks all the boxes. ####    This is really bad. ####   For around 52 thousand ##  It is completely worth it when we compared to other products. ####   Good at this price ####   Best bild quality 60k ## only low volume spikar issue ##  great display quality 75k  ##  fast processor ## value for mony product ####   Update : ####   I bought this laptop one week ago.It was very nice for this price.I am extremely happy for this .light weight and its working and build quality is very very nice..thank you. Go for this laptop if you are opted for study purpose.you will never disappointed. ####   Grab it. Trust me you won't regret. If you are looking this laptop for study ##  coding ##  meetings ##  online classes ##  watching movies ##  sports n all. This is the best choice in this budget. I am not a gamer so no idea about gaming performance. ####   After 1 day use good ####   Good fast laptop at a reasonable price. The features provided are mostly found on a grade higher laptops. Key board backlight ##  finger print sensor ##  300 nits bright screen antiglare with win 10 and office pre installed. ####   BEST BUDGET FRIENDLY LAPTOP WITH RAYZEN 5 5500 PROCCESSOR. ####    The build quality of the laptop seems good ##  it's sturdy in hands and the hinges seem good when opening and closing. ####   Performance is excellent. Everything is smooth and fast ( I don't know about gaming experience as I don't play ). keyboard typing experience is good .it also has backlight keyboard with 2 different brightness settings for dark situations. Display is fullhd anti glare display with good brightness. Watching prime ####   Some cons: ####   I recently purchased this product from Amzon. But I received damaged display. I thought initially that it's a driver issue but later lenovo support team confirmed that display has been internally damaged. This is the 2nd time ##  I have received damaged product from same vendor. I will highly recommend to cross check everything at the first place when unboxing. ####   In this laptop speaker sound is low ##  below from average... ####   Awesome laptop.. it's responding very fast.. one problem I am facing is with warranty..I ordered the laptop on 27/June ##  but the warrenty started on 16/June.. And Amazon support says they can't do anything apart from replacement (which I don't want ##  as the laptop is currently out of stock) ####   I'm loving it ####   Go For it ##  This laptop has got more than what other laptop holds under 60k. Has an extra slot For HDD ##  RAM can be upgraded too. ####   Good laptop at reasonable price. ####   Few points after only a day of usage  ##  will update with numbers later ####    This is very initial impression after just a day of usage. I already used it for 6-8 hours. Battery backup is good. Around 4-5 hours in a single charge. The display is very good at this price range. Bezels arw so thin. The privacy shutter for the webcam will be so useful. This laptop is very lightweight at just 1.4kgs. fingerprint is as fast as a mobile device's fingerprint scanner. Chargind speed is good as well. As far as speed is concerned ##  I faced no problem. I am not gonna use it for gaming though. 2 stage backlight configuration is available. Speaker is okayish but almost all laptop are mediocre at this price range.webcam quality is okayish as well. In this price segment we cant expect more. Do visit Ozone Tech youtube channel to find unboxing videos. I ll update this review once I use the laptop enough. ####   Good Build quality ##  display(14\" ## 300nits)💻 ##  backlight keyboard ##  weight 🦋of the laptop (1.4kg) ##  all are ultimate … ####   Received product yesterday ##   1/4 of the screen has green colour..defective piece received ##  complained to Amazon waiting for return/replacement. ####   Worth every penny ####   The product is really nice ##  the color ##  keyboard ##  display and almost everything is perfect. The only complain I had was the warranty policy ##  I purchased the product(with 1year warranty policy) on 27th June but the warranty policy starts from 14th June ##  I hope that amazon solves up that problem. ####   I purchased this laptop @47k (got 5k discount on ICICI card) from Lenovo store offline. ####   Best laptop at this price range!!! ####    This is a wonderful laptop for this stunning price of 52k. As usual a very quick and neat delivery from Amazon too. ####   Best laptop under 52k . I'm very happy with the product . ####   Best in this price segment. ####   Price - I bought it for INR 51 ## 800. First of all I am not an expert in laptops. Basic stuff like processor ##  clock speed ##  RAM etc. is all I looked at before I zeroed in on this. I have not used many laptops. So my review is a standalone review on this laptop. ####   Washed out and faded colors when comparing with smartphone video quality. Specially notice in animation video. Red look Orange and white look creamy. Calibrated color using AMD Radeon setting. Still no use. ####   After 12 hours of usage I am writing this review: ####   Took a risk by buying without any reviews as it was newly launched and I'm Happy that my decision turns to be great. ####    Everything working good and also very fast response.. according to me Fully loaded laptop. Go for it if you are searching fast laptop for gaming and also professional work ####   Was hoping for 7+ GB usable RAM. Only 5.9GB usable. ####   This is small review for Potential buyers of Lenovo idea pad 3 (2021) Ryzen 5500u version 82KT00BXIN and why I chose it over HP 1030AU (5500U) - ####   UPDATE : HDD upgradability is mis-represented on official lenovo website  for 82KT00B4IN ####   Laptop is sleek in design ##  ergonomically designed keypad ##  good aesthetics.  Shutter for camera & fingerprint reader and good utilities! Initial setup and installations were breezy.  Watched India vs NZ WTC final on Hotstar in Google Chrome.  Sound was quite good & deep; didn't feel as if I was viewing it on laptop; seemed more like connected to an external Bluetooth speaker. ####   Battery 4/5 : Good battery backup. can stand 5-6 hours in one go at least. ####   It's a wonderful laptop. I got this for 52k and at that price this is insane! It has a fingerprint sensor  ##  an fhd+ anti glare display with 300 nits display  ##  ryzen 5 processor which is best in this price range. ####   Lemme make things easy for you ##  I will discuss various points to give you a full idea about this machine. ####   Everything looks really great ## the screen quality and the build is really good except the loudness of the speaker can't even hear anything ##  can't produce half the loudness created by hp14 ryzen 3 5500u ####   Awesome laptop. ####   First impressions are ⭐⭐⭐⭐ ####   Everything is great if ur budget allow you buy it without thinking twice. ####   Only it can be like."},{"name": "\n\n\n\n\n\n\n\nMSI GF75 Thin ##  Intel i5-10300H ##  17.3\" FHD IPS-Level 144Hz Panel Laptop (8GB/512GB NVMe SSD/Windows 10 Home/Nvidia GTX1650 4GB GDDR6/Black/2.2Kg) ##  10SC-095IN\n\n\n\n\n\n\n", "mrp": " ₹82 ## 990.00", "save": "\n\n\n\n₹19 ## 000.00 (23%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 10th Generation Intel Core i5-10300H Up To 4.5 GHz # \"Operating System: Pre-loaded Windows 10 Home with lifetime validity |Preinstalled Software: MSI BurnRecovery ##  MSI Battery Calibration ##  MSI Help Desk ##  Norton Internet Security (trail 60days) Norton Studio (Metro) (permanent free) ##  Nvidia GeForce Experience ##  Nahimic 3 ##  Dragon Center | In the box: Laptop ##  adapter\" # Display: 17.3\" FHD (1920*1080) ##  IPS-Level 144Hz Thin Bezel ##  45% NTSC # Memory & Storage: 8 GB DDR4 3200MHz RAM ##  expandable to 64 GB | Storage: 512GB NVMe SSD. # NVIDIA GeForce GTX1650 GDDR6 4GB Dedicated Graphics # Ultra Thin and light design | Laptop weight: 2.2 kg # Keyboard: Steelseries RED Backlit Keyboard | Camera: HD type (30fps@720p) | Microphone: Built-in microphone##", "no_of_rating": null, "avg_rating": "4.5", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "GF75 Thin 10SC-095IN", "Brand": "MSI", "SpecificUses": "Multimedia, Student, Gaming", "ScreenSize": "44 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 25 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nHP Pavilion Gaming 10th Gen Intel Core i5 15.6-inch (39.6 cms) FHD Gaming Laptop (8GB/256GB SSD + 1TB HDD/144Hz/GTX 1650Ti 4GB Graphics/Windows 10/MS Office/2.28 kg) ##  15-dk1514TX ##  Black\n\n\n\n\n\n\n", "mrp": " ₹81 ## 869.00", "save": "\n\n\n\n₹18 ## 879.00 (23%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 10th Gen Intel Core i5-10300H (2.5 GHz base frequency ##  up to 4.5 GHz with Intel Turbo Boost Technology ##  8 MB L3 cache ##  4 cores) # Memory & Storage: 8 GB DDR4-2933 MHz RAM (1 x 8 GB) ##  upgradable upto 32 GB(2x16GB)| Storage: 256 GB PCIe NVMe M.2 SSD + 1 TB 7200 rpm SATA HDD # Graphics: NVIDIA GeForce GTX 1650 Ti (4 GB GDDR6 dedicated) | Keyboard: Ultra Violet backlit keyboard # Display: 39.6 cm (15.6\") diagonal ##  FHD (1920 x 1080) ##  IPS ##  micro-edge ##  anti-glare ##  250 nits ##  45% NTSC | Refresh rate: 144 Hz # Operating System & Preinstalled Software: Pre-loaded Windows 10 Home with lifetime validity ##  FREE Upgrade to Windows 11* (when available ##  refer product description for more details) | Microsoft Office Home & Student 2019##", "no_of_rating": "87 ratings", "avg_rating": "4.3", "total_no_answer": "\n121 answered questions\n", "delivery_type": "Details", "delivery_date": "FREE Delivery.", "Model": "HP Pavilion Gaming Laptop 15-dk1514TX", "Brand": "HP", "SpecificUses": "Multimedia, Student, Gaming", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 40 mins\n", "emi": true, "exchange": true, "five_star": "60%", "four_star": "27%", "three_star": "3%", "two_star": "3%", "one_star": "7%", "reviews": " ####   Nice product ####   Good enough for gaming ####   I was looking for a desktop replacement for my home use. Not a hardcore gamer ##  just a guy who played games like COD ##  Project IGI ##  GTA ##  different NFS titles in college and some years after. So while replacing my years old desktop ##  thought of buying a so called \"gaming laptop\". Requirements were clear - laptop but not necessarily an ultra portable one (as mobile phone works well while on the move) ##  expandable hardware (specially RAM) ##  without any bias for AMD or Intel ##  have to be fairly latest and must be value for money. Though selected couple of others also from Lenevo and Dell; HP was most value for money of them. And 10th gen Core i5 with 8GB DDR4 (expandable to 16GB for sure) ##  512GB SSD ##  1650Ti graphics card ##  15.6 inch FHD display was enough for my need ##  with a budget of not crossing 60k after all discounts - this laptop is a good fit for my requirements. ####   First and farmost thing: Its a pain to have this laptop. ####   For this price range ##  this is one of the best products to opt for if you are interested in gaming/online class/daily chores ##  basically for students and regular use. ####   Laptop is awesome ####   Probably the best gaming laptop you can get for this budget. Gives 50-60fps for most games on high settings. Load times are incredibly fast ##  and it does not overheat. The battery life is on the lower side. Do not expect more than 3 hours of usage on a single charge while using a video calling app like zoom. ####    If you have the budget ##  GO FOR IT. No need to look on anything else. Firstly ##  it can be said ##  a laptop that runs game well does general works well. This model is tremendously fast and capable. I'm playing Days Gone PC at max settings (even with reshade applied to enhance quality furthermore) ##  and no lags I could notice. A great option at this price. And you've HP's brand value and trust too. ####   Very nice laptop...powerfull for gamming...sound and display quality is also good... running smooth... boot time takes around 5-8 sec... thanx to 512gb ssd... and the intel optane in superd we can use total of 40 gb as system memory ####   Best performance laptop under 70k.... better performance ##  good for gaming ##  good performance in Editing.... Battery lasts more than 3.5 hours with continuous useage with internet (without gaming and editing)......display was good graphic designers can go for it......No heating issues at all...speaker is clear ##  crisp and awesome it's a different experience on speakers..... hardware is quite good... Design as expected in pictures... ####   Very good product ####   Wonderfully laptop with bad battery backup ####   Bang for the buck.... This machine is 🔥🔥 ####   Camera Quality is very Poor & Some times Device Lags alot & battery backup is upto 3 hrs maxxxx so kindly buy other laptop ####   Nice product ####    Horrible experience with the laptop. First of all I received one product which was a used one then asked for a replacement and now the new one has keyboard issue and Spacebar issue. Don't buy HP laptops these are terrible. Not sure whether it is a fault of the vendor or HP but my experience is terrible with this. ####   Very impressive design and build quality performance is best in this price segment ##  sound quality is awesome and display is excellent also battery life is also normal ##  gaming performance is excellent no doubt ####   AFTER 10 DAYS OF USAGE: ####   Performance is awesome ####    We can use this for multipurpose... ####   It is a very good laptop at this price range. The speed and performance is good and can be used for multiple purposes other than gaming ##  like video-editing  ##  photoshop ##  office work etc. The speed can be enhanced by adding additional RAM. (Most compatible RAM for this model) ####   Battery life is vey poor. I think I cannot work without keeping the charger on... The charging is also quite slow. ####    GTA v work v I love it best even I play more super great music please buy this I watch"},{"name": "\n\n\n\n\n\n\n\nLG Gram Ultra-Light 11th Gen Core i7 ## 16 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  16-inches (40.64 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.19 kg ##  3 Yr Warranty (16Z90P-G.AH75A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 45 ## 000.00", "save": "\n\n\n\n₹52 ## 710.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Core i7-1165G7 (2.8 GHz ##  Turbo up to 4.7 GHz ##  L3 Cache 12MB ##  28W)- Window 10 # Display: 16\" (40.6 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 16 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.19 Kg Magnesium Alloy - 80 Wh Battery with 16.5 hr back-up (* MobileMark 2018)##", "no_of_rating": "29 ratings", "avg_rating": "4.4", "total_no_answer": "\n20 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "16Z90P-G.AH75A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "16 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 39 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   I bought LG gram 14\" 1035G7 two days before. Battery backup is of 7:30 Hr only and the company is claiming for 18:30 Hr. Now no feedback policy available and the product also removed and I can not see my own purchase in my app. Totally dissatisfied. It like company wanted to liquidate this product and once it was liquidated run away kind of thing is here. Need assistance ####   My spouse got one of these three years ago ##  and this year I got one for me and another for my dad. It's the best work laptop simply because of how light it is. Less than a kilo ##  and looks like it too. And it is a rugged beast as well - the better half's laptop has survived many a fall without complaints ##  safe a few minor dents. ####   Just one line ##  I'm lovin' it. Got it for 93k.. value for money.. best battery backup ever.. excellent display.. for the work I do ##  due to 16:10 aspect ratio ##  I don't even have to scroll up n down.. makes  work very simple and fast.. I'm hoping this will last for atleast 4-5 yrs ##  considering the build quality.. ####   I'm really blown away when read about LG gram laptop. ####   There are options to upgrade the ssd and RAM ##  i upgraded the ssd ##  overall laptop is fulfilling all my requirements and the battery life is marvelous. ####   My brother Karan Arora recommended this laptop... It was unaffordable but he still managed to make me buy it 😁 ####   if you are in the market for laptop and your requirement is good battery backup with excellent screen then no one come close to LG Gram series. I was confused between Fujitsu UH-X and LG GRAM 16 but both laptops have pros and cons and ultimately I chose LG GRAM over UH-X. Advantages over UH-X are as per below : ####   I bought it on June 13 2021 at the price of 57K on during Amazon Great Deals. Light weight beast as Machine from LG with atleast 12-13 hours battery backup . Hats off to R&D team. ####   Its superb ####   The laptop came in excellent package - the package itself spells the quality and care shown by the makers LG towards their product - unlike all those makers like ASUS or DELL ##  this one was premium. Everything was neat and clean. The pc is incredibly light - if you look at the photos you'll understand. It looks like a 13\" laptop ##  though it's 15 inches! ####   Ordered it a few days ago in the Amazon sale and got a great deal. Purchased it at 61k in Exchange for my lenovo."},{"name": "\n\n\n\n\n\n\n\nMSI GF75 Thin ##  Intel i5-10300H ##  17.3\" FHD IPS-Level 144Hz Panel Laptop (8GB/512GB NVMe SSD/Windows 10 Home/Nvidia GTX1650 4GB GDDR6/Black/2.2Kg) ##  10SC-095IN\n\n\n\n\n\n\n", "mrp": " ₹82 ## 990.00", "save": "\n\n\n\n₹19 ## 000.00 (23%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor: 10th Generation Intel Core i5-10300H Up To 4.5 GHz # \"Operating System: Pre-loaded Windows 10 Home with lifetime validity |Preinstalled Software: MSI BurnRecovery ##  MSI Battery Calibration ##  MSI Help Desk ##  Norton Internet Security (trail 60days) Norton Studio (Metro) (permanent free) ##  Nvidia GeForce Experience ##  Nahimic 3 ##  Dragon Center | In the box: Laptop ##  adapter\" # Display: 17.3\" FHD (1920*1080) ##  IPS-Level 144Hz Thin Bezel ##  45% NTSC # Memory & Storage: 8 GB DDR4 3200MHz RAM ##  expandable to 64 GB | Storage: 512GB NVMe SSD. # NVIDIA GeForce GTX1650 GDDR6 4GB Dedicated Graphics # Ultra Thin and light design | Laptop weight: 2.2 kg # Keyboard: Steelseries RED Backlit Keyboard | Camera: HD type (30fps@720p) | Microphone: Built-in microphone##", "no_of_rating": null, "avg_rating": "4.5", "total_no_answer": null, "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "GF75 Thin 10SC-095IN", "Brand": "MSI", "SpecificUses": "Multimedia, Student, Gaming", "ScreenSize": "44 Centimetres", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 24 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": ""},{"name": "\n\n\n\n\n\n\n\nASUS VivoBook 15 (2020) ##  39.6 cm HD ##  Dual Core Intel Celeron N4020 ##  Thin and Light Laptop (4GB RAM/256GB SSD/Integrated Graphics/Windows 10 Home/Transparent Silver/1.8 Kg) ##  X515MA-BR002T\n\n\n\n\n\n\n", "mrp": " ₹30 ## 990.00", "save": "\n\n\n\n₹6 ## 000.00 (19%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Free upgrade to Windows 11 when available. Disclaimer-Upgrade rollout plan is being finalized and is scheduled to begin late in 2021 and continue into 2022. Specific timing will vary by device # Processor: Intel Celeron N4020 Processor ##  1.1 GHz Base Speed ##  Up to 2.8 GHz Max Boost Turbo Speed  ##  2 cores ##  2 Threads ##  4MB Cache # Memory & Storage: 4GB SO-DIMM DDR4 2400MHz RAM ##  Upgradeable up to 8GB using 1x SO-DIMM Slot with | Storage: 256GB M.2 NVMe PCIe SSD # Graphics: Integrated Intel HD Graphics # Display: 15.6-inch (39.62 cms) ##  LED-Backlit LCD ##  FHD (1920 x 1080) 16:9 ##  220nits ##  NanoEdge bezel ##  Anti-Glare Plane with 45% NTSC ##  82% Screen-To-Body Ratio # Operating System: Pre-loaded Windows 10 Home with lifetime validity # Design & battery: Up to 19.9mm Thin | NanoEdge Bezels | Thin and Light Laptop | Laptop weight: 1.8 kg | 37WHrs ##  2-cell Li-ion battery | Up to 6 hours battery life ;Note: Battery life depends on conditions of usage##", "no_of_rating": "589 ratings", "avg_rating": "4.2", "total_no_answer": "\n128 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "ASUS VivoBook 15 (2020)", "Brand": "ASUS", "SpecificUses": "Personal", "ScreenSize": "15.6 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": null, "emi": true, "exchange": true, "five_star": "52%", "four_star": "30%", "three_star": "7%", "two_star": "2%", "one_star": "8%", "reviews": " ####   I liked it ####    Nice laptop super laptop ####   In dececription mention that this laptop has both 256gb ssd and 256gb hdd that's wrong ####   This is worst product.. plzz every body  don't buy  thos product...waste waste ####   It's best laptop for range under 30 ##  000 ##  i written review after 1 month use ❤️ ####   Good ####   Good battery life 6 hrs approx ## best for online classes and college students ####   This best thing for students in this price. performance is awesome if you are using for normal use.Build is plastic so handle with care. I am happy with it. ####   Nice laptop under the price segment ##  best for student for online class and day to day use ####   Good product for online calss purpose. SSD is very useful. Fast. Coming with Windows 10 OS. Camera is good. Keypads are projected from the base. Easy for kids to operate. Battery back up is perfect. Screen size is bit small. But ok at this cost. Need to install MS Office on our own cost. ####   asus is ok intel processor hang ####   You get what you pay for ##  I bought it for kids online classes and till now it is working very well for that ####   Budget...  Everything perfect...  It giving competition to i3 laptops. ####   Utterly disappointed ##  not working properly. ####   Met expectations ####   It's amazing display ####   Good one for medium use - price is reasonable. ####   Cpu is always 100 usage ##  SSD but still slow than usual ####   Pros: screen ##  smaller in size ##  touchpad and keyboard ####   In this price range it is the best product... ####   I upgradade to asus from my old dell Laptop ##  I got a massive discount  ##  and This Asus is value for money as it has a SSD not HDD or hybrid. Which usually last longer ##  And speed is one of the advantages too. ####    They schould must provide a battery life of 9-10 hrs other then this all thing is good ####   Ok ####   Very useful and value for money ####    👍it's very good and perfect ####   When I bought the laptop it had some sort of booting issue. Later on the laptop stopped working and would not switch on. Also the amazon services took many days to return.. It became a huge problem because the amazon was not accepting return despite the product was within return date range of 15 days. ####   Very good product  on this price thanks amazon ####   The laptop looks beautiful. ####   The laptop was good but the storage is low as mentioned in Amazon there is 256 SSD but in actual there is only 237 SSD and for use only199 SSD storage so it's very bad thing I realized ####   Not bad ####   Spr ####   The MRP shown was around Rs. 45 ## 000/- ##  as per Prime day offer the price will be around Rs. 34000/-. To avail this offer ##  I took the prime membership Rs. 129/-. After exchange ##  the price was Rs. Rs. 24 ## 990/-. All seemed well till now. After receiving the laptop the price on the packet was Rs. 30 ## 000/- ####   Average ####   battery life\" ##  \"light weight\" and \"fingerprint reader\" is good but not sd card reader shoked available. ####   So faster ####   Light weight and good looking. With fast processor. Good for beginners and school going or home users. Happy to have this. ####   Battery life is satisfactory ##  but weight is a bit high. ####   Looking at the memory card socket in the photo ##  but when I received the laptop ##  there is no memory card socket in it. ####    Overall it's a good product for basic use if you don't do video editing and high level processing task...it's ok for video editing too but it takes more time bought in 24900rs ####   Bettery life isn't good. Finger reader is good ##  it got lack ####   Dear Sir ##  ####   Amazing product at this price point I am very happy with this product the fingerprint reader is slightly slow sometimes but the other things are amazing best product at 23000 ####   Its an amazing affordable good laptop ####   Light weight ####   slow processor.... ####   Don't buy this product... ####   Everything is fine till now in laptop except one thing that I got new laptop with many scratch marks on top which will give the feeling that we are using second hand laptop instead of new. ####   The battery is not good. But can't get any better for this price. Weight is light and easy to carry ####   This laptop is awesome ####   Purchased this for the  online classes. ####    Great product.. Sound quality is awesome. Best laptop in this price range for basic use. Haven't tried gaming yet but being a student this is the best option. ####   Laptop charger is not working properly. Please try to solve my problem ####   Good laptop but I bought it for 28k which is pretty high as after purchase it is showing as 24500INR. ####   I was doubtful before buying but its truly amazing...works really fast...web cam is good ...ssd drive... 6 hours backup...15.6 inch super bright screen... what else u can ask within  25 k.. go for it ####   No good ####   Sleek perfect for carry jus like macbookpro but only 1 con no lanport ####   Extremely slow performing system ##  low quality screen and the whole experience of getting the system run is messed up. The product neither accepts a return ##  nor a replacement to a higher model ##  nor a replacement for the same model.  Amazon's 7-day replacement policy is a scam supporting such irresponsible and cheating sellers. Would never recommend this purchase to anyone. Beware of the seller and erroneous replacement plocity statements on the site. Highly disappointing experience. ####   In this price is pretty much good laptop no problem at first day I'll edit this review after 2 month ####   Very good looking ##  fast to boot and nice ####   Nice product ####   Please dont buy. ####   Good quality am happy 😊 ####   Display is extremely bad with even worse viewing angles. ####   It's an excellent. working in good condition ####   Laptop is good value for money for online classes. Webcam video quality is a let down. Otherwise good laptop in this budget ####   Good Product ####   Very good product ####   It is a very good laptop.Best for online class and other work. ####   After opening the laptop and setting id’s and all and then restarting it OS crashed and I have to return the laptop. ####   Nice ####   Laptop is hank and not good work please help ya return ya sending to enginner to home for repair p ####   Value for money ##  good for home use online schooling ####   Very bad laptop .. ####   Good performance so far. Happy with the purchase. Well suited for online classes and light domestic use. Experienced a slight malfunctioning of fingerprint scanner once. Was a minor software glitch which was easily fixed after 10 min online research. ####   Screen is not smart ##  btw it's good for now ####   Does the job. Good quality ####   Processing good value for money ####   Please don’t buy this laptop ####   Best laptop in this price ####   Hattt ####   Awesome product ####   Value for money ####   Dies within 2 weeks.. pure garbage. Kindly refrain from buying from this seller. Kindly avoid this at all cost you will regret it. ####   BEST BUDGHT LAPTOP. ####   Battery Life and Light weight ####   Laptops with ssd always good ####   The charger gets hot after 30 mins of charging but overall a good laptop ####   good for online class"},{"name": "\n\n\n\n\n\n\n\nFujitsu UH-X 11th Gen Intel Core i5 13.3” (33.78cm) FHD IPS 400Nits Thin and Light Laptop (8GB/512GB SSD/Win10/Office/Iris Xe Graphics/Backlit Kb/ Fingerprint Reader/Black/878gms) ##  4ZR1D67595\n\n\n\n\n\n\n", "mrp": " ₹1 ## 07 ## 190.00", "save": "\n\n\n\n₹37 ## 200.00 (35%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Build : Made in Japan | Built with Takumi craftsmanship # Processor: 11th Gen Intel Tiger Lake Core i5-1135G7 | Speed: 2.4 GHz (Base) - 4.2 GHz (Max) | 4 Cores | 8MB Cache # OS: Pre-Loaded Windows 10 Home with Lifetime Validity # Pre-Installed: MS Office Home and Student 2019 # Memory and Storage: 8GB RAM LPDDR4X-4266 | 512 GB SSD # Graphics: Intel Iris Xe Integrated Graphics # Display: 13.3\" Full HD (1920x1080) | IGZO Panel | Brightness: 400 nits | Anti-Glare | 100% sRGB##", "no_of_rating": "14 ratings", "avg_rating": "3.7", "total_no_answer": "\n24 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "UH-X Thin and Light", "Brand": "Fujitsu", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "13.3 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 39 mins\n", "emi": true, "exchange": true, "five_star": "45%", "four_star": "15%", "three_star": "16%", "two_star": "15%", "one_star": "9%", "reviews": " ####    Pros ####    This really serves the purpose. I am satisfied with this product. ####   I like the design and build quality of the laptop ##  for this light weight the build quality is top notch. You don't feel hesitate to carry the laptop around. The keyboard is very good to type on good key travel love to work on document. The screen brightness is sufficiently bright for this laptop both for indoor and outdoor use with 100% color accuracy and processing speed is very good ##  I have got geekbench 5 score about 1400 and 4700 respectively. The battery is very good easily last around 9 to 10 hours for general usage. ####   Overpriced for this mediocre product with no brand value ##  better to check out other products in reputed brands like dell ##  Hp ##  Asus ####   Good laptop can handle most applications smoothly. Meant only for causal gaming. Battery backup lasts for 6.5 hours and not 11 hrs with full screen brightness. It achieves 9 to 10 hours in power saving mode. Built quality is good. ####   Did not meet expectations: ####   This laptop is great in terms of how light weight it is but I do not think this is a good laptop for business use. I have tried this for zoom calls but the speaker is pathetic and camera is even worse.. Very flimsy and has lot of flex. Keypad is not as good as you find on lenovo or hp. Tried my best to adjust but ultimately has to return it. The battery life is not that good. Just 4-5 hrs at the max.  Not sure what Japanese tech went into this laptop ##  this feels like any other cheap Chinese laptop. ####   Lighter than a tab with a solid build quality. ####   I seek Warranty Certificate of 2 years as in Site as decalared in the site while buying ####   Very light ##  fast and cute. If the size was 14 inch ##  it would have been better. Good value for money ####   The laptop has great built with all the required specs and ultra light in weight. Battery is also great for people looking for full day battery backup. ####   First day of using this laptop"},{"name": "\n\n\n\n\n\n\n\nLG Gram 17 Ultra-Light 11th Gen Core i5 ## 8 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  17-inches (43.18 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.35 kg ##  3 Yr Warranty (17Z90P-G.AJ55A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 30 ## 000.00", "save": "\n\n\n\n₹47 ## 010.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Corei5-1135G7 (2.4 GHz ##  Turbo up to 4.2 GHz ##  L3 Cache 8MB ##  28 W)- Window 10 # Display: 17\" (43.2 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 8 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.35 Kg Magnesium Alloy - 80 Wh Battery with 15 hr back-up (* MobileMark 2018)##", "no_of_rating": "53 ratings", "avg_rating": "4.5", "total_no_answer": "\n41 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "17Z90P-G.AJ55A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "17 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            16 hrs and 24 mins\n", "emi": true, "exchange": true, "five_star": "74%", "four_star": "16%", "three_star": "3%", "two_star": "3%", "one_star": "4%", "reviews": " ####   Purchased just 4 days back. The laptop is very light and well built. ####   Best laptop ..best budget. Best screen . Moreover best warranty than all of competitors . Go for it and leave Dell or HP or others ####   Single hand open is the best!! ####   I got it at 82990  ##  mainly for media consumption purpose  ##  for that is perfect. ####   Laptop with ####   It heats a lot for basic tasks  ##  i5 i a piece of garbage combined with the non existent fan of LG gram makes it worse (evo certification is just for putting basic things right  ##  it doesn’t guarantee everything ####   Got it 4 days ago. Light weight. Be cautious while working on it by the side of a window…it may fall due to the air coming in.  Audio is a little less due to positioning of the speakers beneath the base. Performance is ok. ####   its very nice product and very light weight. easy to handle.. ####   Its a very well built ultra light 17 inch laptop. ####   best laptop ##  battery backup more than 10 hrs  ##  fast  ##  doesn't lag  ##  u have to be careful with the screen it is very delicate ####   Cant ask for more. A handfull of laptop. Simply the best laptop computer I have used so far. Battery does not last as advertised. But I get a decent 10 plus hours backup. In the last one week ##  I charged it only twice. Screen is a very big plus. Very clear and nice display. I reduce the resolution to use my engineering drawings and bring it back to recommended setting after my work is done. We need to wait for all apps to catchup with this resolution. Keyboard and touchpad are fluid. Fingerprint is a breeze. Some bloatware found. I uninstalled some and kept some that that I felt is of use. Speakers are quite good. I read reviews and saw videos and was waiting for a disastrous sound. But the sound is quite good. Most importantly ##  we can hear a full surround sound from these two speakers. The spacing is such that it feels like listening through headphones due to the size of the laptop. ####   Bought the laptop after lot of research.. my main criterias while searching for a laptop were large high resolution display (to view medical images) ##  portability and fast processing.. This one has won in all three.. Very satisfied with this purchase.. Thanks LG and Amazon.. ####   Superb ##  light weight with17\" screen ##  almost full day battery back up ##  very good kwality product from LG ##  love this it ####   top rated screen ####   Simply Value For Money Laptop ####   its been a week ##  the laptop works fine ##  as mentioned is super light ##  even compared to 14/13\" laptop ##  but thats why it is flimsy ##  you will have to be careful plugging charging cable or usb into its ports. ####   Can be better if it has 16 GB RAM. It is very fast and good to work. ####   Very good battery ##  Big screen ##  light weight ##  screen is high resolution but very straining to eyes ##  UV filtration is very bad compared to other laptops ####   Buy Apple MacBook instead. Don't go for LG. It is pathetic in quality and service. Go for MACBOOK AIR M1 ####   Superfast ##  Very slim and lightweighted for this screensize. ####   Earlier I was thinking of getting the 11th gen version but its coming with LPDDR5 so the RAM won't be upgradable. ####   Very competent package. ####   1 lakh me without dedicated GPU... My opinion don't buy... Buy any apply macbook on this price range thank you... ####   I have been looking for this laptop for a few months but have not bought it previously as I already have an HP high configuration Laptop but finally decided to buy it. ####   Really light ##  superb display. ####   The product is good for it's price in India. Obviously it is almost 30k higher than what it is in the US but that's what most fo the laptop companies do in India. The tax diffrences are not that big to create such a price difference but unfortunately most of the companies use this tactics in India. ####   I didnt know that LG also makes laptop. When I saw they are making 17\" laptops for a decent price I decided to give it a try."},{"name": "\n\n\n\n\n\n\n\nLG Gram Ultra-Light 11th Gen Core i7 ## 16 GB RAM ##  512 GB SSD ##  Win-10 ##  Iris Xe Graphics ##  16-inches (40.64 cms) ##  Thunderbolt 4 ##  USC -C x 2 (with Power) ##  1.19 kg ##  3 Yr Warranty (16Z90P-G.AH75A2 ##  Black)\n\n\n\n\n\n\n", "mrp": " ₹1 ## 45 ## 000.00", "save": "\n\n\n\n₹52 ## 710.00 (36%)\n\n\n\n\n\n\n\n", "price": null, "about": "#Processor & OS: Intel 11th Gen Core i7-1165G7 (2.8 GHz ##  Turbo up to 4.7 GHz ##  L3 Cache 12MB ##  28W)- Window 10 # Display: 16\" (40.6 cm) WQXGA (2560 x 1600) 16:10 Aspect Ratio IPS Display with DCI-P3 99% # Memory: 16 GB LPDDR4X (Dual Channel-4266 MHz) # Storage: 512 GB SSD (Type:M.2 2280) NVMe with additional expansion slot # Product & Battery: Weight 1.19 Kg Magnesium Alloy - 80 Wh Battery with 16.5 hr back-up (* MobileMark 2018)##", "no_of_rating": "29 ratings", "avg_rating": "4.4", "total_no_answer": "\n20 answered questions\n", "delivery_type": "FREE delivery:", "delivery_date": "EMI", "Model": "16Z90P-G.AH75A2", "Brand": "LG", "SpecificUses": "Multimedia, Personal, Business", "ScreenSize": "16 Inches", "OS": "Windows 10 Home", "more_detail": "", "order_within": "\n            1 hr and 39 mins\n", "emi": true, "exchange": true, "five_star": null, "four_star": null, "three_star": null, "two_star": null, "one_star": null, "reviews": " ####   I bought LG gram 14\" 1035G7 two days before. Battery backup is of 7:30 Hr only and the company is claiming for 18:30 Hr. Now no feedback policy available and the product also removed and I can not see my own purchase in my app. Totally dissatisfied. It like company wanted to liquidate this product and once it was liquidated run away kind of thing is here. Need assistance ####   My spouse got one of these three years ago ##  and this year I got one for me and another for my dad. It's the best work laptop simply because of how light it is. Less than a kilo ##  and looks like it too. And it is a rugged beast as well - the better half's laptop has survived many a fall without complaints ##  safe a few minor dents. ####   Just one line ##  I'm lovin' it. Got it for 93k.. value for money.. best battery backup ever.. excellent display.. for the work I do ##  due to 16:10 aspect ratio ##  I don't even have to scroll up n down.. makes  work very simple and fast.. I'm hoping this will last for atleast 4-5 yrs ##  considering the build quality.. ####   I'm really blown away when read about LG gram laptop. ####   There are options to upgrade the ssd and RAM ##  i upgraded the ssd ##  overall laptop is fulfilling all my requirements and the battery life is marvelous. ####   My brother Karan Arora recommended this laptop... It was unaffordable but he still managed to make me buy it 😁 ####   if you are in the market for laptop and your requirement is good battery backup with excellent screen then no one come close to LG Gram series. I was confused between Fujitsu UH-X and LG GRAM 16 but both laptops have pros and cons and ultimately I chose LG GRAM over UH-X. Advantages over UH-X are as per below : ####   I bought it on June 13 2021 at the price of 57K on during Amazon Great Deals. Light weight beast as Machine from LG with atleast 12-13 hours battery backup . Hats off to R&D team. ####   Its superb ####   The laptop came in excellent package - the package itself spells the quality and care shown by the makers LG towards their product - unlike all those makers like ASUS or DELL ##  this one was premium. Everything was neat and clean. The pc is incredibly light - if you look at the photos you'll understand. It looks like a 13\" laptop ##  though it's 15 inches! ####   Ordered it a few days ago in the Amazon sale and got a great deal. Purchased it at 61k in Exchange for my lenovo."}]